window.LDB_SITE_DATA = {
    "generatedAt":  "2026-07-13T18:20:00",
    "pages":  [
                  {
                      "href":  "appendix__about.html",
                      "title":  "关于本书与作者",
                      "description":  "关于这本书的项目、作者和任何学分",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/about",
                      "breadcrumbs":  [
                                          "APPENDIX"
                                      ],
                      "searchText":  "关于本书与作者 关于这本书的项目、作者和任何学分 The Level Design Book 中文版是一个由志愿者运营的免费非营利项目。 关于本书 关卡设计是一种即将消亡的艺术。现代工业工作流程和程序生成内容的流行意味着 20 世纪 90 年代传统上理解的关卡设计感觉与当代游戏类型和趋势越来越不相关。 然而，许多游戏（和公司）仍然需要关卡设计师——而今天的初学者关卡设计师没有任何好的学习资源可以使用。 上一代关卡设计师在 20 世纪 90 年代/2000 年代成长，从 Web 1.5 独特的定制在线关卡设计社区中受益匪浅——轻松地与同行共享和构建知识。如今，所有这些知识都更加难以获取和发现。整个互联网已经商品化为少数通用社交媒体网络，而搜索引擎通常变得更糟糕/帮助更少。 走出黑暗时代的方法有很多，但在这里我们将尝试文艺复兴模式并复兴旧的方法：在页面上写字 （并编辑这些词！！）， 手动管理链接，并将信息集中在社交网络外部的独立网站上。 路线图 第一阶段：写一本有扎实的文字、链接和插图的书；对所有主题都有很好的报道 第二阶段：转变为一本活书；遵循《Nature of Code》和《Book of Shaders》等灵感，它们在文本本身中提供了设计工具和练习 构建一个简单的可嵌入 Web 的 3D 关卡设计工具，其中包含白盒、试玩测试和基本游戏元素 互动示例 第三阶段：？？？ 关于作者 核心作者/编辑 这些人撰写了本书的大部分文字，并共同编辑了贡献。 罗伯特·杨（Robert Yang）是该项目的创始人。作为一名独立游戏开发者，他最出名的作品是关于性和亲密关系的 Radiator 游戏。过去，他还为 Black Mesa Source 等项目贡献了关卡，并对 Rock Paper Shotgun 的关卡设计师进行了采访。 （ https://debacle.us ) 贡献者 这些人为本书贡献了大量的研究、写作或资产。 安德鲁·约德 曾参与《圣骑士》和《Warframe》的开发，专注于多人社交空间和战斗设计。 额外学分 The Level Design Book 中文版徽标由 The Noun Project 的图标组成 马克西姆·库利科夫 和 普里扬卡 . 一般来说，本书的大部分材料来自许多不同的作者。我们坚信注明出处的重要性，并尝试尽可能多地引用和链接。所有这些归属内容均属于这些各自的创作者。"
                  },
                  {
                      "href":  "appendix__communities.html",
                      "title":  "社区",
                      "description":  "关卡设计社区、网站、discord、播客、博客、社交媒体的链接",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/communities",
                      "breadcrumbs":  [
                                          "APPENDIX"
                                      ],
                      "searchText":  "社区 关卡设计社区、网站、discord、播客、博客、社交媒体的链接 寻找关卡设计社区 加入关卡设计有很多好处 社区 : 帮助解决设计问题/故障排除工具 为您的工作提供重要反馈 动机和鼓励 理想情况下，加入特定于游戏的社区 特定于游戏的社区可以提供有针对性的帮助/经验，并且他们更有可能测试您的工作并提供良好的反馈。 对于特定于游戏的关卡设计社区，请参阅中的“社区”栏 工具 . 看看所有这些快乐的人共享同一个空间；如果您加入关卡设计社区，这也可能是您 G 通才关卡设计社区 #blocktober 是关卡设计师发布的一年一度的互联网传统 白盒 10 月份 Twitter 上的屏幕截图。最受欢迎的推文通常来自 AAA 行业级设计师，他们发布了著名商业游戏的白盒作品。 地图核心 是运行时间最长的关卡设计活跃留言板之一，主要关注 Source Engine 游戏（CS:GO、军团要塞 2（ Steam ）），但许多成员也定期修改其他游戏并使用 Unity 和 Unreal。模组制作者和行业用户的混合体。 设计室 是由 Ryan Smith 创立的关卡设计师 Discord 社区。 环境美术社区 多计数 最适合 3D 环境美术家、灯光艺术家以及任何更关心关卡设计视觉方面的人。项目严重偏向于使用 Maya / Max / ZBrush / Blender 专业知识的虚幻引擎 4 场景。这里没有人会测试您的项目，但他们会很乐意批评屏幕截图或视频。学生和行业用户的混合体。 80级 为游戏/电影/视觉特效艺术家提供新闻、文章和指南。它通常非常注重技术和工具，通常侧重于管线和工作流程，以及特定场景或项目的面向视觉的细分。 超越范围 包含对环境美术家的采访、文章和指南以及播客。与其他 CG 艺术社区一样，它专注于工具和技术。 理论、写作、批评 场地/刊物 GDC关卡设计峰会 （以前称为“关卡设计研讨会”、“关卡设计一天”）每年都会有来自行业和独立关卡设计师的一整天的演讲。多年后，它在 GDC 上找到了中等规模的受众。不幸的是，没有过去会议的方便列表，但也许有一天我们会把它们放在一起。 每年夏季/秋季开放提交。 异托邦 可能是目前首屈一指的设计批评出版物，以简短的博客文章以及长篇专题和采访为特色。 全年收取佣金和推介，向作家支付费用。 石头纸霰弹枪 主持过多个以设计为重点的系列节目，例如 什么有效以及为什么有效 （游戏设计细分）， The Mechanic （更多游戏设计细分）和 与我齐平 （对关卡设计师的采访）。 全年收取佣金和推介，向作家支付费用。 GDC是行业级设计知识的主会场；视频仍然来自 GDC 2015“利用 Sunset Overdrive 从线性设计过渡到开放世界设计”，作者：Liz England （失眠游戏） 博客/直播/播客 建筑想象力 是一门关于建筑理论和历史的免费哈佛在线课程，每年运行一次，因其概念重点而受到行业级设计师的欢迎。 史蒂夫·李 制作有关他作为 AAA 关卡设计师的经验的视频，并为关卡设计作品集和资源提供建议。 尤留-科斯明·奥尼斯库 撰写有关开放世界 AAA 制作和遭遇战系统的文章，通常采用类似育碧的方法。 安德鲁·约德 关于遭遇战设计和多人关卡设计的博客。他还偶尔上传关卡设计视频评论 他的 YouTube 频道 . JP勒布雷顿 溪流 星期三 ，每周玩几个随机选择的《毁灭战士》（ Steam ）关卡。 关卡设计播客 是由 Mark Drew、Jonathan Wilson、Valentina Chrysostomou 和 Rob McLachlan 主持的播客。 楼层设计大堂 是一个由 Max Pears 主持的播客。 游戏制作者工具包 (GMTK) 是 Mark Brown 制作的一个非常受欢迎的游戏设计分析 YouTube 频道。他经常批评关卡并提出好的观点，但我们想提醒您，他并没有真正作为关卡设计师的个人经验。 截图账户 以下是一些有趣的 Twitter 帐户，它们的存在只是为了发布社区关卡的屏幕截图；他们很值得关注，因为看到更多关卡将帮助您训练关卡设计的眼光，而且看看其他人制作的东西很有趣。 @Slipseer 发布《雷神之锤 1》（ Steam ）地图截图 @GoldsourceGold 帖子 GoldSrc（半条命 1 引擎）地图截图 @WADb0t 发布自定义 《毁灭战士》 WAD 屏幕截图 @dot__UNR 帖子 虚幻 / 虚幻锦标赛 1999 地图截图 @Tf2Dot 帖子《军团要塞 2》社区地图截图 @Taffing关于 发布《神偷与神偷 2》粉丝任务截图。 @dot_bsp 原始关卡设计屏幕截图帐户（？）发布了 GoldSrc 屏幕截图（截至 2019 年已暂停）"
                  },
                  {
                      "href":  "appendix__license.html",
                      "title":  "许可与版权",
                      "description":  "所有被引用的材料、插图、引文、游戏截图、嵌入视频、游戏内容等，均归原创作者或工作室所有。本书基于非商业教育目的，在 合理使用 原则下收录这些内容，并始终尽可能标明来源、链接回原作者。",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/license",
                      "breadcrumbs":  [
                                          "APPENDIX"
                                      ],
                      "searchText":  "许可与版权 版权 所有被引用的材料、插图、引文、游戏截图、嵌入视频、游戏内容等，均归原创作者或工作室所有。本书基于非商业教育目的，在 合理使用 原则下收录这些内容，并始终尽可能标明来源、链接回原作者。 由于本书材料的共同创作关系很复杂， 我们永远不会将本书放到付费墙后，也不会销售本书的任何副本。 出于类似原因， 我们通常不收录其他关卡设计书籍中的材料， 因为在这些情况下，合理使用的边界没有那么清晰。你应当购买并阅读这些书。 推荐书目列表请见 The Level Design Book 中文版 . DMCA 如果你是受本站内容影响的版权方，并希望我们从页面中移除相关内容，请 联系编辑 ，并提供：（1）问题页面的 URL；（2）需要下架内容的简要说明。 许可证 全部 未注明出处的文本 本在线书中的内容特此获得许可 知识共享署名-非商业性-相同方式共享 4.0 国际 (CC BY-NC-SA 4.0) 许可证。 你可以发布或分发本书或其译本，无论是部分还是全部，但需遵守以下条件： 不得销售本书，也不得对本书的访问收费 (不得收取付费订阅或许可费) 你必须 在你的副本正文中明显署名本书，并链接回本站 您还必须根据 CC BY-NC-SA 4.0 许可证对您的任何修改进行许可，并在副本正文中突出说明此许可证。 内容创作者和视频作者： 如果您制作一个视频来解释、总结或解释本书的内容，那么请 (1) 在视频中大声引用本书，以及 (2) 在视频描述 + 文字聊天中突出地链接回我们。 其他人： 请使用（1）\"The Level Design Book\"进行署名，并（2）直接链接到对应书页的 URL。 学生： 看到 如何引用本书 . 如何引用本书 如果你正在撰写研究论文，以下是几种常用引用格式，供你方便使用。确保更换 ALL-CAPS 包含您自己的引文数据的字段。 MLA格式 : “ PAGE TITLE .” The Level Design Book, PAGE URL 。已访问 DAY MONTH YEAR . Chicago Style : \" PAGE TITLE ”，《The Level Design Book 中文版》，已访问 MONTH DAY , YEAR . PAGE URL . APA风格 : PAGE TITLE 。 （日期不详）。已检索 MONTH DAY , YEAR , 从 PAGE URL . ACM : The Level Design Book. PAGE TITLE 。已检索 MONTH DAY , YEAR 来自 PAGE URL 许可证详情 以下是便于阅读的摘要（不能替代） 许可证 . 免责声明 . 您可以自由地： 分享 — 以任何媒介或格式复制和再分发该材料 适应 — 重新混合、转换或基于该材料进行再创作 只要您遵守许可条款，许可方就不能撤销这些自由。 根据以下条款： 归因 — 你必须给出 适当署名 ，提供许可证链接，并 说明是否做了修改 。您可以以任何合理的方式这样做，但不得以任何暗示许可方认可您或您的使用的方式。 非商业性使用 — 您不得将该材料用于 商业目的 . 相同方式共享 — 如果您对材料进行重新混合、转换或构建，您必须根据以下规则分发您的贡献： 相同许可证 分发。 不得附加限制 — 您不得应用法律条款或 技术措施 从法律上限制他人做许可证允许的任何事情。 注意事项： 您不必遵守公共领域的材料元素的许可，或者在适用的许可下使用该材料的许可。 例外或限制 . 不提供任何保证。该许可证可能不会向您提供预期用途所需的所有权限。例如，其他权利，例如 公开权、隐私权或精神权利 可能会限制你使用该材料的方式。"
                  },
                  {
                      "href":  "appendix__resources.html",
                      "title":  "资产与资源",
                      "description":  "在哪里可以获得用于关卡的免费艺术资源（模型、纹理、材质）",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/resources",
                      "breadcrumbs":  [
                                          "APPENDIX"
                                      ],
                      "searchText":  "资产与资源 在哪里可以获得用于关卡的免费艺术资源（模型、纹理、材质） 此页面列出了关卡中使用的免费艺术资源（模型、纹理、材质）。 我们只列出具有强大功能的网站 免费 下载计划+ 通用文件格式 适用于大多数引擎。 “CC许可证”是指获得许可的免费资产 知识共享 或 公共领域 风格许可证。可能需要注明出处。 更多资源： 书籍 ：其他关卡设计书籍列表，附有简短摘要 《雷神之锤》资源 ：免费纹理 .WAD 和其他 《雷神之锤》（ Steam ）特定文件的列表 3D模型和道具（免费） CC 许可证？ 网站 内容 CC 许可证？ 素描工厂 互联网上最大的免费低多边形+现实+3D扫描资产选择；质量参差不齐；确保过滤“可下载”！ 开放游戏艺术 有很多专为游戏设计的免费模型，但质量参差不齐 肯尼 游戏中最多产的免费资产创造者；许多精心设计的低多边形 3D 图块集 夸特尼乌斯 另一个多产的免费资源创建者，大量免费的低多边形 3D 道具和角色 肥沃的土壤 许多良好的低多边形 3D 模块/图块集，特殊的 Unity 集成，但适用于任何 混合交换 为 Blender 用户提供免费社区模型交换...学习如何将模型从 .blend 导出到 .fbx / .obj 并不难 涡轮鱿鱼 曾经是互联网上最大的股票3D平台；还有一些免费的好东西 材质和纹理（免费） 网站 内容 CC 许可证？ 波利哈文 许多免费的照片扫描 8k+ PBR 材料，以及高多边形模型库 环境CG 以前是 CC0Textures；大量具有 PBR 支持的固体 4k / 8k 材质 开放游戏艺术 很多为手绘风格的游戏设计的免费纹理，质量参差不齐 纹理忍者 免费照片源适合复古氛围 纹理实验室 较小的免费图片源集合 白盒原型纹理 制作时 白盒 ，我们建议使用网格占位符纹理来制作关卡几何形状的原型。这有助于建立一致的规模和 标准尺度规范 对关卡。 Gridbox 原型材料 作者：Ciathyza（Unity） 原型工具 作者：Code Respawn (虚幻 4) 白盒材质 作者：汤姆·卢曼（虚幻 4） 原型纹理 作者：肯尼 (.png) 天空盒 天空盒是一种特殊类型的 6 面立方体贴图纹理，给人一种遥远天空背景的错觉。现代游戏引擎通常使用程序天空着色器/天空穹顶，但有时老式的方法更有效。 《雷神之锤》/《半条命》风格的天空盒 https://www.quaddicted.com/webarchive/kell.quaddicted.com/skyboxes.html https://lvlworld.com/review/《雷神之锤》%203%20Arena%20skybox%20collection http://www.simonoc.com/pages/artwork.htm 2D 图块集和精灵（免费） 要制作 2D 关卡，您通常需要一个基于图块的关卡编辑器。参见 工具 . 网站 内容 CC 许可证？ 开放游戏艺术 10000+个免费图块包和精灵，大多是复古/像素艺术风格，但种类繁多，基本上是第一个看的地方 肯尼 光滑的厚块瓷砖包和精灵，非常好，但也非常容易辨认"
                  },
                  {
                      "href":  "appendix__resources__books.html",
                      "title":  "推荐书目",
                      "description":  "推荐关卡设计书籍...除了这本",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/resources/books",
                      "breadcrumbs":  [
                                          "APPENDIX",
                                          "资产与资源"
                                      ],
                      "searchText":  "推荐书目 推荐关卡设计书籍...除了这本 正如在 简介 ，请记住，关卡设计有不同类型。因此，有不同类型的The Level Design Book 中文版。 我们一般不推荐任何 2000 年代之前的The Level Design Book 中文版。 20多年来发生了很多变化。游戏行业和文化有很大不同，更不用说工具、工作流程和语言了。 正如我们讨论的 许可/版权 页， 我们通常避免包含其他The Level Design Book 中文版中的内容。 你应该自己借/买这些书。 通才关卡设计书籍 通才书籍将关卡设计视为更大的设计问题的一个方面。这类书籍通常是由从多个角度研究该主题的学者撰写的。 如果您是一位具有大局观的思考者，或者您对游戏行业持怀疑态度，那么这些书就是适合您的。 然而，缩小范围也意味着错过更具体的技术细节。对于与关卡编辑器较量的初学者来说，这种哲学焦点可能毫无帮助。 关卡设计的架构方法 (2014) Christopher Totten 的著作是一本理论性很强的通才关卡设计教科书。 Totten 将很多核心架构教育（基本绘图、设计概念草图、前景和避难所等）与一些游戏示例联系起来。概念设计理论的一个很好的综述。 关卡设计：流程和体验 (2017) 由 Christopher Totten 编辑的案例研究集涵盖了来自不同学者、评论家和开发人员的许多关卡设计主题。这项多样化的调查对于衡量我们对关卡设计的集体理解很有用，但所有这些不同的背景在目标和方法上都有很大差异。 Yakuza 玩家的个人文章与 PCG 方法的研究概述有什么共同点？这是一个有趣的问题，尽管答案并不容易适用于初学者。 游戏设计词汇 (2014) 由 Anna Anthropy 和 Naomi Clark 编写的《游戏设计入门》是一本强大的一体化入门性游戏设计教科书，其中包含简化的游戏设计语言以及与平台游戏关卡设计相关的几个精彩章节。可能是最好的 2D 关卡设计书之一。非常适合对游戏或关卡设计感兴趣但可能不知道从哪里开始的初中/高中/青少年。 工业级设计书籍 行业书籍是由曾推出过一些 3D AAA 动作射击游戏的工作关卡设计师编写的。与通才学者相比，他们的关注范围往往更窄，专注于特定的技术和情况。对于初学者来说，这似乎比非行业学术哲学家更好。 要变得如此具体，是有代价的——这些书必须对类型和读者做出很多假设，而且他们很少想象任何更大的总体理论。它通常读起来就像一堆随机的该做和不该做的事情。但如果您的创意目标符合行业的目标，那么您会在这里找到很多有用的建议。 关卡设计的方法和原因 (2008) 作者：Sjoerd“Hourences”De Jong 是最好的 3D 关卡设计书之一，尽管其中一些书籍自 15 多年前以来就已经过时了。然而，De Jong 是一位经验丰富的行业开发人员，他构建了大量 3D 关卡，其中大部分工作经验都反映了他直接的建议和示例。考虑到这本书的年代，请熟悉一下 关卡设计师的历史 ，否则德容黄金时代对低多边形结构的迷恋可能就没有意义了。 让我们设计：战斗 (2020) 马克斯·皮尔斯（Max Pears）的《遭遇战设计》可能是有史以来第一本（也是唯一一本）遭遇战设计书，其中有很多图表和可爱的卡通插图。然而，请注意，Pears 假设您不仅仅是制作一款射击游戏，而是一款相当具体的军事主题射击游戏，具有特定的敌人类型和武器等。尽管如此，他还是为战斗游戏提供了许多有用的语言和模式。 构建游戏世界 （2023 年以后推出？） 汤米·诺伯格 (Tommy Norberg) 即将出版的关卡设计书 他的热门关卡设计推文 。老实说，我们认为以图像为主的格式并不是最好的，通常会过度简化玩家心理并扁平化细微差别。无论如何，很多人都从他的建议和见解中受益，因此很难忽视他有影响力的观点。 游戏参考书/美术书 Prestige AAA 版本通常配有配套的“艺术书籍”，其中显示了制作过程中的大量过程图像和资产细分，以提供“幕后”的外观和感觉。这些书往往侧重于环境美术，有大量概念艺术和资产细分。 《半条命 2》：提高标准 (2004) 大卫·霍奇森 (David Hodgson) 的著作也许是有史以来最著名的游戏艺术书籍。早在 2000 年代，当时 Valve 仍然定期制作具有精湛工艺和保密性的单人游戏，这本书提供了对 Valve 历史和档案的罕见了解。今天读来有点伤感；这是很久以前的黄金时代的记录，当时 Valve 是一位鼓舞人心的设计领导者，而不仅仅是我们仁慈的房东。 耻辱2的艺术 (2016) 作者 Ian Tucker 讲述了 Valve 的火炬手 Arkane Studios 及其高度参与的创作过程。 Arkane 是最后一批仍在制作具有黄金时代关卡设计敏感性的著名单人故事射击游戏的 AAA 工作室之一，许多关卡设计师仍然尊敬他们。 虚拟城市：电子游戏城市地图集与探索 (2020) 康斯坦丁诺斯·迪莫普洛斯 (Konstantinos Dimopoulos) 所著的这本书并不是官方艺术书籍，而是城市规划者对几个电子游戏城市的研究，打包为虚拟旅行指南。 Dimopoulos 从现实世界游客的想象角度进行写作，而不是玩家或开发人员，因此这与其说是幕后故事，不如说是延伸 世界建设 分析。 建筑书籍 了解现实世界架构的基础知识对于关卡设计很有用。 我在建筑学校学到的 101 件事 Matthew Frederic 撰写的经典架构和快速设计入门读本，大多数行业级设计师至少都浏览过。在聚会上谈论这些建筑教育就足够了，而且它的简洁性确保你能真正读完它。然而，由于它很短，它实际上并没有研究任何特定的建筑——这就像不读任何书籍而研究文学一样。这对于概念概述很有用，但它不会为您提供任何示例来练习应用这些概念。 建筑：形式、空间和秩序 由弗朗西斯·程（Francis Ching）撰写的作品经常被分配到大学一年级的建筑课程中，但对于非建筑师来说，它仍然足够平易近人。 Ching 自信的手绘示例敦促读者关注永恒的基础知识，而不是华而不实的 CAD 美学。 Frederic 的简化方法缺少对实际建筑物的特殊性和关注。然而，Frederic 会非常清楚地阐明一些内容，而 Ching 则更加难以捉摸，并希望你自己做更多的思考。 模式语言：城镇、建筑、建设 克里斯托弗·亚历山大等人。是一本著名的建筑和城市设计手册，试图详细介绍住宅、社区和城市的良好设计原则。诸如“卧室应该有阳光充足的窗户”或“每个社区都需要一条适合步行的市场街道和当地咖啡馆”之类的规则。对于关卡设计师来说，规则本身不如亚历山大的方法论重要：他的词汇和语法是描述和设计世界的强大方式，对于开放世界设计和世界构建非常有用。 建筑参考 建筑语法 要审查... 通才The Level Design Book 中文版试图从多个角度来理解它 行业级设计书籍专注于特定流派和风格 建筑书籍提供了第三种视角：如果你必须生活在你的关卡中怎么办？如果关卡设计已有数千年的历史怎么办？ 尝试阅读一切，未来不只在一处"
                  },
                  {
                      "href":  "appendix__resources__formats.html",
                      "title":  "文件格式",
                      "description":  "文件格式/映射和修改中使用的文件类型规范",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/resources/formats",
                      "breadcrumbs":  [
                                          "APPENDIX",
                                          "资产与资源"
                                      ],
                      "searchText":  "文件格式 文件格式/映射和修改中使用的文件类型规范 附录 资产与资源 文件格式 文件格式/映射和修改中使用的文件类型规范 FGD 文件格式 MAP 文件格式 MDL 文件格式 上一页 如何打包 《雷神之锤》 地图/Mod 下一步 FGD 文件格式 最后更新 4年前"
                  },
                  {
                      "href":  "appendix__resources__formats__fgd.html",
                      "title":  "FGD 文件格式",
                      "description":  "《雷神之锤》（ Steam ） 时代关卡编辑器的实体定义文件/映射辅助",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/resources/formats/fgd",
                      "breadcrumbs":  [
                                          "APPENDIX",
                                          "资产与资源",
                                          "文件格式"
                                      ],
                      "searchText":  "FGD 文件格式 《雷神之锤》（ Steam ） 时代关卡编辑器的实体定义文件/映射辅助 烟气脱硫 是一种常见的文本文件格式，在多个 《雷神之锤》 时代的关卡编辑器工具中使用（例如 TrenchBroom ) 来定义实体。 安 实体 基本上是任何非静态世界几何体的游戏对象——NPC、物品、灯光、声音、门、玩家生成点等。任何可以移动、改变或反应的东西。 请注意，FGD 只是添加模板和文档的编辑辅助工具。 它本身不实现任何引擎内游戏功能。 它只是帮助关卡设计师理解和配置对象。从技术上讲，您不需要 FGD 来为游戏绘制地图；理论上，您可以简单地手动记住并验证所有关卡脚本数据。 有关常见游戏对象类型和行为的更多信息，请参阅 脚本编写 . 本页假定您对常见的 《雷神之锤》 映射术语有一定的了解。 历史 FGD 代表“Forge Game Data”，是《半条命 2》（ Steam ）关卡编辑器 Hammer 成为《半条命 1》编辑器 Worldcraft 时的遗留物，在此之前是名为 Forge 的 《雷神之锤》 工具。 由于多个工作室、引擎和编辑器工具都使用了 FGD，因此 FGD 有几种不同的“风格”。例如，Valve 在 Source Engine 中添加了语法来支持其独特的实体输入/输出脚本系统。 目前尚无正式的 FGD 文件规范标准。 本页涵盖了 FGD 中使用的核心语法 TrenchBroom 适用于《雷神之锤 1》/《半条命》引擎。 语法（基本） FGD 是一种基于文本的格式。我们建议使用 UTF-8 编码以支持更多语言。 TrenchBroom 需要 UTF-8，不带 物料清单 . 每个实体条目都遵循以下模式： // 注释以“//”开头 @EntityType EntitySettings() = EntityClassName :“编辑器内帮助” [ propertyKey(propertyType) : \"编辑器内名称\" : defaultValue : \"编辑器内帮助\" ] 这是一个简单的实体示例，一个僵尸 NPC，宽 32 个地图单位，高 64 个地图单位，具有一个名为“健康”的属性： $? /$ 请注意编辑器内的帮助文本非常重要。告诉关卡设计师一些不明显的重要功能，提供建议或提示/技巧。 实体类型和设置（基本） FGD 实体分为三种核心类型： 点 , 固体 ， 和 基地 . @PointClass 开始点实体定义，例如 NPC 或灯光 尺寸 (minX minY minZ, maxX maxY maxZ) 是点实体的轴对齐边界框 (AABB) 大小，定义为两个 3D 向量：最小范围（最小角）和最大范围（最大角） 型号 (path, skin, frame, scale) 显示实体的 3D 模型。这可能会变得有点复杂，请参阅 实体的显示模型 . @SolidClass 开始画笔实体定义，如 worldspawn 或 func_wall @基类 开始实体基础模板；您可以将实体设置为“继承”公共基础。 基地 (BaseClassName1, BaseClassName2, ... ) 设置一个实体以包含列出的基类...您还可以设置一个基类以包含一个基类，因此此功能可能非常强大/有用，但要注意递归 例如，如果游戏中的所有怪物都有生命值，那么您可以创建一个具有生命值属性的 BaseClass Monster，然后将所有怪物类型设置为包含该怪物基础： $? /$ 实体属性（基本） 实体属性是遵循以下一般模式的类型化键值对： 键名(类型) : \"In-Editor Display Name\" : 默认值 : \"In-Editor Help\" 按键名称： 像变量名一样，通常是小写字符串 有时开头带有下划线，表示它是编译器时属性，不会出现在游戏中 类型： 有四 (4) 种基本属性类型： string , integer , choices （多项选择整数 枚举 ），以及 flags （位掩码）。 旗帜 是一组布尔（真/假）值，通过数学的魔力将它们存储为单个数字（ 位掩码 ) 在大多数关卡编辑器中，一个实体只能有一个 flags 属性，并且必须调用它 “产卵标志” 价值： 无论关卡设计师在关卡编辑器中输入什么内容 演示所有四种属性类型的画笔实体定义示例： $? /$ 实体的显示模型 如果 FGD 文件指定，TrenchBroom 可以显示点实体的 3D 模型。这对于放置 NPC 或道具非常有用，其中预览模型大小/旋转/外观非常有用。 TB 使用资产导入器 (AssImp)，它对大多数 3D 格式（.OBJ、.FBX 等）具有基本支持。 对于某些模型格式（例如 《雷神之锤》 .MDL 或 《半条命》 .MDL），您还可以根据实体属性交换纹理或预览动画帧。使用方法见下文。 记住： 模型（） 仅限 TrenchBroom，不一定适用于其他编辑器。 最基本的硬编码用法如下： $? /$ 基本硬编码模型的示例来自 《雷神之锤》.FGD : $? /$ 然而，对于可交换的“道具”实体或具有多个皮肤或脚本动画的 NPC，在 FGD 中对模型设置进行硬编码可能过于限制。 支持 地图定义的每个实体模型显示设置， TrenchBroom 可以解析 动态 FGD 占位符 使用类似 JSON 的语法（大括号、引号中的命名参数）： $? /$ 将“MODEL”或“FRAME”等替换为您想要的键值属性名称，TrenchBroom 将交换占位符的实际值。 使用占位符的通用“prop”实体示例： $? /$ 带有占位符的示例来自 HalfLife.FGD : $? /$ TrenchBroom 的 FGD 风格也支持 条件表达式 。带有表达式的示例： $? /$ 有关占位符和表达式的更多信息，请参见 Trenchbroom 手册 \u003e“显示实体模型”： TrenchBroom 2026.1 参考手册 Trenchbroom.github.io FGD 资源和链接 烟气脱硫示例 TrenchBroom 默认内置 FGD（通过 GitHub） FGD 创作 阀门开发商联盟： “FGD 剖析（以及如何编写自己的剖析）” 是一个很好的介绍 阀门开发商联盟： “高级 FGD 编辑变得简单” 展示提示和技巧 Valve 开发者社区： “烟气脱硫” 详细介绍 Source Engine 1 特定的 FGD 扩展和怪癖...但对 TrenchBroom 没有用 FGD 解析器 C++ FGD 解析器示例： TrenchBroom（来自 GitHub） C# FGD 解析器库： Sledge.Formats（来自 GitHub）"
                  },
                  {
                      "href":  "appendix__resources__formats__map.html",
                      "title":  "MAP 文件格式",
                      "description":  "文件格式规范 + 《雷神之锤》（ Steam ） .MAP 文件的示例解析器代码（“Valve”样式，mapversion 220）",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/resources/formats/map",
                      "breadcrumbs":  [
                                          "APPENDIX",
                                          "资产与资源",
                                          "文件格式"
                                      ],
                      "searchText":  "MAP 文件格式 文件格式规范 + 《雷神之锤》（ Steam ） .MAP 文件的示例解析器代码（“Valve”样式，mapversion 220） 这是一篇面向程序员的技术文件格式规范文章。 有关映射教程，请参阅 《雷神之锤》资源 相反。 .MAP 文件格式是为 《雷神之锤》1 (1996) 设计的 3D 文件格式。 它逐渐成为任何游戏引擎中基于笔刷的关卡的标准文件类型，部分原因是它的解析和编辑相对简单。这与 .OBJ 成为简单 3D 标准的方式类似，尽管它缺乏许多高级功能。 解析器 很有可能有人已经为您的游戏引擎/编程语言编写了通用的 .MAP 解析器。 C++（ https://github.com/stefanha/map-files ) C# ( https://github.com/Figglewatts/MapParse 或 https://github.com/LogicAndTrick/sledge-formats ) 铁锈（ https://github.com/reslario/nomap 或 https://github.com/QodotPlugin/quarchitect ) 对于特定于游戏引擎的 MAP 导入器和集成，请参阅 TrenchBroom . 文件格式 基于大括号和换行符的文本 Z 轴向上（《雷神之锤》 约定），右手 angle 值为 0-359 的欧拉度 -1表示“向上” -2表示“向下” 一些 《雷神之锤》 mods 将旋转实现为 3D 矢量，称为 m_angle 实体 .MAP 中的每个对象都必须是 实体 ，通用演员/游戏对象容器类型。 有两种类型的实体： 点实体： 怪物、物品、灯光、固定尺寸/无尺寸的东西 刷实体： 嵌入 3D 形状的点实体 世界生成： 全局静态画笔实体，整个游戏世界的“根” 世界画笔：绑定到 worldspawn 的画笔 实体数据和模板由 .烟气脱硫 文件 加载到关卡编辑器中。 $? /$$? /$$? /$ 画笔几何形状 一个 刷子 是由 4 个或更多平面定义的凸 3D 形状。 它不是由顶点和三角形组成的传统 3D 网格格式。 您需要额外的地图编译步骤来将笔刷数据处理为可用的 3D 网格。例如，《雷神之锤》 地图使用名为 QBSP 的编辑器时命令行工具，该工具输出编译后的 .BSP 地图文件；同时，许多其他引擎的 .MAP 解析器在运行时生成此网格。 每条画笔线定义一个 3D 平面（一个三角形）及其纹理坐标： $? /$ 基于平面相交构建 3D 网格有点复杂。大多数库都实现了一些变体 Stefan Hajnoczi 的 2001 C++ 实现 。他的论文详细解释了数学和过程，PDF下载镜像如下： 244KB MAPFiles_2001_StefanHajnoczi.pdf PDF 打开 上传自 https://github.com/stefanha/map-files 2022 年 3 月 23 日 纹理/UV 《雷神之锤》 .MAP 文件格式有两个版本：原始标准版本和 Valve Software 更新的格式。 原始标准格式在存储纹理旋转时存在问题。给定 XYZ 中的 3D 笔刷平面法线，它会丢弃最长的轴并存储生成的 Vector2。但如果平面呈 45 度角，则最长轴现在不明确，地图编译器现在必须任意偏向某个轴； 浮点不精确 使得这种偏好更难以预测，通常会导致令人不愉快的纹理拉伸。 标准纹理坐标： TEXTURE_NAME offsetX offsetY rotation scaleX scaleY 同时，更新的 Valve 格式 .MAP 具有 \"mapversion\" \"220\" 在 worldspawn 中设置的键值。 Valve 格式 220 通过将 UV 存储在 Vector3 空间中解决了 45 度模糊情况，这也使得一些有用的 UV 倾斜操作成为可能 TrenchBroom 以及。 Valve 格式纹理坐标： TEXTURE_NAME [ ux uy uz offsetX ] [ vx vy vz offsetY ] rotation scaleX scaleY 我们通常建议使用 Valve 格式 ，除了向后兼容/将旧文件移植到更新的格式之外，没有理由使用标准格式。 $? /$ .MAP 文件示例 有关更复杂的示例 .MAP 文件，请参阅 《雷神之锤》资源 . $? /$ 来源 https://quakewiki.org/wiki/《雷神之锤》_Map_Format https://www.quakewiki.net/archives/qref/wcs/info.html 《雷神之锤》 MAP 规格》(1996)，来自互联网档案馆"
                  },
                  {
                      "href":  "appendix__resources__formats__mdl.html",
                      "title":  "MDL 文件格式",
                      "description":  "如何解析 《雷神之锤》（ Steam ）1 模型 (.MDL) 和示例 C 源代码以进行 3D 渲染",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/resources/formats/mdl",
                      "breadcrumbs":  [
                                          "APPENDIX",
                                          "资产与资源",
                                          "文件格式"
                                      ],
                      "searchText":  "MDL 文件格式 如何解析 《雷神之锤》（ Steam ）1 模型 (.MDL) 和示例 C 源代码以进行 3D 渲染 这是该页面的档案镜像 “MDL 文件格式（《雷神之锤》 的模型）”作者：David Henry ，发表于 2004 年 12 月 20 日（最后访问日期：2021 年 1 月 13 日）。已获得许可 GNU 自由文档许可证 . 这是一篇面向程序员的技术文件格式规范文章。 有关 3D 艺术家教程和文件，请参阅 《雷神之锤》资源 # 建模 相反。 简介 MDL 文件格式是 《雷神之锤》（1996 年 6 月）中使用的模型格式。 MDL 模型文件的特征如下： 模型的几何数据（三角形）； 8位纹理数据； 逐帧动画； 一个 MDL 文件可以保存多个纹理。 MDL模型文件的扩展名是 .mdl 。 MDL 文件是一个二进制文件，分为两部分：标头和数据。标头包含使用和操作数据所需的所有信息。 尺寸可变 本文档中使用的变量类型具有以下大小： 字符 : 1 字节 短 : 2 字节 整数 : 4 字节 浮动 : 4 字节 优字节 : 1 个无符号字节 它们对应于 x86 架构上的 C 类型大小。如果您正在针对其他体系结构进行编译，请确保类型大小与这些大小相对应。 字节顺序问题 由于 MDL 文件格式是二进制格式，因此您必须处理字节顺序。 MDL 文件以小尾数法 (x86) 存储。如果您的目标是大端架构（PowerPC、SPARC...），或者只是希望您的程序可移植，则必须对从文件中读取的每个字或双字执行正确的转换。 标头 标头是位于文件开头的结构： $? /$ ident 是文件的幻数。它用于识别文件类型。 ident 必须等于 1330660425 或字符串“IDPO”。我们可以通过表达式获得这个数字 ((\u00272\u0027\u003c\u003c24) + (\u0027P\u0027\u003c\u003c16) + (\u0027D\u0027\u003c\u003c8) + \u0027I\u0027) . version 是文件格式的版本号，必须等于 6。 scale 和 translate 需要获取模型的真实顶点坐标。 scale 是一个比例因子并且 translate 平移向量（或模型的原点）。您必须首先将各自的值相乘 scale 与顶点坐标，然后添加各自的值 translate 结果： $? /$ 哪里 i 范围从 0 ou 2（x、y 和 z 坐标）。 boundingradius 是整个模型可以容纳的球体的半径（例如用于碰撞检测）。 eyeposition 是...眼睛的位置（如果模型是怪物或其他 NPC）。把它变成你想要的样子。 num_skins 是文件中存在的纹理数量。 skinwidth 和 skinheight 分别是纹理的宽度和高度。所有纹理必须具有相同的大小。 num_verts 是一帧的顶点数。 num_tris 是模型的三角形数量。 num_frames 是模型的帧数。 数据类型 矢量 该向量由三个浮动坐标 (x, y, z) 组成： $? /$ 纹理信息 纹理数据紧接在文件中的标头之后。它可以是由单张图片或一组图片组成的纹理（动画纹理）。 $? /$ 或： $? /$ time 是一个数组 nb 元素和 data 一个数组 nb 的数组 skinwidth * skinheight 元素（图片大小）。 数据图片包含在 data 数组并处于 8 位颜色索引模式。颜色图通常位于单独的 LMP 文件 (*.lmp) 中。 LMP 文件是二进制文件，仅包含 768 字节（24 位 256 种颜色）。它们易于使用：只需读取缓冲区中的整个文件即可完成。 （见 色彩图 ) 有 num_skins 的对象 mdl_skin_t 键入或 mdl_groupskin_t 类型。 纹理坐标 纹理坐标存储在结构中： 短 整数。 $? /$ 纹理通常分为两块：一块用于模型的正面，另一块用于模型的背面。背面部分必须翻译为 skinwidth/2 从正面部分。 onseam 指示顶点是否位于两块的边界上。 要获得实数 (s, t) 坐标（范围从 0.0 到 1.0），必须将坐标加上 0.5，然后将结果除以 skinwidth 为了 s 和 skinheight 为了 t . 有 num_verts (s, t) MDL 模型中的纹理坐标。纹理坐标数据位于纹理数据之后。 三角形 每个三角形都有一个顶点索引数组和一个标志来指示它是正面三角形还是背面三角形。 $? /$ 如果属于背面三角形的顶点位于两块的边界上（ onseam 是真的），你必须添加 skinwidth/2 到 s 为了纠正纹理坐标。 有 num_tris MDL 模型中的三角形。三角形数据遵循纹理坐标。文件中的数据。 顶点 顶点由“压缩”3D 坐标和法线向量索引组成，每个坐标存储在一个字节中。法线向量数组存储在 anorms.h 《雷神之锤》 文件并以浮点形式保存 162 个向量（3 浮动 ）。 （见 anorms.h ) $? /$ 镜框 每个帧都有其顶点列表和一些其他特定信息。 $? /$ bboxmin 和 bboxmax 定义一个可以容纳模型的盒子。 name 是框架的名称。 verts 是框架的顶点列表。 框架可以是简单框架或框架组。我们可以知道它是一个简单的框架还是一个带有标志的组： $? /$ 或： $? /$ time 和 frames 是数组 nb 维度。 min 和 max 对应于帧组的所有简单帧中的最小和最大位置。 time 是每个简单帧的持续时间。 特别注意 nb ，历史 MDL 文件规范文档中经常缺少该内容。根据 Sean May 的说法，省略它 “将白盒正确解析具有没有 AI 控制的循环动画的 .mdl 文件（火把/火焰/一些带刺的射弹）。” 读取 MDL 文件 假设 mdl_model_t 是一个保存所有模型数据的结构， *mdl 一个指向 a 的指针 mdl_model_t 对象，此代码显示如何加载 MDL 模型文件： $? /$ 注意：此代码无法处理带有组框架的 MDL 文件。 渲染模型 这是如何绘制框架的示例 n 一个模型的 mdl : $? /$ 动画 MDL 模型是逐帧动画的。帧是动画的屏幕截图。为了避免抖动和丑陋的动画，我们在两个连续帧（我们正在绘制的当前帧和下一帧）的顶点坐标之间使用线性插值。我们对法向量做同样的事情： $? /$ v 是要绘制的最终顶点。 interp 是两帧之间的插值百分比。这是一个 浮动 范围从 0.0 到 1.0。当它等于1.0时， current 增加 1 并且 interp 重新初始化为 0.0。插值纹理坐标是没有用的，因为它们对于所有模型帧都是相同的。优选的是 interp 与程序每秒渲染帧数（fps）有关。 $? /$ 常数 以下是定义最大尺寸的一些常量值： 三角形最大数量：2048 最大顶点数：1024 纹理坐标最大数量：1024 最大帧数：256 预先计算的法向量数量：162 示例 C 代码 mdl.c 用于加载 MDL 文件的完整示例 C 代码。 $? /$ 异常.h 定义所有可能的顶点法线的 C 头文件。 （见 顶点 ) $? /$ 色彩图 这 《雷神之锤》 中的默认调色板 ，在公共领域。 256 个 RGB 颜色值，每种颜色 3 个字节 = 总共 768 个字节。 颜色 128-223 传统上仅用于玩家模型衬衫/裤子定制 颜色255 {159, 91, 83} 保留用于 alpha 透明度。 $? /$"
                  },
                  {
                      "href":  "appendix__resources__quake.html",
                      "title":  "《雷神之锤》资源",
                      "description":  "用于 《雷神之锤》（ Steam ） 映射和模组的模型、纹理、声音、教程和其他链接",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/resources/quake",
                      "breadcrumbs":  [
                                          "APPENDIX",
                                          "资产与资源"
                                      ],
                      "searchText":  "《雷神之锤》资源 用于 《雷神之锤》（ Steam ） 映射和模组的模型、纹理、声音、教程和其他链接 获取《雷神之锤》关卡设计入门套件 下载 《雷神之锤》关卡设计入门套件 （仅限 Windows 和 Linux） 由 Jonathan Linat 编写，其中包含许多用于单人游戏《雷神之锤 1》地图绘制的推荐工具和资产，全部收集在一个方便的捆绑包中。这是最简单的入门方法。 社区 如果您对 《雷神之锤》 地图和模组感兴趣， 我们强烈建议加入 《雷神之锤》 社区。 这是最好的学习方式！经验丰富的人可以为您的工作提供技术帮助、建议和反馈。有些人甚至已经修改 《雷神之锤》 20 多年了。 Quake Mapping Discord 是最大的公共社交中心，适合初学者，有频繁的单人游戏设计活动和社交机会 对于《雷神之锤 2》，请尝试 Map-Center Discord 相反。 对于多人《雷神之锤》，请尝试 QuakeWorld.nu 和 Quake.World Discord 相反。 Slipseer 是一个新的单人地图制作者中心，提供下载、资源和免费文件托管服务。 Quaddicted 是主要的单人游戏《雷神之锤》地图存档，目前正在进行大规模重建（截至 2024 年）。 功能消息板 是运行时间最长的《雷神之锤》关卡设计网络论坛，但可能不像 QM Discord 或 Slipseer 那样对新手友好 雷神之锤 是一个长期运行的播客系列，其中 David“dumptruck_ds”Spell 采访了各种 《雷神之锤》 社区成员并讨论了新版本 YouTube 嵌入 《雷神之锤 2022 社区预览》 由 dumptruck_ds 编辑 测绘 如何制作《雷神之锤》地图 得到 TrenchBroom 关卡编辑器（包含在上面链接的关卡设计入门套件中） 有关结核病的更多信息和建议 官方下载页面 大多数人开始于 David“dumptruck_ds”Spell 的视频教程 （完整播放列表） 或开始于 Andrew Yoder 的文字教程 （涵盖基本设置+制作您的第一个房间） 了解基础知识后，请查看 《雷神之锤》 Builder 视频教程 通过 Markie 音乐 有关有用的地图测量和战斗统计数据+设计建议，请参阅 《雷神之锤》 尺度 有关发布地图和模组的更多信息，请参阅 如何打包 《雷神之锤》 地图/Mod . YouTube 视频嵌入 “《雷神之锤》地图制作：TrenchBroom 2 快速入门” 通过自卸车_ds 推荐阅读 在您了解地图构建的基础知识并在编辑器中感到有些舒适后，请了解更复杂的设计和构建模式： 《如何让房间看起来漂亮》 (2001) Xenon 的 《雷神之锤》 架构 《曲线教程》 (200x) 构建“CZG 曲线”，作者：Christian Grawert “《雷神之锤》 绘图：高级曲线”第 1 部分视频 + 第 2 部分 作者：大卫·斯佩尔 《TrenchBroom 与《雷神之锤》：弯曲隧道》 通过 Markie 音乐 《战斗设计之门问题》 Andrew Yoder 的 (2019) 是对调整 《雷神之锤》 的可靠介绍 遭遇战 “平衡《雷神之锤》的难度等级” Lunaran 的 (2024) 是各种项目放置/遍历设计模式的良好入门读物 克里斯·霍尔登的 #quake #leveldesign 推文 《雷神复兴》 (2021) 罗伯特·杨 (Robert Yang) 的《雷神之锤》文化系列 第 1 部分 （id软件行业历史） 第 2 部分 （《雷神之锤》 mod 25 年历史入门》） 第 3 部分 （《雷神之锤》玩家文化规范指南+知名模组玩法） Bal 的《雷神之锤》地图制作提示和技巧 Benoit \"Bal\" Stordeur 的 (2022) 是中级/高级 Trenchbroom 施工技术的重要必读之作。 有关 《雷神之锤》 对关卡设计影响的更多信息，请参阅 关卡设计师简史 地图控制理论图来自 《战斗设计之门问题》 （2019）安德鲁·约德 《雷神之锤》1 不同光线衰减设置的图表；您会在何时何地使用每种灯光设置？ 编译 《雷神之锤》 地图 要玩 《雷神之锤》 地图，您必须 编译 （烘焙、打包）可编辑的 .MAP 为可播放的优化 .BSP 文件。您将需要工具和图形用户界面 (GUI)。 编译工具： 埃里克工具 （已包含在 《雷神之锤》 Level Design 入门套件中） qbsp.exe 构建 3D 网格 + 检测“泄漏”（ 视频教程：如何修复泄漏 ) vis.exe 计算 PVS 遮挡剔除 优化地图性能 light.exe 烘焙光照贴图和阴影，使 灯光 发生 强烈推荐观看 light.exe 示例 + 光.exe 文档 编译器图形用户界面： 选择其中之一 TrenchBroom的内置编译窗口 或 Necro 的编译 GUI （两者都已包含在套件中） EricW 的 《雷神之锤》 反弹照明设置示例 光.exe文档 ;地图是 mfx 制作的 ad_azad 示例地图源文件 许多mods包.MAP源文件都带有公开版本，只需在mod文件夹中查找即可 Trenchbroom_quake_map_source.zip （4.5 MB 下载） 是原始 《雷神之锤》1 .MAP 源文件的集合（ 约翰·罗梅罗 (John Romero) 于 2006 年发布 ）但转换为现代文件格式（TrenchBroom 兼容）+固定纹理参考（使用重新打包的 《雷神之锤》101.wad），感谢 Atul“toolness”Varma 4MB Trenchbroom_quake_map_source.zip 存档 打开 下载 Atul \u0027toolness\u0027 Varma 的“Trenchbroom 《雷神之锤》 Map Source”镜像，最后访问时间为 2022 年 1 月 13 日 有关在代码中解析和使用 .MAP 文件的更多信息，请参阅 .MAP 文件格式 地图 E1M1 中入口走廊的 GIF 动画“The Slipgate Complex”，约翰·罗梅罗 (John Romero)，为《雷神之锤 1》(1996) 引擎/源端口 要玩《雷神之锤》（并测试您自己的地图或模组），您需要 源端口 -- 《雷神之锤》 引擎“移植”了 1996 年原始引擎代码并添加了许多新功能/兼容性。 我们仅列出正在积极持续开发的免费开源端口。 （ 通过 《雷神之锤》Wiki.org 查看源端口的完整列表 ) 源端口 描述 铁墙 当前单人游戏社区标准引擎； 捆绑在 《雷神之锤》 Level Design 入门套件中 Quakespasm 以前的单人社区标准引擎 全职工作时间 许多功能 + 超越 《雷神之锤》1 文件格式的广泛兼容性，适合制作独立游戏 雷神之锤 常见的多人游戏《雷神之锤》（“《雷神之锤》World”）捆绑包，但缺乏许多单人游戏/图形功能 桑迪·彼得森 (Sandy Petersen) 为《雷神之锤 1》(1996) 创作的 e4m2“绝望之塔”中的关卡入口动画 GIF 资源/纹理 在《雷神之锤》模组文化中，从其他地图和模组中提取模型、声音和纹理通常被认为是正常且可以接受的，只要您 归功于原作者 . 但是，如果您从 .BSP 中提取纹理和资源，则通常会得到完整套件的不完整部分。它可能会很难使用。在这些情况下（例如 Makkon 集） 您最好找到完整的官方公共纹理版本。 纹理 WAD 《雷神之锤》 纹理集合存储在 .WAD 文件中。要在关卡中使用纹理，请下载 .WAD，然后使用关卡编辑器将 WAD 路径添加到 .MAP 文件。 （注意：这与 《毁灭战士》（ Steam ） WAD 不同。《雷神之锤》 WAD 仅适用于地图纹理。） 将地图编译为可播放的 .BSP 文件时，所有使用的纹理都会自动直接嵌入到 .WAD 文件中。您可以使用类似的工具从编译的地图中提取纹理 BSP2WAD . 原型WAD Khreathor 的作品对于草稿和原型设计非常有用。 雷神之锤101 WAD 包含所有 《雷神之锤》 纹理在一个集合中，或者您也可以直接下载 每个贴图使用的纹理 如果你想严格遵守传统主题。 无赖 是凯尔设置的中世纪图书馆主题纹理 马克孔 是当今社区 《雷神之锤》 地图中使用的最流行的纹理集 纹理 WAD 档案 Quaddicted WAD 存档 包含许多 .WAD，但有些无组织。 惊天动地 有一堆类似的无组织的 WAD 文件 Slipseer 有一个较小但不断增长的组织更好的 WAD 文件存档 示例纹理来自 “Koohoo”纹理 WAD 由冯德尔；示例地图是 Chris Holden 绘制的 Ambulatory WAD工具 最常见的 WAD 创建/编辑工具是 德克萨斯墨西哥 和 沃利 ，它可以为您轻松浏览WAD并转换纹理。 如果您要经常修改 WAD，您可以通过命令行界面 (CLI) 进行批处理来自动化 WAD 构建过程： 帕克曼 . 使用 TexMex 或 BSP2WAD 从编译的 .BSP 贴图文件中提取纹理 将纹理码垛以适应 《雷神之锤》 的固定 256 调色板是很棘手的，因为某些颜色被保留为“全亮”颜色。您可能还需要 EricW 的 “去富亮” 工具来删除这些全亮像素。 Wally WAD 工具的图像，Valve 开发者联盟的屏幕截图 天空盒 雷神之锤有两种不同的天空系统。 1996 年最初的天空系统是一个两块面板纹理，其自身存在视差。较新的 《雷神之锤》 引擎支持更标准的立方体贴图样式天空盒，该天空盒由 6 个静态 .TGA 纹理组成，每个纹理对应于天空盒的一侧。 https://www.quaddicted.com/webarchive/kell.quaddicted.com/skyboxes.html https://lvlworld.com/review/《雷神之锤》%203%20Arena%20skybox%20collection http://www.simonoc.com/pages/artwork.htm https://www.slipseer.com/index.php?resources/makkon-skyboxes.139/ 《雷神之锤》 mod Alkaline 中科幻中心地图的屏幕截图，纹理由 Makkon 提供 模组/开发套件 Mod 添加了新的功能和特性，供地图绘制者在其关卡中使用。下面列出了单人游戏《雷神之锤》地图制作者使用的常见《雷神之锤》模组和工具包。 当您发布地图或模组时， 将核心模组文件与您的地图捆绑在一起 制作一个独立的 .ZIP，没有外部依赖项。例如：如果您使用 Copper 制作 mod，则应将 Copper mod 文件包含在 ZIP 中。大型模组包括精简版 “开发套件” 你可以使用，它只有核心模组文件。 奥术维度 奥术维度 是最近流行的模组/工具包，添加了许多新的怪物和功能。 安装最新版本的 Arcane Dimensions ( v1.81 截至 2022 年 1 月） 如果你想基于 AD 制作自己的 mod，请使用精简版开发套件 添加 /ad/ mod 文件夹和 ad_1_8.fgd 在你的地图编辑器中 阅读包含的内容 ad_v1_80_documentation.txt 获取信息和建议 打开 示例测试图 在编辑器中学习如何使用新系统 的 Arcane Dimensions 《雷神之锤》C 源代码可在 GitHub 上获取 148KB ad_v1_80_documentation.txt 打开 下载 Arcane Dimensions v1.81 文档 TXT 文件的镜像，上次访问时间为 2022 年 1 月 14 日 碱性 碱性 是最近的“基地”主题模组/工具包，添加了科幻主题的怪物和武器。 安装 最新版本的碱性 （可用的最小开发套件） 添加 /alkaline/ mod 文件夹和 alkal"
                  },
                  {
                      "href":  "appendix__resources__quake__how-to-package.html",
                      "title":  "如何打包 《雷神之锤》 地图/Mod",
                      "description":  "打包和发布可播放的 《雷神之锤》（ Steam ） 文件的一般规则和指南",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/resources/quake/how-to-package",
                      "breadcrumbs":  [
                                          "APPENDIX",
                                          "资产与资源",
                                          "《雷神之锤》资源"
                                      ],
                      "searchText":  "如何打包 《雷神之锤》 地图/Mod 打包和发布可播放的 《雷神之锤》（ Steam ） 文件的一般规则和指南 本页介绍如何打包 《雷神之锤》 地图/模组版本。 这些规则和指南基于大多数 《雷神之锤》 引擎的工作方式以及过去几十年发展的一般社区礼仪和共识。 《雷神之锤》诞生于1996年，其核心技术已有26年历史。就像任何 26 岁的人一样，现在改变他们身上任何不好或烦人的事情都为时已晚。我们必须弄清楚如何忍受它。 文件夹和文件名 任何文件夹或文件名中都没有空格。 全部小写字母。 （有些 《雷神之锤》 引擎 + 操作系统区分大小写，有些则不区分大小写。） 避免在开头使用数字或标点符号。 使用常见的 .ZIP 压缩格式，不要使用不常见的深奥格式，例如需要特殊工具的 .7Z 或 .RAR。 封装类型 地图包（简单）： 将所有内容放在 ZIP 的根目录中，没有子文件夹。 适合简单的单一地图发布/您的第一张地图。 模组包（复杂）： 将所有内容放入 mod 文件夹中，然后压缩整个 mod 文件夹。 这样您就可以包含自定义资产和游戏代码。 对于小版本来说，这样做也很常见，即使它们不是完整的模组。 地图包（简单） 如果您仅分发与地图相关的文件（.BSP / .LIT / .MAP / .TXT），那么可以使用最简单的打包方法： 要打包单个地图，请将所有文件放在 根 ZIP 文件的，ZIP 内没有文件夹或子文件夹。 $? /$ 这是一种常见的结构，玩家知道他们必须自己将其解压到正确的地图文件夹中。我们假设这是 /Quake/id1/maps/ 除非另有说明。 模组包（复杂） 如果您使用自定义代码或资产，请将您的 《雷神之锤》 版本打包为 mod： 要打包 mod，请将所有文件放在 ZIP 文件内的一个大“mod 文件夹”中。 但是，mod 文件夹必须 遵循特定的文件夹名称和结构... $? /$ Mod 文件夹名称必须全部为小写字母数字且不含空格。 地图文件（.BSP、.LIT） 必须位于 mod 子文件夹中 /地图/ 不要使用任何子文件夹。地图必须位于根目录 /maps/ 否则引擎无法找到它们。 天空盒 (.TGA) 必须位于 mod 子文件夹中 /gfx/env/ 再次强调，不要使用任何其他子文件夹。 声音 (.WAV) 必须进入 mod 子文件夹 /声音/ 此处鼓励添加其他子文件夹。使用唯一的声音子文件夹名称以避免文件冲突，例如 /sound/mymodname/ 型号 (.MDL) 必须进入子文件夹 /程序/ 鼓励添加其他子文件夹，例如声音。 游戏代码（progs.DAT） 必须在 mod文件夹的根目录 . 有些模组将所有内容都封装在一个 .PAK 文件以简化分发并避免此文件夹 soup. .PAK 文件就像 .ZIP 文件，《雷神之锤》 引擎加载其中的文件，并且文件夹完好无损。有关 PAK 的更多信息，请参阅 《雷神之锤》Wiki.org：PAK . 部分模组包 要打包部分 mod，请在根目录中包含多个 mod 子文件夹，但不要包含主 mod 文件夹。 包括有关解压缩位置的明确说明。 $? /$ 当您只有少量自定义资产时非常有用。 主要用于作为现有大型模组（如奥术维度）的附加组件的地图。 在您的版本中包含整个父模组是不切实际的。用户可能已经安装了自己的现有模组。 然而，覆盖父模组的现有文件被认为是非常糟糕的礼仪，例如不包含 progs.dat 文件。 视频教程 有关文件结构和打包的视频介绍，请参阅 David Spell 的视频教程 “《雷神之锤》地图制作：发布你的地图” 从 4:08 开始： 测试一下自己：《雷神之锤》 包装示例 测试一下你自己。这是一个好例子还是坏例子？ 单击箭头以显示答案。 MyMod.zip 不好。文件名使用大写字母。 mymod.zip/MyMap.bsp 不好。文件名使用大写字母。 mymod.zip/mymap.bsp 好的。文件名全部小写，没有空格，BSP 文件位于 ZIP 的根目录下，没有子文件夹。如果作者只是发布地图文件而没有其他mod文件，那么这是可以接受的。 mymod.zip/mymodfolder/mymap.bsp 不好。它是一个 mod 文件夹，但 BSP 不在名为 /maps/ 的子​​文件夹中。 mymod.zip/mymodfolder/maps/mymap.bsp 好。所有文件和文件夹名称均为小写且不带空格，并且 BSP 位于 mod 文件夹 /mymodfolder/ 的子文件夹 /maps/ 中。 mymod.zip/mymodfolder/maps/mymod/mymap.bsp 不好。 BSP 位于名为“mymod”的地图子文件夹中，因此 《雷神之锤》 引擎将无法检测到地图文件。 mymod.zip/mymodfolder/env/skybox_up.tga 不好。 TGA 文件位于 /env/ 中，但不在 /gfx/env/ 中。 mymod.zip/gfx/env/skybox_up.tga 好吧，也许吧。这是一种部分 mod 方法，只要用户知道将文件解压缩到哪个 mod 文件夹，它就可以工作。 mymod.zip/mymodfolder/gfx/env/skybox_up.tga 好。天空盒 TGA 位于正确的位置。 mymod.zip/mymodfolder/sounds/mymod/mysound.wav 不好。 “sounds”是不正确的文件夹名称。它必须是“声音”。是的，我知道。 mymod.zip/mymodfolder/gfx/env/skybox_up.tga + mymod.zip/mymap.bsp 不好。这是将一个文件打包到一个mod文件夹中，并将地图文件打包到根目录下。不要混合两种不同的方法。 现在怎么办？ 我们有很多链接到更多内容 《雷神之锤》资源 . 了解更多一般信息 发布 做法。"
                  },
                  {
                      "href":  "appendix__resources__talks.html",
                      "title":  "推荐演讲",
                      "description":  "关卡设计讲座和演示的列表/存档，以及视频和幻灯片的链接",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/resources/talks",
                      "breadcrumbs":  [
                                          "APPENDIX",
                                          "资产与资源"
                                      ],
                      "searchText":  "推荐演讲 关卡设计讲座和演示的列表/存档，以及视频和幻灯片的链接 下面，我们推荐的关卡设计讲座是：(1) 来自经验丰富的设计师，(2) 针对其他关卡设计师，(3) 免费访问。 如果它不在这里，并不意味着它是坏的。例如，GDC 付费专区讨论了 2 年，所以最近的许多讨论都不在这里。 演讲按主题分组，最近的内容位于顶部。 ⭐ = 特别有影响力/著名 通用关卡设计讲座 战斗/遭遇战设计讲座 非线性/沙盒/开放世界设计讲座 通用关卡设计讲座 另请参阅： 如何制作关卡 演讲名称 年份 演讲描述 幻灯片 PDF 设计博物馆闪回：《最后生还者第二部分》 ( YouTube , GDC 保险库 ) 2022 作者：埃文·希尔； 叙事 和 节奏 了解行走模拟关卡，以及顽皮狗关卡制作流程的概述。 LastOfUsMuseum_EvanHill.pdf 只有我和我的宣传：展示布局的混乱艺术 ( GDC 保险库 ) 2022 西蒙·阿尔伯特·布德罗；迭代的抽象生产过程理论 布局 ，如何召开设计会议。 JustMeAndMyPitch_Boudreault.pdf ⭐ 《辐射 4》的模块化关卡设计 ( YouTube , GDC 保险库 ) 2016 作者：乔尔·伯吉斯和内森·珀基皮尔；权威的入门读本 模块化套件设计 ，对于环境美术家来说至关重要。 《辐射》4Modular_BurgessPurkeypile.pdf 寻路和讲故事 ( GDC 保险库 ) 2015 作者：布伦登·钟； 寻路 和 叙事 ，但也许更多的是关于 动线 。不推荐大量视频、幻灯片。 寻路讲故事_BrendonChung.pdf ⭐ 我从迪士尼乐园学到的关于关卡设计的一切 ( GDC 保险库 ) 2009 作者：斯科特·罗杰斯；原创主题公园关卡设计讲座。尽管它有影响力，但我们不同意其中的大部分内容， 参见： 迪士尼乐园 . 战斗/遭遇战设计讲座 另请参阅： 战斗 演讲名称 年份 演讲描述 幻灯片 PDF 制造冲突：AAA 动作游戏的战斗设计 ( GDC 保险库 ) 2016 作者：迈克尔·巴克莱、皮特·埃利斯、山姆·豪尔斯；三讲作战 节奏 , 遭遇战设计 ，以及开放世界的战斗。 创建冲突战斗_BarclayHowelsEllis.pdf 竞技 CS:GO 的社区级设计 ( YouTube (2014) , GDC 保险库 , 档案网 ) 2015 作者：Shawn \"FMPONE\" Snelling 和 Sal \"Volcano\" Garozzo；反恐精英（ Steam ） PvP 地图中的视线和可读性。 竞技CSGO_GarozzoSnelling.pdf ⭐ 详细设计：将《光环 3》中狙击步枪的射击间隔时间从 0.5 秒更改为 0.7 秒 ( YouTube , GDC 保险库 ) 2010 作者：海梅·格里塞默；有影响力的 平衡 和调整工作流程的讨论，不是直接关于关卡设计，但仍然与任何战斗游戏相关。另请参阅： 放松一下 . DesignInDetailSniper《光环》_Griesemer.pdf 非线性/沙盒/开放世界设计讲座 演讲名称 年份 演讲描述 幻灯片 PDF 设计完全非线性的单人游戏关卡 ( YouTube , GDC 保险库 ) 2019 作者：奥布里·塞尔；系统非线性沙箱的可供性理论 布局 通过沉浸式模拟示例。 激进非线性_AubreySerr.pdf 作为社交空间的“杀手”关卡：关卡设计的社会人类学 ( YouTube , GDC 保险库 ) 2019 作者：梅特·波登凡特·安徒生； 布局 将《杀手 2》（2018）中的非线性沙盒地图作为社会学空间。 《杀手》Social_MettePodenphantAndersen.pdf “Mooncrash”：重置沉浸式模拟 ( YouTube , GDC 保险库 ) 2019 作者：里奇·威尔逊； 节奏 Prey (2017) DLC 的进展将沉浸式模拟游戏改编成半过程生成 Roguelike 游戏。 Mooncrash_RichWilson.pdf 《杀手》（ Steam ）的关卡设计：在非线性沙盒中引导玩家 ( YouTube , GDC 保险库 ) 2016 作者：梅特·波登凡特·安德森和雅各布·米克尔森；教程和 寻路 《杀手 1》(2016) 巴黎城堡关卡。 《杀手》Guiding_AndersenMikkelsen.pdf 另请参阅 Archive.org 上的 GDC Extras 存档 YouTube 播放列表：纽约大学实践讲座"
                  },
                  {
                      "href":  "appendix__tools.html",
                      "title":  "工具",
                      "description":  "各种关卡编辑器、可模组游戏、引擎和艺术工具的链接",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/tools",
                      "breadcrumbs":  [
                                          "APPENDIX"
                                      ],
                      "searchText":  "工具 各种关卡编辑器、可模组游戏、引擎和艺术工具的链接 我们列出了现代和古代的关卡设计工具： 现代 3D 游戏引擎 : 当今常见通用引擎的推荐工具 可模组游戏（推荐） : 用于“严肃”关卡设计的可模组游戏简短列表 可模组游戏（全部） : 带有模组工具的已知游戏的完整列表 还有： 2D 关卡编辑器 , 3D艺术工具 , 2D 艺术工具 ， 和 规划工具 游戏行业常见 现代 3D 游戏引擎 当今的游戏引擎很少默认包含关卡设计工具，因此期望获得 自定义插件， 或一个 外部工具 喜欢 TrenchBroom 。许多开发者也使用 3D艺术工具 使 模块化套件 . 有关 3D 构建技术和权衡的更多信息，请参阅 白盒 . 引擎 3D 构建工具/插件 脚本编写 社区 戈多 函数戈多 , 独眼巨人 , 南玻集团 GD脚本 , C# 戈多社区 虚幻 镰刀 , 立方网格 , 建模模式 蓝图 Unreal Slackers Discord Unity ProBuilder , 颤抖 , RealtimeCSG C#, 视觉 , PlayMaker Unity 官方 Discord Godot v3.0 的屏幕截图，迅速崛起为 Unity 和 Unreal 的流行免费开源社区替代品 可模组游戏（推荐） 当您修改游戏时，您可以重复使用图形、声音、代码，最重要的是核心游戏设计和调整。 我们强烈建议通过模组学习关卡设计。 我们一般推荐《雷神之锤》（ Steam ）和《毁灭战士》（ Steam ） 因为这些游戏拥有庞大的活跃社区、免费稳定的多平台工具和经过验证的设计。 游戏 编辑 战斗 脚本编写 社区 雷神之锤1 TrenchBroom ( 指南 , 视频 ); 看到 《雷神之锤》资源 静态、动态（部落） 视觉（ 实体 ) + 代码 ( QuakeC ) Quake Mapping Discord , Slipseer , Quaddicted 《毁灭战士》 GZDoom Builder , SLADE 3 ( 指南 ) 静态的 代码（ ACS ) 末日世界 半条命2 锤子++ ( SDK 2013 SP 或 地图库 ) 静态/ 脚本化的 视觉（ 输入/输出 ) RTSL , 地图实验室 , TWHL 反恐精英（ Steam ）2 锤子2（ 维基百科 , 视频 ) 多人游戏 代码（VScript2？），视觉（Pulse？） 地图核心 , 蒸汽 传送门2 拼图制作者 （游戏中） -- 视觉的 蒸汽 军团要塞2 锤子++ ( 指南 ) 多人游戏 视觉（ 输入/输出 ) tf2地图 战斗 设置 静态： 预先放置的敌人，街机风格，“发射后不管” 脚本化 ：预先放置的敌人可以对人工智能行为进行一定的控制 动态 ：高级“指挥”自动管理敌人 多人游戏 ：战斗中心围绕其他玩家 TrenchBroom 的屏幕截图，它是一个基于笔刷的独立 3D 关卡编辑器，适用于基于 《雷神之锤》 的游戏引擎 可模组游戏（全部） 由于一个或多个原因，这些可模组游戏不属于我们的推荐列表： 玩家或模组社区已经消亡 或太旧、无支撑、破损或疼痛 或者被行业视为“非法”（即使行业是错误的） 但你的热情最重要。 最好的工具是您实际用来完成项目的任何工具。 游戏 编辑 战斗 脚本编写 社区 使命召唤：现代战争 (2007) CoD 辐射 静态的 视觉的 ??? 使命召唤：黑色行动 3 Radiant (BO3 模组工具 ) 动态（僵尸） 代码（ GSC ) ??? 孤岛危机2 沙盒2 模组 SDK v1.0 静态的 ??? ??? 黑暗模组 暗光 ( 维基百科 ) 静态（隐形） 代码（ 末日脚本 ) 时分复用论坛 神界：原罪2 神性引擎2（ 指南 ) 脚本化（角色扮演） 代码（ 奥西里斯 , 指南 ) 拉里安论坛 毁灭战士3 暗光 ( 维基百科 ) 静态的 代码（ 末日脚本 ) idtech4 Discord 毁灭战士 (2016) SnapMap 静态/动态 （指挥） 视觉（ 逻辑 实体） 游戏中（ 快照集线器 ) 毁灭战士永恒 id工作室 ( 指南 ) 静态/动态（ 遭遇战经理 ) 视觉（ 逻辑设计师 ) 官方 Discord 辐射4 创作套件 静态的 代码（纸莎草纸） Nexus模组 孤岛惊魂5 游戏内 静态的 视觉的 游戏内 恐惧 世界编辑 ( 恐惧 SDK 1.08 ) ( 指南 ) 脚本化的 ??? Discord 堡垒之夜（ Epic ） 创意模式 多人游戏 视觉（ 设备 ) 游戏中， 红迪网 战争机器 虚幻教育3 脚本化的 视觉的 ??? 半条命1 气门锤编辑器 ( 指南 ) 静态的 视觉（ 实体 ) TWHL 光环：无限 游戏中的“锻造”（ 指南 ) 多人游戏 视觉（节点） 游戏内 生死存亡2 锤子 （L4D2 工具） 动态 / 多人游戏 视觉（ 输入/输出 ) + 代码 ( 脚本 ) 蒸汽 地铁：离去 出埃及记 SDK 静态的 视觉（ VS ) io模组 我的世界（ 官网 ） 创意模式（ 指南 ) / 锻造 静态/动态 代码（Java Eclipse+Forge） 我的世界星球 , 诅咒锻造 普罗迪乌斯 游戏中（ 指南 ) 静态的 ??? 官方 Discord Quadrilateral Cowboy DarkRadiant（ 指南 ） 无 代码（《毁灭战士》Script） 蒸汽论坛 雷神之锤2 TrenchBroom ( 视频 ) 静态的 视觉（实体） 地图中心 雷神之锤 3 竞技场 NetRadiant-c , Gtk辐射 多人游戏 视觉（实体） LvL世界 雷神之锤4 Q4辐射 静态的 代码（ .script ) ??? 罗布乐克斯 工作室 ( 指南 ) 全部 代码（Lua） 官方 Discord , Roblox 助手 暗影狂奔 暗影狂奔编辑器（ 指南 ) 脚本化（角色扮演） 代码（ 浓汤 ) 蒸汽 天际 创作套件 静态的 代码（纸莎草纸） Nexus模组 潜行者：普里皮亚季的呼唤 X射线引擎SDK 动态 ??? ??? 小偷 1 / 小偷金币 / 小偷 2 德罗姆埃德 ( 指南 , 维基百科 ) 静态（隐形） 视觉（ 刺激 ) + 代码 ( OSM ) TTLG 小偷3 T3ed ( 指南 ) 静态（隐形） 视觉（演员、Triggerscript） TTLG 虚幻竞技场 (1999)（“UT99”） 虚幻 2.1 / 227小时 ( 指南 ) 多人游戏 视觉（演员）+代码（ U脚本 ) 旧虚幻 , ut99.org 虚幻竞技场4 （死了） 虚幻引擎 4（ 指南 ) 多人游戏 视觉（ 蓝图 ) Discord 2D 关卡编辑器 如果您的引擎已经有内置的 2D 关卡编辑器，则可能会使用它。但如果您使用自制引擎或基于 Web 的框架，则可能需要一个独立的 2D 关卡编辑器 平铺的 或 LDtk . 2D 关卡编辑器 注释 内置戈多 瓦片地图 ;支持自动瓷砖 内置统一 精灵形状 , 瓷砖地图 , 瓷砖地图附加功能 内置虚幻引擎 Paper2D 瓷砖地图 ？老实说，大多数人不会使用虚幻来制作 2D LDtk 更现代的独立编辑器，精简，许多功能与不断增强的引擎兼容性 平铺的 最古老的独立编辑器，常见的有很多功能，但现在可能没有那么强劲了 奥格莫 没有积极开发，但仍然简单而可靠 Tiled 的屏幕截图，一个免费的开源独立的基于图块的 2D 关卡编辑器 3D艺术工具 我们不建议使用 3D 建模工具来构建关卡。 但很多人还是这么做了。 我们一般推荐 搅拌机， 可以与商业工具相媲美的免费开源软件。年长的开发人员通常更喜欢 Maya 或 Max，因为他们已经知道了。但 Blender 基本上是未来。 工具 注释 搅拌机 免费、开源、流行；如果有疑问，就用这个吧！也尝试： 关卡好友 , 梦幻UV 玛雅人 常见于游戏和电影中，但价格昂贵 学生免费 3DS Max 常见于游戏和建筑中，昂贵但 学生免费 4D影院 游戏中不常用但完全可用， 学生免费 草图大师 被建筑师使用，但没有 拓扑 / 紫外线 工具，不建议使用此以外 白盒 阶段 2D 艺术工具 好的 2D 艺术工具对于绘制关卡布局和图表至关重要，对于制作您自己的图形和纹理也至关重要。其中一些工具甚至可以在浏览器中免费在线运行。 工具 注释 Photoshop 昂贵的照片编辑/画家 插画师 昂贵，适合矢量地图 物质 昂贵、流行、强大的纹理生成器工具 亲和力 免费的 Photoshop/Illustrator 替代品 光豌豆 免费的广告支持的 Photoshop 克隆，浏览器内（！） 克里塔 免费开源 Photoshop 替代品 画图网 免费开源 Photoshop 替代品 GIMP 免费的老派 Photoshop alt，名字不好 埃斯普莱特 便宜的流行像素艺术绘画工具 墨景 免费开源 Illustrator 替代品 四四方方的SVG 免费在线 Illustrator 替代方案，在浏览器中运行 纯参考 免费 (PWYW) 情绪板工具/参考图像管理器 典故 免费开源情绪板管理器，具有类似 PureRef 的拖放功能 规划工具 好的笔记和写作工具可以帮助您编写设计文档、规划项目、跟踪工作任务以及与他人协作。 工具 描述 一个笔记本 （现实生活，纸质） 许多设计师都有个人笔记本；将其视为便携式始终在线的浏览器选项卡 米罗 用于协作白板/“思维导图”/规划的流行免费增值服务 观念 流行的笔记、列表、维基、文档免费增值服务 特雷洛 流行的免费增值服务，用于游戏中的“看板”式项目规划 书士 便宜（50 美元）的写作工具，深受作者欢迎，提纲功能丰富 蒂德利维基 免费的开源轻量级个人 wiki，存在于您设备上的单个 .HTML 文件中 谷歌文档 有时最好保持简单 要审查... 为了 学习3D关卡设计 基本面，我们推荐 修改《雷神之锤》或《毁灭战士》 为了 制作 2D 关卡 ，我们推荐 平铺的 为了 一般 3D 艺术 ，我们推荐 搅拌机 为了 一般二维艺术 ，世界仍然使用 Photoshop 为了 规划 ，我们建议保留 现实生活中的纸质笔记本 用于个人草图、笔记等 但无论如何， 你应该使用任何你感觉好的东西 ，因为制作和完成东西比社会共识更重要 最终的关卡设计工具是 “在乎”"
                  },
                  {
                      "href":  "appendix__tools__trenchbroom.html",
                      "title":  "TrenchBroom",
                      "description":  "这个基于画笔的现代关卡编辑器工具的信息和资源",
                      "originalUrl":  "https://book.leveldesignbook.com/appendix/tools/trenchbroom",
                      "breadcrumbs":  [
                                          "APPENDIX",
                                          "工具"
                                      ],
                      "searchText":  "TrenchBroom 这个基于画笔的现代关卡编辑器工具的信息和资源 TrenchBroom （或 TrenchBroom 2，或 TB）是一款免费的开源跨平台 3D 关卡编辑器，具有现代化的 《雷神之锤》（ Steam ） 风格笔刷构造和持续更新/支持。它广泛应用于多个改装社区以及商业项目。 我们推荐 TB 作为一款不错的通用 3D 关卡编辑器工具，它可以与 Windows、macOS 和 Linux 上的多个游戏引擎配合使用。 工作流程 TB 与之前的 《雷神之锤》 时代关卡编辑器不同，它强调在单个视图窗格中进行 3D 构建。 剪切平面可以是 3D，并且所有画笔都会自动验证凸度。 TB 还非常擅长同时调整多个画笔的大小，具有类似于 SketchUp 的共享平面处理和上下文挤压功能。 仅就其构建能力而言，我们推荐 TB 进行构建 白盒 ，但它也允许令人惊讶的详细建模和纹理 美术处理 . 各种 TB 构建和纹理演示的画廊，来自 “Bal 的《雷神之锤》地图制作提示与技巧” 作者：伯努瓦·“巴尔”·斯托德尔 TrenchBroom 适合我的非 《雷神之锤》 项目吗？ 如果它不是 《雷神之锤》 mod，则需要考虑几个方面： .MAP / .BSP 支持 : 你的引擎可以导入或编译吗 .MAP 文件 或.BSP 文件？ TB的主要文件格式是基于文本的 雷神之锤.MAP , 阀门型号（“版本 220”） 如果它不是 《雷神之锤》 引擎，您将需要一个插件来导入 .MAP 或编译的 .BSP 最坏的情况：将画笔导出到 .OBJ 但丢失所有实体数据 资产整合： TB可以接入你的游戏资产吗？ 结核病可以阅读 常见文件格式 如 PNG、JPG、FBX、OBJ 等 有些插件可以 同步到 《雷神之锤》 格式 ，例如纹理包，例如 .WAD 脚本编写： 您的脚本需求有多复杂？ 为了放置游戏对象或编写脚本，TB 会 实体定义 在 .烟气脱硫 文件。 TB 适合简单的《雷神之锤》风格的脚本编写：放置对象、将按钮链接到门或绘制简单的路径……但编写过场动画或编排复杂的序列有点痛苦。 或者，也许仅将 TB 用于 3D 构建和标记，并在您使用的任何游戏引擎中本地编写所有脚本。 TrenchBroom 引擎兼容性 / 管线 游戏/引擎 .MAP支持 资产整合 戈多 导入通过 函数Godot ( 文档 ）或 科多特 ( 文档 ) （已停产） 常见文件格式，FGD / WAD 通过插件 Unity 导入通过 颤抖 , 数量 , 斯科帕 , 或 Unity3D-BSP-导入器 常见文件格式，FGD / WAD（通过一些插件） 虚幻 导入通过 哈默尔 ( 指南 ) 常见文件格式，通过 TextUEr 的纹理（ 指南 ) 雷神之锤1 通过以下方式编译到 BSP EricW工具 内置 FGD / WAD / MDL 雷神之锤2 通过以下方式编译到 BSP q2tools-220 内置 FGD / WAL / MD2 雷神之锤 3 ( 不完整的 ) 通过以下方式编译到 BSP q3映射2 内置 MD3 / 等，但还没有（或曾经？）补丁编辑支持 半条命（ 几乎 ) 通过以下方式编译到 BSP ZHLT v3.4+ /VHLT（ 指南 ) 内置FGD / WAD3 / MDL 毁灭战士 3（ Steam ） ( 叉子 ) 通过 定制叉 Trenchbroom-BFG 通过 定制叉 Trenchbroom-BFG 如果为 《雷神之锤》 进行映射 ，寻求帮助 Quake Mapping Discord 如果使用 Godot，请寻求帮助 FuncGodot Discord 要为任何引擎构建 .MAP 文件导入器，请参阅 MAP 文件格式 获取信息和示例代码 对于非 《雷神之锤》 引擎，您必须创建一个 TrenchBroom游戏配置 。请参阅 GitHub 仓库 /resources/games/ 文件夹 研究示例配置。 请注意，TB 可能不是 《雷神之锤》 3 或 《毁灭战士》 3 引擎的最佳工具。参见 工具 获取游戏引擎和推荐关卡编辑器的完整列表。 资源和社区 沟渠扫帚手册 在 GitHub 上下载 TrenchBroom GitHub 上的 TrenchBroom 存储库 TrenchBroom Discord TrenchBroom 快速入门教程视频简介 通过 David \"dumptruck_ds\" Spell 假设您正在为 《雷神之锤》 进行映射，但一般设置过程与任何引擎的映射类似。 Bal 的《雷神之锤》地图制作提示与技巧 (2022) 作者：Benoit \"Bal\" Stordeur 是中级/高级 Trenchbroom 施工技术的重要必读之作。尽管 Stordeur 在 《雷神之锤》 工作，但他的建议适用于在任何游戏中使用 Trenchbroom。 TrenchBroom实用工具 （Windows） 对象2MAP 作者：Warren Marshall / Aleksander Marhall 将 .OBJ 3D 模型转换为 .MAP 画笔。请注意，该工具相当古老，但它对于复杂的形状、地形或参考地理非常有用。 注意：如果您使用的是现代游戏引擎，只需直接导入.OBJ，无需使用此工具。该实用程序更适合《雷神之锤》/《半条命》地图绘制者。 （网络） TrenchBroom预制件 by SpaceHare 允许您将圆柱体、拱门和楼梯基元复制并粘贴到编辑器中。 （网络） 函数地形 Jackson Palmer 的作品可让您生成带有噪波图案的“三角汤”风格笔刷地形或绘制您自己的高度图 各种可复制粘贴的 TrenchBroom 原始预制件的屏幕截图， SpaceHare 的网络工具"
                  },
                  {
                      "href":  "culture__history-level-designer.html",
                      "title":  "关卡设计师简史",
                      "description":  "关卡设计师这一角色是如何在整个游戏行业中被发明和专业化的，包括 1993-2002 年的黄金时代，以及后来的衰落。",
                      "originalUrl":  "https://book.leveldesignbook.com/culture/history-level-designer",
                      "breadcrumbs":  [
                                          "BOOK 2, CULTURE"
                                      ],
                      "searchText":  "关卡设计师简史 关卡设计师这一角色是如何在整个游戏行业中被发明和专业化的，包括 1993-2002 年的黄金时代，以及后来的衰落。 简介 这是关卡设计师角色的历史，也是我们如何理解关卡设计师的工作条件和影响力的历史。我们的主要问题： “关卡设计师”是如何成为一个身份和工作角色的？哪一个先出现？ 行业内外的关卡设计师的文化理解是什么？ 关卡设计的现状如何？我们是如何走到这一步的？ 这段历史也与游戏行业的历史、游戏模组的历史以及家庭计算和互联网的历史相交叉。 早期计算/街机时代（1973-1980） 在游戏行业的早年，很多游戏程序员也为自己的项目做设计工作。 “关卡”是指街机游戏的编程难度关卡。 早期的第一人称游戏，如《迷宫战争》（Maze War，1973），作为研究实验室原型存在，没有任何官方指定的游戏设计师，而流行的第一人称街机游戏，如《Battlezone》（1980）则使用嵌入游戏代码中的程序生成/硬编码关卡。 带有绿色线框景观的《Battlezone》（1980）的屏幕截图 在此期间，引擎代码和游戏代码/内容共享相同的代码库，或者它们至少是紧密耦合的。没有单独的游戏数据文件需要编辑，因此关卡设计需要丰富的编程知识来编辑游戏代码；没有专门的关卡编辑器工具来制作关卡，因此关卡设计师基本上不存在。关卡设计只是游戏设计师和程序员非正式工作的一部分，因此不被理解为一个单独的设计学科。 电脑也非常非常昂贵。只有公司和大学才能负担得起用于研究的大型计算机，只有游乐场和企业才能通过出售机器的使用权来投资街机柜。由于专门使用计算机的人很少，所以关卡设计师（如果有的话）当然也很少。 游戏引擎的发明（1983-1992） 20 世纪 80 年代初，计算机制造商开始销售面向家庭市场的更小、更便宜的个人计算机 (PC) 和游戏机。更多的电脑意味着寻找新软件（尤其是游戏）的用户数量更大，以及业余“卧室程序员”社区，他们非正式地开发自己的游戏，据说是在家里的卧室里。 ZZT (1991) 内置编辑器的屏幕截图，正在编辑“城堡/井”板 Lode Runner（1983）是最早包含关卡编辑器（“编辑模式”）的游戏之一，据称独立开发者 Douglas E. Smith 让邻居的孩子们构建关卡，甚至将他们的许多关卡作为游戏的一部分发布。 Tim Sweeney 颇具影响力的游戏 ZZT (1991) 也以 内置编辑器 借助集成的 ZZT-OOP 脚本语言，培养了相当大的模组制作者社区，并激励 Sweeney 举办官方关卡设计竞赛。 最早流行的第一人称射击游戏《德军总部 3D》（Wolfenstein 3D，1992 年）并未附带关卡编辑器，但基于图块的地图格式非常简单，足以让一位名叫 Bill Kirby 的粉丝对名为“德军总部”的功能编辑器进行逆向工程。 地图编辑 。到 1993 年，粉丝们已经制作了数百张自定义地图和模组，促使开发商 id Software 为其后续游戏《毁灭战士》（ Steam ）和《雷神之锤》（ Steam ）构建更好的模组支持。 Bill Kirby 的 MapEdit 工具的屏幕截图，正在编辑“Wolf1 Map1” 作为社会建构的游戏引擎 《毁灭战士》（1993 年）被广泛认为是有史以来最有影响力的第一人称射击游戏。它的主要程序员约翰·卡马克推广了构建“游戏引擎”的概念，其中文件输入/输出和渲染等核心引擎代码与其余游戏代码和游戏数据分开。由于《毁灭战士》将其游戏内容存储在 .WAD 文件（“所有数据在哪里”）中，因此玩家可以加载自己的玩家 WAD (PWAD) 来修改游戏，并且这些 PWAD 可以交换自定义关卡、图形、声音等。 《毁灭战士》逐渐发展成为一种巨大的文化现象，拥有庞大的玩家基础和活跃的模组社区，并且一直持续到今天。它代表了关卡设计作为一种平易近人的业余爱好的开始，刺激了关卡设计社区和文化的发展。 但谁真正建立了关卡设计社区和文化呢？尽管提供了加载自定义 WAD 的技术基础，但 id Software 并未公开发布其内部关卡编辑器 末日编辑器 。当模组制作者没有可用的工具时，模组系统还有什么用呢？就像德军总部 3D 的 MapEdit 一样，模组制作者被迫再次对自己的工具进行逆向工程，例如 《毁灭战士》 编辑实用程序 (DEU) . 从这个意义上说，我们认为模组制作者和关卡设计师在很大程度上将自己发明为草根黑客实践，而商业游戏行业的支持极少（例如承诺不起诉）。 《毁灭战士》 Editing Utilities 的屏幕截图，这是由 Raphaël Quinet 和 Brendon Wyber 制作的粉丝编辑工具 这也是我们必须质疑卡马克作为模组守护神的流行历史叙述的地方。 id Software 之前与德军总部 3D 改装者合作的经验产生了一些不那么纯粹无私的商业激励措施，以支持《毁灭战士》中更正式的改装： 模组延长了游戏的生命周期及其零售销售的“长尾” 改装者免费培训自己，形成一个方便的劳动力库来雇用 官方 mod 支持可白盒黑客攻击/盗版（修改 Wolfenstein 3D 需要破解游戏可执行文件中嵌入的数据，绕过复制保护，因此 mod 分发必然导致盗版） 我们认为，卡马克对游戏引擎的普及更有效地理解为文化商业创新，而不是技术工程成就。数据驱动的编程范式自 20 世纪 70 年代以来就已经存在，甚至可模组游戏，如 Boulder Dash Construction Kit (1986)、The Bard\u0027s Tale Construction Set (1991)，当然还有 ZZT (1991) 早在 《毁灭战士》 (1993) 之前就已存在。从架构上来说，WAD 系统与其说是一个开创性的想法，不如说是对现有想法的改进。 真正让《毁灭战士》与众不同的是它的模组社区的数量和狂热，所以我们要强调的关键词是“普及”：卡马克 普及的 游戏引擎的社交构建，一个营销流行语，将视频游戏重新想象为用户生成内容的平台……而且它奏效了。模组制作者纷纷涌入游戏引擎并投入大量精力，直到今天仍然如此。 2019 年 Cacowards 获奖者 Jason Allison 的“Hocus Pocus 《毁灭战士》”和 Jaska 的“Lost Civilization”的屏幕截图 黄金时代（1993-2002） 我们认为，关卡设计经历了大约从1993年到2002年的黄金时代。在此期间，关卡设计工具被广泛使用，关卡设计成为一种更加普遍的消遣，关卡设计师在游戏文化中享有前所未有的声望和权力。 关卡设计师扮演摇滚明星 在黄金时代，关卡设计师在游戏文化中享有前所未有的声望。 也许历史上最著名的关卡设计师是 id Software 的联合创始人兼首席设计师约翰·罗梅罗 (John Romero)，他在 20 世纪 90 年代中期的游戏玩家中拥有摇滚明星般的知名度。这种声誉甚至促使出版商 E​​idos 委托为《Daikatana》（2000）制作一则臭名昭著的杂志广告，威胁游戏玩家“约翰·罗梅罗即将让你成为他的婊子。吸下去。”因此，关卡设计师是早期第一人称射击游戏和整个游戏行业的主要创意代言人。无论好坏。 《Electronic Games》（第 2 卷第 11 期，1995 年 1 月）掩体、“《毁灭战士》热潮”专题，以及臭名昭著的“John Romero\u0027s About To Make You His Bitch. Suck It Down”。 《Daikatana》杂志广告 (2000) 罗梅罗随后道歉 : “你知道吗，我从来没想过让你成为我的婊子……” 另请注意，20 世纪 90 年代是一个 前卫、讽刺、蹩脚的“X一代”营销 与 现代男性玩家身份的发明 包含有害的刻板印象。 其他《毁灭战士》关卡设计师，如美国麦吉 (American McGee) 也获得了较少的知名度和权力。 PC Gamer 委托尼尔·曼克制作官方《半条命》模组，并将他的名字印在杂志掩体上。标志性的《反恐精英（ Steam ）》地图 de_dust 的设计师戴夫·约翰斯顿 (Dave Johnston) 赢得了一些追随者和记者的采访请求。 Cliff Bleszinski 是 Epic Games 数十张 Unreal 1 和 Unreal Tournament 地图的设计师，他培养了一个像罗梅罗一样的摇滚明星公众形象 CliffyB。甚至还有一位多产的《雷神之锤》地图绘制者，自称“The Levelord”，人们的反应是，好吧，当然。无论好坏，这些人都会在流行的游戏玩家杂志上获得阿谀奉承的形象，当时这些杂志还很流行。 关卡设计说了算 游戏行业的每个人，或者至少是那些致力于最著名的大型 3D 动作游戏的人，似乎都同意：关卡设计是最重要的部分，关卡设计师对游戏的最终形状享有巨大的权力和控制权。 “关卡设计是橡胶上路的地方。” - Jay Wilbur，id Software 业务经理，1991-1997 年 “关卡设计师的职责非常重要，因为地图是游戏发生的地方。” - 约翰·罗梅罗，1999 “LD 是将其他人的辛勤工作整合到一个整体中的人。” - Cliff Bleszinski，GDC 2000 上的“关卡设计的艺术与科学” Valve Hammer Editor 3.5 编辑《半条命 1》中的地图“c1a0”的屏幕截图，来自 https://developer.valvesoftware.com/wiki/File:Hammer35.png 这种责任感源于关卡设计师在早期游戏引擎工作流程和管线中的技术重要性。关卡编辑器工具实际上是将代码、图形、音频和故事资源全部汇集在一起​​的地方。除非关卡设计师把它放在那里，否则游戏中什么都不存在。例如，如果设计师不喜欢某种纹理、声音或 AI 行为，那么他们可以简单地从关卡中忽略它——因此，它永远不会在游戏中使用。 因此，关卡设计师对游戏内容拥有“最终决定权”和非正式的制度否决权。当他们声称拥有自己的关卡所有权时，关卡编辑器工作流程的集中性质意味着他们实际上也可以声称拥有整个游戏体验的所有权。 高度现代主义 我们认为关卡设计的黄金时代在 2002 年达到顶峰 地理计算2 ，一个非官方的 《雷神之锤》 3 Arena 社区级设计竞赛，强调简单的纹理、广泛的抽象几何形式和详细的设计讨论。 GeoComp2 参赛作品强调作者主义、优雅感和功能纯粹性，将高水平竞技 FPS 游戏的美学与现代主义建筑的原则相结合。最重要的是，我们有意识地努力促进详细的设计语言和批评。 对于每件参赛作品，社区评审团都会使用关卡设计特有的专业术语和想法来辩论每张地图的优点。关卡设计师是否具有新鲜的个人风格，尝试前所未见的新奇想法？ “笔触”（关卡几何）感觉如何？这些类型的以工艺为导向的问题只能由具有共同历史、语言和理解的先进设计社区提出。 Bengal 的“Minima”概述，《雷神之锤》 3 Arena 的自定义多人游戏地图 “......地图是山丘之王风格的地图，分为两个块，与大量的跳跃垫和传送器相互连接。画笔奇怪地破碎，但建筑以一种世界艺术家的方式完成！画笔似乎向上扫过，提供了高耸在玩家上方的令人印象深刻的结构。[...]地图似乎有一种怀旧的感觉，几乎需要滴在毛皮上。[...]建筑似乎没有任何重复，画笔的所有方面都显得新鲜和新鲜尽管地图从左到右是对称的，但建筑却不是。例如，地板空间有奇怪的切割图案，以一种非常引人注目的方式打破了地图的对称主题……” ——西蒙“袜子”奥卡拉汉的批评 孟加拉的《极小值》 , 对于 GeoComp2 Bengal 的“Minima”屏幕截图，《雷神之锤》 3 Arena 的自定义多人游戏地图 GeoComp2 背后的目标不是制作一张流行的地图，甚至不是制作一张“有趣”的地图，而是要提高关卡设计的工艺。 《雷神之锤》 3 或 id Software 的粉丝都是次要的。这是关卡设计师主要为其他关卡设计师制作地图的一个明显"
                  },
                  {
                      "href":  "culture__overview.html",
                      "title":  "🦜 作为文化的关卡设计",
                      "description":  "更广泛地思考关卡设计，如历史/社区",
                      "originalUrl":  "https://book.leveldesignbook.com/culture/overview",
                      "breadcrumbs":  [
                                          "BOOK 2, CULTURE"
                                      ],
                      "searchText":  "🦜 作为文化的关卡设计 更广泛地思考关卡设计，如历史/社区 电子游戏总是在变化。这意味着关卡设计也在不断变化。本书的“文化”部分旨在了解关卡设计的模式和趋势： “关卡设计”对于不同的人来说意味着什么？ 其他学科和行业与关卡设计有何关系？ 除了“工艺”镜头之外，还有哪些其他方式来思考关卡设计？ 目前，这部分不是该项目的主要重点。我们想要完成 第 1 册，过程 首先。 然而，我们确实有几页可以让您了解我们的目标——历史分析、研究和文化批评的结合。 关卡设计师简史 遭遇战设计史 零玩家关卡设计"
                  },
                  {
                      "href":  "culture__unfinished-pages.html",
                      "title":  "未完成页面",
                      "description":  "最后更新 3年前",
                      "originalUrl":  "https://book.leveldesignbook.com/culture/unfinished-pages",
                      "breadcrumbs":  [
                                          "BOOK 2, CULTURE"
                                      ],
                      "searchText":  "未完成页面 第 2 册，文化 未完成页面 建筑史 结构工程入门 环境美术史 家具史 遭遇战设计史 上一页 零玩家关卡设计 下一步 建筑史 最后更新 3年前"
                  },
                  {
                      "href":  "culture__unfinished-pages__history-encounter-design.html",
                      "title":  "遭遇战设计史",
                      "description":  "的历史 遭遇战设计 几乎没有记录，因为，遭遇战设计本身也几乎没有记录。这些知识中的大部分都是在走廊、饮水机周围以及互联网论坛上非正式地分享的——直到最近，这个“领域”才真正被正式化为“知识”（比如在书本或演讲中）。",
                      "originalUrl":  "https://book.leveldesignbook.com/culture/unfinished-pages/history-encounter-design",
                      "breadcrumbs":  [
                                          "BOOK 2, CULTURE",
                                          "未完成页面"
                                      ],
                      "searchText":  "遭遇战设计史 简介 的历史 遭遇战设计 几乎没有记录，因为，遭遇战设计本身也几乎没有记录。这些知识中的大部分都是在走廊、饮水机周围以及互联网论坛上非正式地分享的——直到最近，这个“领域”才真正被正式化为“知识”（比如在书本或演讲中）。 本页是我们尝试拼凑遭遇战设计的来源以及多年来战斗设计趋势如何变化的尝试。 这是一篇历史文章。有关遭遇战设计本身的更多信息，请参阅 遭遇战 . 怪物放置时代（1993-1998） 毁灭战士 (1993) 早期的第一人称射击游戏设计继承了《毁灭战士》（ Steam ）的许多情感。反过来，《毁灭战士》继承了《Robotron》、《Berzerk》和《Tempest》等自上而下的 2D 射击游戏的街机设计传统的许多感受。事实上，可以完全从 2D 自上而下的“自动地图”视图来玩《毁灭战士》。 Bezerk (1980) 和 《毁灭战士》 (1993) 中自上而下的自动地图的比较，其中玩家位于中间，怪物为三角形 这个时代战斗设计的关键原则是“机动性即防御”： “……因为玩家在《毁灭战士》中移动速度如此之快，而且大多数敌人的攻击都是可以躲避的，所以玩家只需移动就可以避免大量伤害。熟练的玩家通常可以在几乎毫发无伤的情况下对付大量敌人。这创造了一种在现代 FPS 中相当罕见的感觉：你之所以强大是因为你敏捷，而不是因为你是坦克。这使得《毁灭战士》的遭遇战可以发布大量敌人，通过混合不同比例的威胁来改变场景，并巨大的、蔓延的、通常是非线性的空间，玩家可以轻松地穿越。” ——来自 《腔棘鱼：末日的教训》 通过矢量诗 在《毁灭战士》中，所有的敌人都被称为怪物——所以放置怪物的艺术被称为怪物放置。 大地图上的敌人数量很多……迷路是相对常见的，也是游戏的一部分 即发即忘、街机风格...怪物具有短暂的可预测重复行为循环...使用多种怪物类型，而不仅仅是一种 怪物作为指导，例如追击怪物寻找出口 怪物作为地图控制，例如不要立即杀死怪物，配给弹药，使用怪物与其他怪物内斗 进一步阅读《毁灭战士》中的遭遇战设计 “末日地图的根源：通过有史以来最有影响力的 WAD 进行关卡设计的演变” 作者：不是贾巴 《毁灭战士》world 论坛 \u003e 编辑教程：“怪物放置” 作者：格莱莫尔和恐怖 《腔棘鱼：末日的教训》 通过矢量诗 雷神之锤 (1996) 《雷神之锤》（ Steam ）延续了《毁灭战士》的大部分精神：在大地图上不断移动，并具有针对大量敌人的防御机动性。 对怪物的更多控制：随着高度变化进行牵引 “真实 3D”与《毁灭战士》的空间意识有所不同 TODO：向 Soc 索要图表？ https://twitter.com/SimsOCallaghan/status/1164996907929952268 https://twitter.com/SimsOCallaghan/status/1012039880841617408 https://twitter.com/Mclogenog/status/1228714057840177153 半条命 1 (1998) 怪物放置时代在《半条命 1》（1998 年）中达到了顶峰，其中的人类士兵“咕噜”人工智能通过大量使用动画和上下文音频吠叫，给人一种小队协调和群体战术的强大幻觉。 营销材料夸大了《半条命》对感官模型的使用（“公乌贼可以闻到你！！”）来推销现实主义的光环。怪物不再是街机障碍，而是具有心理和内在的活生生的生物。 （“如果你能和怪物说话怎么办？”） 现实主义意味着从“怪物”到“AI”和“NPC”的转变，他们现在需要更广泛的行为来“智胜”玩家——这是一个不会消失的技术迷恋营销点，可以说，永远玷污了第一人称射击游戏的战斗设计。 《半条命》标志着怪物放置时代的结束。它是最后一款将 NPC 称为怪物的具有历史影响力的射击游戏，是《半条命》《雷神之锤》 引擎技术和游戏设计方法基础的残余。 早期遭遇战设计（1998-2008） 早期的遭遇战设计是游戏行业开始系统化领土和知识模型概念的尝试。手工设计的巡逻路线与“一劳永逸”的怪物放置方式有很大不同。 它通常涉及主动且费力的关卡标记，并将地图区域划分为不同的领土和区域。我们开始在战斗期间精心设计特定的敌人行动，而不是简单地生成敌人并希望得到最好的结果。 此时，游戏开始将更多的工程和处理资源投入到敌人的人工智能上。开发人员开始将战斗 AI 视为在工具中进行设计的单独对象（例如可视化编辑器中的行为树），而不是嵌入游戏其余代码的硬编码系统。 比较《半条命 1》1998 年的 C++ 士兵 AI 代码与 _____ 中直观创作的行为树。 这一时期也标志着行业开发者第一次开始使用“相遇”这个词。 小偷：黑暗计划 (1998) Randy Smith 的“潜行游戏关卡构建”（GDC 2006） [PDF] 由 Look Glass / Arkane Studios 沉浸式模拟关卡设计资深人士兰迪·史密斯 (Randy Smith) 介绍如何考虑潜行游戏中的守卫布置和巡逻。尽管它不是直接关于战斗，但这个演讲对于遭遇战设计理论仍然至关重要，因为它整理了很多关于可供性、软掩体与硬掩体、视线和盲角等的思考。总的来说，这只是一个强有力的演讲，史密斯在其中解构了很多例子和房间图。 警卫根据他们的可见性和位置来维护“领地”。软掩护在该区域内提供“模糊”的情境掩护，而硬掩护则更加可靠和静态。看起来很多讨论并不适用于当代的关卡设计，因为史密斯的例子集中在具有光影潜行机制的类似小偷的游戏（例如隐藏在阴影中以不被守卫发现）以及《细胞分裂》和《耻辱》类型的游戏。 AAA 级沉浸式模拟游戏可以说已经消亡 。没有人再使用基于阴影的潜行游戏了！ 然而，在《刺客信条》、《神秘海域》、《合金装备》或《杀手 201x》等当代潜行动作系列中，软掩体仍然存在。他们刚刚用高高的草丛取代了阴影池，这提供了比阴影更可读、更离散的隐形区域，同时还展示了波浪草着色器，让 AAA 灯光艺术家可以做一些花哨的事情，而不必担心其阴影图案对玩法的影响。唯一的区别是，阴影确实是系统性的，是任何环境所固有的，而随处可见的便利草丛肯定会以搞笑的方式影响游戏的可信度。 （突然间，每个电子游戏仓库和军事基地现在都位于大草原或高草草原的中央。） 因此，当史密斯用阴影标记这些图表时，想象一下他实际上正在谈论草，或者你隐藏在水下的池塘，或者神奇的精灵雾，或者我们作为一个行业所拥抱的本周软掩体发明。 史密斯演讲的一开始有一个重要的免责声明：这不是关于设计过程的演讲。他指出，他们实际上并没有遵循这些设计方法来构建小偷任务。也就是说，他们没有勾勒出遭遇战和标记玩家路线的想法，也没有建立细致的图表来规划警卫巡逻和阴影池。 相反，大多数时候，他们只是用灰盒设置一个空间，并以直观的潜意识方式放置一些守卫，然后进行试玩测试，直到感觉良好为止。这种类型的思维作为试玩测试分析工具最有用，可以识别正在发生的事情，并且应该从下到上松散地应用。不要以自上而下的设计规划方式来做到这一点。 有关实际游戏中的潜行遭遇战案例研究的深入分析，请参阅 我关于盗贼 1 级刺客的帖子 . 光环 (2001) Chris Butcher 和 Jaime Griesemer 的“智能幻象：人工智能与光环关卡设计的集成”（GDC 2002） [PDF] 《光环》（ Steam ）（2001）可能是大规模 PvE 动态战斗设计的典型例子，这篇演讲建立了许多关键的首要原则。从广义上讲，这是关于良好的遭遇战设计如何需要可靠的敌人设计，而可靠的敌人设计意味着： 通过角色动画和音频吠叫向玩家广播其状态的敌人（例如，咕噜声会尖叫并举起双臂逃跑） 具有明确可预测能力和可供性的敌人，具有不同的任务优先级（例如，豺狼将使用其盾牌缓慢推进，而精英将寻求掩护） 感知和记忆有限的敌人；玩家应该能够欺骗敌人，并从动画/音频中注意到他们已经欺骗了敌人 因此，玩家对优秀游戏人工智能（设计为优雅失败的游戏人工智能，而不是机器学习人工智能）的看法不仅依赖于程序员，还依赖于艺术家和设计师。每个现代和当代的射击者都遵循这些原则，现在它们感觉像是常识。我认为常识是胡说八道，而这些东西过去并不是常识，从这次演讲中可以看出，邦吉必须阐明和发明所有这些所谓的常识。 尽管这次演讲对于遭遇战设计历史很重要，但这主要是游戏设计和人工智能的演讲。是的，我知道它的标题中有“关卡设计”，但如果你真正通读它，就会发现只有几张幻灯片涉及关卡设计。它并没有真正谈论实际的敌人脚本、布局或架构。只有几张幻灯片介绍了 《光环》 1 关卡设计师如何标记领土、防御工事、战线、撤退线和射击点，但没有具体的案例研究/关卡标记或提示的示例。 这是一个巨大的耻辱，但对我来说，这也说明了为什么关于遭遇战设计没有坚实的理论体系。就连现代遭遇战设计的鼻祖也不认为这是关卡设计的问题！相反，Bungie 似乎将遭遇战设计主要视为游戏设计师或人工智能程序员的问题。这显然更符合“战斗设计师”的思想。 许多游戏设计师都记得这次演讲，因为一张幻灯片上有一个设计说明： 为了让敌人看起来更聪明，只要给它更多的生命值 。生命值越高的敌人生存时间越长，这有助于它与玩家建立更多的关系并做更多的事情，这意味着敌人看起来更聪明。 这一观察结果导致了“子弹海绵”敌人的出现，他们拥有大量的生命值，但行为或战术几乎没有变化。但我们可以追溯到《光环 1》中高生命值敌人的想法，其中生存能力旨在促进玩家的力量幻想，并促使玩家采取更加多样化的战术和情况。也许当玩家抱怨子弹海绵时，他们也有部分抱怨遭遇战设计；如果子弹海绵做得更多，那么它们将不再感觉像子弹海绵。 “打造更好的战斗：光环 3 人工智能目标系统”作者：Damian Isla (GDC 2008) [PDF] 这是另一个光环遭遇战设计演讲，实际上并不谈论关卡设计，而是更多地迎合人工智能程序员和工具开发人员。尽管如此，这是最早的开发人员演讲之一，涉及领域、阶段（前线、后备、最后一站）、战线和行为树（命令式）与目标（声明式）AI 脚本模型的概念……所有这些内容构成了当今当代工业遭遇战设计的基础。 所有术语都暗示了 Bungie 内部使用的一致设计语言。但除非 Bungie 关卡设计师发表演讲，否则我们实际上并没有任何更深入的设计见解！那好吧。 战争机器 (2006) 普及掩体射击游戏 博客最近新闻 |游戏开发商 游戏开发商 在 Insomniac Games 中创造令人满意的战斗体验 www.gdcvault.com 杀手：血钱 (2006) 第一波杀手游戏的顶峰。一切仍然是手工设计的，但它已经正式化了公共/私人领域的概念 GDC 上 Mette 的杀手关卡设计演讲？ 动态遭遇战设计（2007年至今） 现代遭遇战设计的特点是尝试更系统地管理 NPC。 NPC 不再是手工制作的巡逻路径，而是通过 AI 例程自动四处走动；而不是手动放置敌人 使用生态系统隐喻、协调员、董事和指挥者。所有这些人工智能管理系统都会指导 NPC 在战斗中扮演不同的角色。 生化奇兵 (2007) 生态系统自负，玩家选择何时与大爸爸交往，遭遇战作为系统性的玩家发起的互动 潜行者：切尔诺贝利之影 (2007) A-life系统，拓展生化奇兵生态理念 孤岛惊魂2 (2008) 动态好友系统、开放世界战斗、跟踪者但更精致 生死存亡 4 (2008) Matt Scott 的“关卡设计研讨会基础知识：节奏”（GDC 中国 2012 / 2014） [PDF] 在这里，一位前 Valve 关卡设计师对《半条命 2（ Steam ）：第二集》中的白色森林旅馆战斗进行了案例研究，并详细介绍了 Valve 的节奏方法，该方法将玩法想象为强度上升/下降的图表。这与战斗设计和战斗的细节无关，更多的是在整个游戏中穿插谜题部分/故事过场动画部分/更安静的节奏，以确保更丰富的变化。 因此，要使用这种方法：将游戏分成不同的游戏节拍，确保不同类型的游戏节拍不同，并确保这些不同节拍之间的平滑过渡以实现某些效果。例"
                  },
                  {
                      "href":  "culture__unfinished-pages__history-of-architecture.html",
                      "title":  "建筑史",
                      "description":  "一万多年的建筑、建造和文明概述",
                      "originalUrl":  "https://book.leveldesignbook.com/culture/unfinished-pages/history-of-architecture",
                      "breadcrumbs":  [
                                          "BOOK 2, CULTURE",
                                          "未完成页面"
                                      ],
                      "searchText":  "建筑史 一万多年的建筑、建造和文明概述 建筑史显然非常复杂，超出了本书的范围。此页面只是一个最小的摘要，可帮助您指导自己的研究。 在研究历史建筑时，我们可以问的最简单的问题是： 他们当时为什么要那样建造呢？ 通常至少有三种解释： 人： 社会、文化、宗教、战争 地理： 气候、水、食物、资源、材料 技术： 识字、教育、工程、物理 我们的很多信息都来自于书本 《全球建筑史》 作者：Francis D.K. Ching、Mark M. Jarzombek 和 Vikramaditya Prakash。 它比这个摘要有更多的细节和见解。我们强烈建议您阅读它。 当我们考虑旧建筑时，需要记住以下几点： 曾经是色彩缤纷的。 古代人们像我们今天一样绘制建筑物。一千年后的今天，废墟看起来灰暗而光秃秃的，但它们并不总是这样。 古代木结构建筑已没有幸存。 但这并不意味着它们从未存在过。 历史偏向于奇特的建筑，而不是常见的“乡土建筑”。 然而游戏世界通常以日常家庭和工作场所为中心，而不是纪念碑。 公元前3500年 在“石器时代”晚期或新石器时代（公元前 10000 年 - 公元前 2500 年），世界各地的人类开始生活在小型部落/氏族定居点，通常靠近河流和湖泊。 他们用石头、泥土、木材和/或茅草在浅地基上建造了一层单间房屋。有时，村庄周围有一条护城河/沟渠，用于防御和排水（ 半坡 ）。较大的村庄可能有粮仓来储存食物（ 梅尔加尔 ），或专注于工业专业化，如采矿业（ 加泰霍裕克 ）。大多数人使用某种陶器，但有些是“陶瓷”并依靠篮子（ 卡拉尔-苏普 ）。宗教通常是小型的、个人化的，就像供奉母亲女神的家庭神殿或小型乡村寺庙。 （左）重建的泥木圆形住宅，中间有火坑，（右）约公元前 4500 年来自中国半坡的较大会议厅；摘自《全球建筑史》，第二版 在现存的少数大城市（10,000-40,000人）中，统治者和精英需要更复杂的宗教和官僚机构来维持控制。他们用更大更高的宫殿、寺庙和大门来证明自己的权威，这些宫殿、寺庙和大门都是用更豪华的材料建造的——比如窑烧砖瓦需要燃烧大量木材( 乌鲁克 ）。但大多数定居点/地区仍然没有统一在单一权力之下——相反，它们是分散的、多样化的和平等的。 （左）房屋格局示意图，（中）典型的泥砖+橡木梁房屋，以及（右）典型的陶土牛角家庭神龛；约公元前 3000 年，来自土耳其 Çatalhöyük；摘自《全球建筑史》，第二版 公元前2500年 在“青铜时代”（公元前 3000 年 - 公元前 1200 年），更大的定居点变得更加普遍。古代城市有城市精英的证据——更大的建筑群和更稀有的材料和物品。 这 印度河加加尔-哈克拉文明 建造了像这样的大城市 摩亨佐-达罗 复杂的排水系统内置于城市网格中铺设的数百万块砖块的大型平台中。然而，尽管需要复杂的组织和劳动力，但城市布局是私人的和关卡化的，几乎没有中央统治者或宗教权威的证据（就像任何其他古城一样）。 请注意，大多数建筑物很少向街道开放，而是面向公共通道有限的内部庭院；摘自约公元前 2500 年摩亨佐-达罗的部分重建城市规划，摘自《剑桥世界历史》（2015 年） 在美索不达米亚， 乌尔金字形神塔 是一个建筑里程碑，巨大的楼梯和平台被组装成抽象的 体块 ——这座寺庙唤起了统一的视觉和审美，它可能是人类历史上正式建筑的第一个例子。同样，砖块的绝对数量意味着大量的资源、劳动力和社会组织。 当时世界各地还有其他类似的纪念性建筑里程碑，例如在埃及（ 左塞尔金字塔 ), 马耳他 ( 吉甘提亚 ）， 英格兰 （ 巨石阵 ）和秘鲁（ 金字塔市长 ）。所有这些奇观都具有宗教/仪式中心的功能。然而我们对这些地方/社会仍然知之甚少。 （左）乌尔金字形神塔的重建图，以及（右）由墙壁包围的金字形神塔的寺庙建筑群平面图，摘自巴尼斯特·弗莱彻（Banister Fletcher）的《比较方法建筑史》（1898 年），属于公共领域 公元前1500年 加加尔-哈克拉河干涸，未知的入侵者占领了美索不达米亚；其他势力开始在地中海周边发展。 统治者拉美西斯一世巩固了 埃及“新王国” 权力与宗教在 卡纳克神庙 ，尼罗河沿岸的城市寺庙建筑群。寺庙遵循线性 主动线 。节日游行/“游行”穿过雄伟的寺庙 塔门 雕刻并绘制了法老的伟大事迹，以标志性的梯形形状表达了权力和宇宙论。穿过更多的塔楼、庭院和房间后，道路分叉，通向最里面的圣所，里面有一座圣殿。 卡雕像 吸收宗教供品。的 阿布辛贝神庙 作为埃及岩石神庙的顶峰，它还设有一个带有祭坛的内部圣所，黎明时分，旭日的光芒照亮了祭坛。 注意这个绘制的重建中的塔的顺序 阿蒙雷辖区 （“卡纳克神庙”）约公元前 1500 年，摘自巴尼斯特·弗莱彻 (Banister Fletcher) 的《比较方法建筑史》(1898)，属于公共领域 埃及的柱子具有高度的象征意义，并受到希腊和罗马设计的启发。莲花/纸莎草图案的柱子标志着神圣的空间，形成了大地托起天空的创世神话——捆绑的芦苇和植物图案让人想起尼罗河、它的稳定和永恒。 与许多其他古代建筑一样，石柱上覆盖着灰泥，并涂有鲜艳的色彩，但随着时间的推移，这些石柱已经腐烂和褪色。 （TODO：添加有关 Windows 的注释） （左）卢克索神庙纸莎草风格柱子的照片 作者：迭戈·德尔索 (CC-BY-SA) ; （右）扫描来自阿尔伯特·拉西内 (Albert Racinet) 的 L\u0027Ornement Polychrome 的彩色埃及柱子 (1888)，属于公共领域 一位米诺斯祭司国王统治着 克诺索斯宫殿 ，一个大型的多层建筑群，围绕着一个南北向的中央庭院。这座微型城市还有仓库、寺庙和内置通风和排水系统的住宅。石墙覆盖着泥土/稻草/石膏，并涂有壁画，锥形木柱被漆成红色，柱头为蓝色。像埃及人一样，米诺斯人建立了一条关键的路径入口序列，具有特定的视图和符号，从西门廊开始，爬上巨大的楼梯，进入王座室。 约公元前 1500 年克诺索斯宫殿的插图重建，摘自《全球建筑史》，第三版 （左）从西门廊到特等舱的入口顺序图； （右）克诺索斯重建的“大楼梯”照片；图片来自《全球建筑史》，第二版 公元前800年 奥尔梅克、拉文塔、查文德万塔尔、特潘特夸尼特兰 中国周朝，凤初/王城的仪式建筑 巴比伦，伊什塔尔门 公元前400年 古典希腊，多立克柱式从木头到石头的过渡受到埃及的启发......阿波罗神庙/德尔斐的特曼诺斯......离子柱式是平行的，而不是在......雅典卫城之后 桑吉大佛塔 咸阳宫荷鲁斯神庙 0CE 罗马...采用希腊形式、混凝土、维特鲁威...庞贝古城的罗马城市别墅、帕拉蒂尼山的图密善宫、罗马斗兽场 秦汉时期中国 特奥蒂瓦坎"
                  },
                  {
                      "href":  "culture__unfinished-pages__history-of-environment-art.html",
                      "title":  "环境美术史",
                      "description":  "（未完成的存根）",
                      "originalUrl":  "https://book.leveldesignbook.com/culture/unfinished-pages/history-of-environment-art",
                      "breadcrumbs":  [
                                          "BOOK 2, CULTURE",
                                          "未完成页面"
                                      ],
                      "searchText":  "环境美术史 （未完成的存根） 20世纪初现代主义建筑师争论：什么是建筑的灵魂？ 建筑师路易斯·沙利文 (Louis Sullivan) 在一篇文章《从艺术角度考虑的高层办公楼》（1896 年）中提出了著名的论点，即一座四四方方、毫无特色的工业办公楼有其独特的美感，这种美感是永恒且普遍的—— “形式服从功能。” 所以这是理解环境美术的一种（过时的）方式：额外的细节和装饰、形式 没有 功能。 有关现代主义建筑师错误的更多信息，请参阅 建筑史 . （TODO：比较新艺术风格与现代主义建筑形象） 更直接地说，环境美术植根于两种工艺：模型微缩模型和电影布景建造。 人们过去常常玩实体娃娃屋、模型火车和战锤战斗。你必须自己组装和油漆这些部件，但建造和定制是乐趣的一部分。它必须很漂亮，但也必须可供玩耍。 电影行业过去常常使用哑光绘画和道具设计来构建物理电影布景/特效。一些环境美术术语（如“英雄道具”）甚至来自电影行业。许多艺术家都曾在电影和游戏领域工作过，而且这些行业/传统每天都在更加融合。 （TODO：火车微缩模型、电影布景微缩模型等）"
                  },
                  {
                      "href":  "culture__unfinished-pages__history-of-furniture.html",
                      "title":  "家具史",
                      "description":  "大多数家具至少具有以下四种功能之一：(1) 坐，(2) 桌子（工作、展示），(3) 存储，(4) 睡眠。但功能只是思考家具的一种方式。家具及其摆放位置也反映了社会地位、财富、文化、技术、气候和个人表达。当我们在关卡中制作和放置虚拟家具时，它反映了所有这些理解。",
                      "originalUrl":  "https://book.leveldesignbook.com/culture/unfinished-pages/history-of-furniture",
                      "breadcrumbs":  [
                                          "BOOK 2, CULTURE",
                                          "未完成页面"
                                      ],
                      "searchText":  "家具史 了解家具 大多数家具至少具有以下四种功能之一：(1) 坐，(2) 桌子（工作、展示），(3) 存储，(4) 睡眠。但功能只是思考家具的一种方式。家具及其摆放位置也反映了社会地位、财富、文化、技术、气候和个人表达。当我们在关卡中制作和放置虚拟家具时，它反映了所有这些理解。 在关卡设计中，家具对于环境叙事和美术处理中的布景无疑至关重要，但它也意味着正式的游戏功能。如果你玩的是当代掩体射击游戏，看到一把古董木椅，那么你就会把它理解为可移动的软掩体。如果您正在玩带有制作和回收系统的游戏，您可能会分解椅子以获得少量木材。如果您正在玩大逃杀或道具狩猎多人游戏，那么放错位置的椅子会表明有人访问过该位置。家具是游戏状态的一部分！ 两个简短的免责声明： 这段历史偏向于西方对家具的理解，并且与大多数物质史一样，它也偏向于富人，因为他们的物品得到了保存和研究。 我们从关卡设计师的需求出发来设计家具。本页较少介绍具体的历史，更多地介绍如何按历史时期和文化组织有效地提供您的关卡。 此页尚未完成 ，里面有我不完整的写作笔记和总结。 史前家具（公元前 6000 年 - 公元前 3000 年） 新石器时代的文物描绘了人们坐着的样子， 加塔霍裕克的坐女 . . 古代家具（公元前 3000 年 - 公元 600 年） 很难了解很多关于古代家具的信息，因为大多数木件已经腐烂/消失了。我们对古代家具的了解来自于历史记载、雕刻/绘画以及来自火山灾难遗址和坟墓的稀有保存件。 古代座位 古地中海地区最常见的家具是带有低矮矩形座椅和 4 条腿的木凳。常见的埃及凳子有编织的芦苇座，希腊的二弗凳通常有旋转的（圆形）腿。 公共场所都有内置的石凳，或者人们会自带X形折叠凳。 椅子通常是为上层阶级或精英保留的。希腊王座、klismos 和 klinai 都有优雅的线条。埃及椅子更有棱角，但仍然非常精致和干净，比许多中世纪欧洲家具更先进。 古代桌子 内置的石头克制关系和桌子很常见。希腊餐桌是低矮的、有 3 条腿的矩形桌面，通常紧邻上层阶级就餐的 klinai。 古代容器 古埃及家具：几千年来没有太大变化，但法老家具的木工非常精细，技术比大多数中世纪家具更好……线条和形状非常干净，几乎是现代主义的 常见的古希腊罗马家具：大多是内置的长凳、凳子和克制关系……如果你有一张桌子，它的高度较低，可以在不使用时移动收起来 富有的希腊罗马人有沙发和X形折叠凳（从埃及进口？）（罗马政客） 希腊罗马椅子象征着权力：王座 椅子和凳子在亚洲和美洲有些罕见：通常坐在地板上或垫子上 中世纪家具（600-1500） 中世纪欧洲 富人基本上是游牧民族，会经常四处走动（追踪食物比把食物带到集中的地方更容易），所以他们使用大量的箱子、小型可移动家具，并用挂毯/布料装饰他们留在原地的永久家具……然后收拾好所有东西，搬到下一个住所 由于富人通过财产来表达财富，因此高度重视坚固的箱子+分层的自助餐台来展示精美的丝绸、盘子和手工艺品。染料非常花哨！ 椅子仍然不是很常见。带脚凳的宝座，高高在讲台上。身高非常重要。平民可以自己坐在椅子上，但在君主面前，他们必须坐在长凳和凳子上（如果有的话）。长凳是最常见的座位 房间大多是空的，不用时家具被推到一边...桌子被拿出来准备活动/晚餐，然后收起来...再次，记住家具纯粹是功能性的，桌布是实际的装饰元素 桌子很长，每个人都背靠墙坐在一侧……有权有势的情侣坐在中间 一个很大的例外是教堂，它们不是游牧的，所以他们可能有巨大而精致的雕刻和又大又重的家具 这就是家具和建筑的交叉点；像建筑物一样雕刻的家具 工具挂在墙上，独立式木架子很少见（！），通常是木板镶嵌在墙洞里 文艺复兴时期的家具（1500-1600） 印刷机使文艺复兴/古代研究成为可能......配备手册，文艺复兴艺术家比中世纪工匠制作出更好的古典复制品 富人正在寻找足够的稳定性来安顿下来并永久装饰，例如威尼斯... 家具工艺现在变得足够复杂，足以形成特定的行会，例如细木工...1500 年代出现了室内装潢、抽屉和与室内装饰相匹配的家具...伊丽莎白女王订购了大理石台面的桌子 桌子更宽、更短，每个人都坐在两边，重要的情侣坐在桌子的两端 雕花自助餐 在西班牙，皮革比木材更常见？ （摩尔人的影响将木材视为稀有的装饰材料而不是结构材料） 早期现代家具（1600-1800） 欧洲：英法家具出口业兴起，英式家具乏味但品质高，法式家具时尚豪华但工艺水平较低 在英国：贸易量很大，对印度（藤椅）和中国（漆器）很感兴趣……1700年代的“中国时尚”……架子上的漆柜……乌木的崛起……大镜子（非常昂贵），上面有大理石面的边桌，上面陈列着瓷器。 “Japanning”是英文仿制中国漆的意思 法国：室内装潢、舒适度、现代奢华理念的兴起（凡尔赛宫）...富人的卧室是接待客人的社交空间（第 84 页），但现在也将公共和私人分开（例如凡尔赛宫的小公寓与公共宫廷房间），餐厅的发明 文艺复兴时期的人文主义：理解、分类、收集世界上不同的材料和风格......甚至更加专业化的工艺（第99页）......雕刻家具和贴面橱柜的巅峰......洛可可 早期工业家具（1800-1900） 英国摄政、希腊复兴、法兰西帝国（拿破仑） 在英国：新古典主义的反作用，经典“永恒”椅子的发明，乡村工匠一遍又一遍地重复相同的椅子和桌子（例如美国Shaker梯背，粘背温莎）......中产阶级的崛起，好家具变得更加普遍 在美国：为客人提供摇椅 弹簧内饰、切斯特菲尔德沙发、对舒适度和安逸的新关注……家具摆放的诞生和用家具填充房间（第 133 页） 托尼特曲木椅！！！ 现代家具（1900-1950） 现代家具（1950+） 来源 露西-史密斯，爱德华。 家具：简明历史。 泰晤士河和哈德逊河：2005 年。 https://en.wikipedia.org/wiki/Chinese_furniture"
                  },
                  {
                      "href":  "culture__unfinished-pages__structural-engineering-primer.html",
                      "title":  "结构工程入门",
                      "description":  "TODO：总结《建筑物为何屹立》中的一些内容",
                      "originalUrl":  "https://book.leveldesignbook.com/culture/unfinished-pages/structural-engineering-primer",
                      "breadcrumbs":  [
                                          "BOOK 2, CULTURE",
                                          "未完成页面"
                                      ],
                      "searchText":  "结构工程入门 TODO：总结《建筑物为何屹立》中的一些内容 游戏示例： https://tf2maps.net/threads/guide-a-primer-on-basic-structures.38329/"
                  },
                  {
                      "href":  "culture__zero-player.html",
                      "title":  "零玩家关卡设计",
                      "description":  "关于玩家零输入的杂技社区制作关卡的文章",
                      "originalUrl":  "https://book.leveldesignbook.com/culture/zero-player",
                      "breadcrumbs":  [
                                          "BOOK 2, CULTURE"
                                      ],
                      "searchText":  "零玩家关卡设计 关于玩家零输入的杂技社区制作关卡的文章 在《TrackMania》等赛车游戏和《Super Mario Maker》等平台游戏中，用户构建了复杂的“Press Forward”和“Auto-Mario”关卡，推动玩家的游戏角色表演出令人眼花缭乱的杂技技巧，但玩家的输入却微不足道或最少。 我们认为这种类型的“零玩家关卡设计”使玩法和玩家的典型想法变得复杂：这些零玩家关卡是有趣的设计对象，玩而不玩，并强调建筑编排的精湛技艺。 本文首次出现于 VGA 读卡器卷。 3 作为 “围绕建筑起舞：零玩家关卡设计” 并已被编辑包含在本书中。 《Trackmania Nations Forever》中玩家的汽车在精心制作的 PF“Hyperion’s Wrath”中倾斜的屏幕截图，来自用户 L4Bomb4 于 2016 年 4 月 18 日上传的 YouTube 视频“Trackmania [PF] - Hyperion’s Wrath | PRESS FORWARD”。 局部层面的设计 许多当代视频游戏都具有强大的内置编辑器工具，让玩家无需任何专门的专业软件或硬件即可构建新的关卡。这些工具的可访问性和即时性通常会吸引那些通常不认为自己是游戏设计师的人，并且新的设计模式通常会从这些休闲玩家设计师社区中有机地出现。这些热情的业余爱好者使用的关卡设计与工业开发人员的规范设计模式非常不同，构成了我称之为“本地关卡设计”的实践。 本地关卡设计通常发生在原始游戏的非常特定的环境和社区中。例如，2010 年，Valve 改变了玩家在其第一人称多人射击游戏《军团要塞 2》（ Steam ）中解锁物品的方式；为了获得新的升级，玩家突然必须努力实现成就目标，例如使用特定武器杀死一定数量的敌人。对此，玩家社区迅速建立了成就研磨服务器，并配有专门设计的成就耕种地图，以便玩家可以轻松实现这些成就目标，并比典型的散漫游戏更快地获得这些升级。 Valve 官方强烈反对这些新的成就服务器和地图，认为这无异于作弊或利用。 图 1，《军团要塞 2》成就陷阱地图“achievement_all_v4”中一只大猫向玩家发射激光的屏幕截图，来自用户 jasonrawr 于 2010 年 6 月 25 日上传的 YouTube 视频“军团要塞 2 - 激光死亡猫”https://www.youtube.com/watch?v=vb_9vxXyqdU 为了反驳这场道德危机，一位名叫The303的用户制作了“achievement_all_v4”，这是一张新颖的成就陷阱地图，几分钟内一切看起来都像正常的成就农场地图，直到一只巨大的无敌巨猫从地底下爆发出来，用强大的激光束和大炮攻击每一个玩家。最后，整个服务器上所有幸存的玩家都会被核爆炸消灭。该地图的目标显然是欺骗玩家，让他们认为他们将在成就磨练地图上玩，然后以高度可见和幽默的方式惩罚他们。 成就研磨地图和随之而来的成就陷阱都是地方关卡设计作为一种话语形式的明显例子，在这种情况下，这些地图充当了反映社区行为的道德对话。它举例说明了用户如何经常发明新的方法来理解游戏的核心构建块和假设，从而发现使用游戏设计语言的全新方法。 我想谈谈一种在几种不同的游戏和类型中出现的本地关卡设计形式：“零玩家关卡”，它自相矛盾地要求最少或微不足道的玩家输入才能成功完成。 这些关卡使游戏中玩家代理的典型想法变得复杂，并将玩家设计师定位为优雅的编舞者，而不是讽刺的评论员或熟练的表演者。这种现象与这些社区如何开发（或辩论）游戏的设计语言、他们如何理解各种设计实践的边界以及玩家社区如何保持其身份相交叉。 TrackMania 中的前压 (PF) Nadeo 的 TrackMania 赛车游戏具有内置赛道编辑器，在游戏的广告材料和主菜单中占据显着位置。为了促进文件共享，当玩家连接到多人服务器时，游戏客户端会自动下载新的用户制作的自定义曲目。名为 TrackMania Exchange 的社区运行数据库还允许玩家上传和存档他们的曲目文件，并作为玩家讨论和分析喜爱的曲目和构建技术的社交中心。 TrackMania 游戏通常包含 Nadeo 构建的一百条或更多赛道，这些赛道的长度、复杂性和难度逐渐增加。早期的 TrackMania 游戏甚至迫使玩家在这些赛道上比赛以赚取货币，他们可以用这些货币为赛道编辑器解锁新的区块。对于新玩家来说，这些预先构建的包含赛道建立了普遍接受的赛道设计模式的设计规范，并且许多自定义玩家构建的赛道依赖于这些库存赛道来指导某些技能和驾驶操作。后来的 TrackMania 游戏将赛道设计正式化为三种游戏模式/类型：竞赛（强调与其他车辆竞争的赛道）、平台（强调棘手的跳跃和下降的赛道）和拼图（进度和检查点不清楚的赛道）。 图 2，玩家的汽车驾驶通过 Trackmania Nations Forever 中典型赛道“D02-Race”的屏幕截图，来自用户 TechmsTutorials 于 2012 年 8 月 4 日上传的 YouTube 视频“Free Steam Games - #2 TrackMania Nations Forever (+ Gameplay )” https://www.youtube.com/watch?v=pZIoYjsotK0 值得注意的是，Nadeo 的分类中并未包含社区最喜爱的“Press Forward”（PF）曲目。 PF 并没有要求玩家在赛道上磨练他们的反应能力和智慧，而是让玩家只需按住“前进”按钮，然后以更加被动的旁观者的身份观看会发生什么。玩家无需凭借自己的技巧，就能根据赛道上鲁布·戈德堡 (Rube Goldberg) 般精致的空气动力学交响乐团，驾驶汽车执行惊人的特技和机动——一辆汽车可能会在空中旋转 1080 度，然后以正确的方式勉强擦过坡道，完美地降落在下面的赛道上。矛盾的是，如果玩家做出任何选择，比如放开“前进”键，或者（上帝禁止）向左转 0.1 度，任何微小的偏差都会导致灾难性的崩溃。 PF 曲目失败的唯一方法就是播放它并做出实际的选择。成功完成 PF 需要玩家基本上放弃他们在游戏世界中的代理权。从这个意义上说，纳德奥试图压制新闻界的原因就很明显了。这是一种激进的设计实践，违背了《赛道狂飙》的预期游戏模式。这是一个令人惊讶的存在主义电子游戏世界，它基本上会惩罚试图运用任何代理或控制权的玩家，并进一步贬低在“正常”赛道上比赛的熟练车手的成就。当德行得到保证的时候，就不再是德行了！ PF 触及本地关卡设计社区的核心，并询问我们，是什么造就了一个强大的玩家社区——玩家还是设计师？ 图3，《赛道狂飙：国度永恒》中玩家的赛车通过精心制作的PF“Hyperion\u0027s Wrath”倾斜的视频 前锋的“发挥”和“技巧”不在于其表现，而在于其结构。最广受好评的 PF 似乎专注于巨大的尺寸、复杂的层层交叉口和意想不到的非标准轨道部件的即兴创作。例如，ThunderClap 的 PF“Hyperion’s Wrath”以某种方式引导玩家的车辆以奇怪的角度撞上赛道，看似不太理想地驶过赛道，掉落，不稳定地旋转，沿着装饰性镀铬雕像滑行，然后完美地降落在半管上。设计目标是创造一种人类玩家在人类看不见和难以辨认的赛道上可能永远无法实现的不可思议的表现。相反，赛道会自己表演，而人类演奏者只是它的乐器。 PF 有一个值得注意的变体：“什么都不按”（PN），它要求玩家在键盘上绝对不按任何东西。这些赛道设计无需任何玩家输入即可加速玩家的汽车，通常在玩家开始后直接放置一条“助推垫”轨道块的路径。然而，PN 远不如 PF 受欢迎，这可能是因为汽车在通过赛道时逐渐失去速度；为了保持足够的速度，PN 设计师必须定期留出足够的空间来放置加速垫，这与 PF 超现实即时性的美学相比是不利的。 图 4，用户在 Trackmania Nations Forever 编辑器中构建简单的不完整赛道的屏幕截图，来自用户 LuccassCZ 于 2012 年 9 月 14 日上传的 YouTube 视频“Trackmania Nations Forever Editor Tratě [CZ]” https://www.youtube.com/watch?v=JlNU1yecz7M 《超级马里奥制造》中的自动马里奥 任天堂的《超级马里奥制造者》系列 (SMM) 拥有一个由开发者积极管理的用户社区（有时太多或太少，取决于你问的是谁），邀请用户使用流行的超级马里奥游戏的常见构建块和平台游戏风格来构建新课程。 与典型的马里奥游戏有很大不同，SMM 游戏不再强调完成预先制作的关卡序列。 虽然《超级马里奥制造者 2》确实具有幽默的故事模式，其中马里奥必须通过完成各种“工作”（由任天堂构建的预先制作的示例课程）来重建一座意外拆除的城堡，但这些一次性工作课程显然是为了演示各种游戏机制、能力提升和建筑模式，并且不像其他超级马里奥游戏那样具有任何连贯的故事情节或进展。 SMM 2 的主菜单按钮布局与玩任天堂库存课程的转变相呼应：顶部的第一个选项是“课程制作器”，然后是“故事模式”、“课程世界”（用于浏览其他用户的关卡），最后是“CourseBot”（用于管理现有课程文件和下载的实用菜单）。 图 5，《Super Mario Maker 2》中故事模式之前列出的主菜单侧边栏屏幕截图，来自用户 ZackScottGames 于 2019 年 6 月 28 日上传的“Super Mario Maker 2 - 玩法演练第 1 部分 - 故事模式和课程世界！（Nintendo Switch）” https://www.youtube.com/watch?v=ISWqMgouaxs 演示课程只是任天堂尝试开发共享设计语言和/或将设计规范强加给 SMM 社区的尝试之一。 SMM2 特别具有新的社区“标签”系统，用户可以在其中附加标签来描述课程。 当一门课程让人想起马里奥系列的常见平台玩法时，用户应该将其标记为“标准”。与此同时，关于以最少的屏幕滚动进行缓慢有条理的推理的课程获得了“解谜”标签，而“快速奔跑”标签意味着大量使用快速熟练的连续移动来对抗计时器。请注意与 Nadeo 的 TrackMania 赛道类别（竞赛、平台、拼图）的相似之处。另请注意，某些课程标签可能只是描述性的，例如“简短而甜蜜”标签。 SMM2 的标签系统有两个关键限制： (1) 课程最多可以有两个主标签显示在主浏览器菜单中 (2) 标签是由任天堂预定义（和本地化）的，这意味着用户无法发明自己的标签。相反，草根社区类型必须直接在课程标题中标记，这限制了全球 SMM 社区其他成员对这些关卡的发现。 图 6，《Super Mario Maker 2》课程浏览界面的屏幕截图，其中包含每个缩略图、课程标题、游戏统计数据和标签，摘自用户 ZackScottGames 于 2019 年 6 月 28 日上传的“Super Mario Maker 2 - 玩法演练第 1 部分 - 故事模式和课程世界！（Nintendo Switch）” https://www.youtube.com/watch?v=ISWqMgouaxs 可以预见的是，标签限制会在 SMM2 社区内引发激烈的类型争论。标准标签下允许什么？当该标签本地化为“传统”时，西班牙语玩家是否会以不同的方式理解该标签？标准课程是否也可以包含解谜和速通部分？当任天堂拒绝为某些社区类型（例如专注于滑稽不公平难度的流行“Kaizo”课程）赋予官方标签时，这意味着什么？是的，SMM2 的标签相对于 SMM1 缺乏过滤器和分类来说是一个很大的改进，但当然这种新的分类形式也有其自身的问题。 与 TrackMania 中相对流行的 PF / PN 不同，SMM 社区非常喜欢自己的 PN 变体，即“自动”关卡或“自动马里奥”。 《自动马里奥》课程与典型的标准、解谜或速通框架不同，并且要求玩家在游戏控制器上完全不按任何东西。虽然这种自动关卡是 SMM1 社区设计的非官方类型"
                  },
                  {
                      "href":  "index.html",
                      "title":  "The Level Design Book 中文版",
                      "description":  "The Level Design Book 中文版以平易近人、最新且批判性的方式收集了 3D 视频游戏的关卡设计知识。它适用于所有经验水平和游戏引擎的设计师。",
                      "originalUrl":  "https://book.leveldesignbook.com",
                      "breadcrumbs":  [

                                      ],
                      "searchText":  "The Level Design Book 中文版 The Level Design Book 中文版以平易近人、最新且批判性的方式收集了 3D 视频游戏的关卡设计知识。它适用于所有经验水平和游戏引擎的设计师。 本书正在紧锣密鼓地编写中。 结构可能会发生很大变化，并且某些页面可能还没有内容。 最近更新 2025 年 11 月：小规模清理 工具 / TrenchBroom 2025 年 1 月：添加 推荐演讲 读这本书 什么是关卡设计？ 从这里开始阅读！ 如何制作关卡 流程概览 研究 批判性论文和关卡设计分析。 工具 关卡编辑器和可模组游戏列表 资产和资源 免费 2D/3D 资源、信息、其他书籍等的链接。 给教学者的笔记 教学建议，如何在课堂上使用本书 这本在线书籍可永久免费阅读， 知识共享署名-非商业性-相同方式共享 4.0 国际 (CC BY-NC-SA 4.0) 执照。我们绝不会出售或付费访问本书。如果您翻译本书的部分内容，您不得出售副本或访问译文。欲了解更多信息，请参阅我们的 许可和版权 页。"
                  },
                  {
                      "href":  "introduction.html",
                      "title":  "✨ 什么是关卡设计",
                      "description":  "什么是关卡，什么是关卡设计，以及如何使用这本书",
                      "originalUrl":  "https://book.leveldesignbook.com/introduction",
                      "breadcrumbs":  [

                                      ],
                      "searchText":  "✨ 什么是关卡设计 什么是关卡，什么是关卡设计，以及如何使用这本书 什么是关卡 叠加在血峡谷（光环 1）概览上的篮球场图，作者： @neilsonks（通过推特） 一个 关卡 是进行游戏的空间。一些例子： 《堡垒之夜》（ Epic ） 岛，Roblox 中的障碍训练场（“obby”） 篮球场、赛马场或游乐场 大富翁棋盘、填字游戏、图画书 所有这些游戏空间都已设置 边界 供玩家移动和互动。 不同关卡会提供 变化。 例如，所有篮球场都有相似的形状，但室外球场和室内体育馆提供不同的 经历 , 文化， 和 心情。 关卡设计师关注不同的游戏空间如何让玩家 感觉 和 表现 . 什么是关卡设计 我们对关卡设计进行了广泛的定义，但有一个具体的免责声明： 关卡设计是规划和构建视频游戏空间的实践...... ...通常是第一人称或第三人称动作射击游戏。 这本书对于横向卷轴平台游戏、自上而下的策略游戏或非战斗游戏仍然有用。但无论好坏，大多数关卡设计理论都将 3D 射击游戏作为默认媒介，这可以追溯到射击游戏盛行的 20 世纪 90 年代关卡设计师角色的发明。 有关关卡设计师角色历史的更多信息，请参阅 关卡设计师简史 . Em Schatz 为《神秘海域 4》制作的“岛屿到来”白盒开发截图 功能性关卡设计与环境美术 关卡设计师专注于塑造玩家行为。在大型工作室中，他们经常编写文档、草稿 布局 ， 建造 白盒 ， 观察 试玩测试 ， 和 平衡 地图和 遭遇战 . 相比之下，一个 环境美术家 更注重图形。他们 美术处理 模型、材料、布景和 灯光 完善关卡的视觉外观。虽然这主要是装饰，但良好的环境美术支持体验设计目标并帮助玩家玩耍。 所以理解关卡设计有两种方法： 正式的工业意义 大写-L 大写-D “关卡设计” 没有环境美术 广泛的常识 「关卡设计」 包括环境美术 / 关卡中的任何内容 在本书中我们强调 正规工业 “关卡设计”用于学习目的，但请始终记住，您的玩家会参与其中 广泛的常识 “关卡设计”作为一个整体。 使用来自 Dust 514 的盖伦特研究设施的过程图像比较“关卡设计”与“关卡设计”与“环境美术”的图表 房间设计与世界设计 关卡设计师可以花费几天甚至几周的时间来设计一个房间。 但对于大型大逃杀游戏、开放世界或拥有数百/数千个房间的 MMO 来说，为单个房间而苦恼是不切实际的。一个 世界设计师 考虑 动线 和 寻路 对于社区而不是房屋，生物群落而不是地点，类别而不是实例。这种通用方法可以让玩家和系统呼吸。但如果没有玩家或系统来填补这个空白，最终的世界可能会感觉空虚或乏味。 要构建定向或脚本化的体验，请像建筑师一样关注每个房间。 但对于空间大、玩家重、系统重的游戏来说，世界设计提供了城市规划师的轻松触感。 在《堡垒之夜》的“Pleasant Park”中，每间房屋的单独房间布局都不如社区的整体形状重要 理论与“走地图” 这是一本书，所以显然我们认为阅读是好的。 但与任何其他艺术一样，一本书只能向您介绍这门手艺。在某些时候，你只需要合上书并去构建一些关卡即可。 如果你向《雷神之锤》（ Steam ）社区制图者提出很多问题，按照传统，你会直截了当地回答： “去地图吧。” 这种简短的表达方式可能看起来很粗鲁，但它的意图是培养——就好像在说，“别再拖延了，你会找到答案的；现在就去尝试吧，你已经准备好了。” 成为关卡设计师的唯一方法...就是制作关卡。理想情况下，有很多关卡。 不知道要做什么？请参阅我们的建议列表 项目 . 有时我们说“地图”而不是“关卡”。地图意味着支持多样性的自由形式空间，而关卡则意味着更加脚本化的方向。 但这没什么大不了的。互换使用这些词。 《雷神之锤》1 mod 中启动中心的屏幕截图 奥术维度 ，西蒙“袜子”奥卡拉汉等人 哲学 本书是带着关于关卡设计的具体理想和信念而写的。 清洁理论 大多数The Level Design Book 中文版要么过于学术化和概念化，要么过于商业化和简化。我们的目标是解释和扩展工作关卡设计师使用的相同语言，同时保持足够的批判性以消除懒惰的思维。 关卡设计师通常缺乏讨论形状和体积的语言，并且可以从以下建筑概念中受益匪浅： 体块 。我们引用外部概念而没有意识到更深层次的根源；例如， 主动线 来自主动线方法，工程中的范围界定和依赖性检查工具。当我们的言语和理论不精确时，思考和沟通就会受到影响。 建筑中使用的各种采光策略，作者：Francis Ching，摘自《形式、空间和秩序》 缩小 虽然关卡设计师应该关注玩家行为，但有时我们必须缩小视野并看到大局。 一个关卡是空间设计、艺术、心理学、编程和文化的结合。从玩家的角度来看，关卡设计和环境美术没有区别。任何影响游戏世界的都是关卡设计。 避免简单化的注意事项的诱惑。关卡不仅仅是房间和盒子的集合，也不仅仅是上面散布着岩石和树木的风景。关卡拥有历史、文化和意图，作为负责任的设计师，我们必须考虑整个游戏体验。 仍然来自 Steve Lee 在 GDC 2017 上的“整体关卡设计方法” 保持活力和自由 印刷版的关卡设计书籍往往会在几年内过时。幸运的是，这本书可以在线阅读。在可预见的未来，随着关卡设计的新发展或趋势的出现，我们打算继续更新本书。别死。 这本在线书籍将保持免费和开放访问，直到其服务器关闭 - 即使如此，其内容也可能会通过互联网进行存档。关卡设计社区集体进行了关卡设计，因此它应该继续自由地属于社区。 我们绝不会为这本书付费，也不会出售这本书的任何副本。 未注明出处的书籍文本（以及未注明出处的图像/内容）是 许可的 根据许可的 Creative Commons BY-NC-SA 4.0 许可证。您不能出售这本书，也不能出售任何移植/翻译。 所有副本、翻译和衍生作品必须保持免费和开放获取。 所有未注明来源的文本和图像均 许可的 根据 CC-BY-NC-SA 4.0 如何使用这本书 本书由四个部分组成： 过程 详细介绍了关卡设计的核心概念，对于初学者和需要学习关卡设计工作流程和语言的学生来说是必不可少的。大多数读者应该从这里开始。 文化 从不同角度涵盖了关卡设计趋势，并提供了有关建筑、照明和与关卡设计相关的其他工艺的历史的简短入门知识。 研究 分析和解开特定关卡的工作原理，并附上图表和屏幕截图。 项目 是为学生和爱好者提供的自学教程和项目想法。教师应检查 给教学者的笔记 . 还有一个附录，其中包含 工具 列出推荐的软件和游戏引擎，以及其他关卡设计的链接 资产和资源 （免费模型和贴图，其他The Level Design Book 中文版推荐等）最后强烈建议加入关卡设计 社区 ，因为一本书无法回报你的爱。 由 ustwo Games 制作的 Alba 早期开放世界白盒的编辑截图； 杰西·范·艾尔斯特摄 现在怎么办？ 初学者： 大致了解 过程 ， 尤其 前期制作 , 布局 ， 和 白盒 。然后选择一个 工具 ，加入关卡设计 社区 ， 和 去地图。 有点经验： 阅读特定主题，例如 节奏 , 动线 , 平衡 , 体块 , 标准尺度规范 ， 和 灯光 在大多数在线关卡设计教程中通常会被忽视。 我们也采取强硬立场 反对“引导线” 和 反对形状心理学/色彩心理学 ，认为这些理论要么具有误导性，要么无效，要么对关卡设计师的用途有限。 非常有经验： 看看我们的关键设计 研究 ，甚至可能贡献一些你自己的。"
                  },
                  {
                      "href":  "learning__notes.html",
                      "title":  "🎒 给教学者的笔记",
                      "description":  "给教师在课堂上使用本书的建议",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/notes",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING"
                                      ],
                      "searchText":  "🎒 给教学者的笔记 给教师在课堂上使用本书的建议 本书仍在紧张的创作中。 页面内容可能会发生很大变化/随机完整或不完整。您可能想更多地使用这本书来准备讲座/讨论，而不是分配阅读材料。 教学目标 这本在线书籍旨在作为教学关卡设计的免费高质量资源。 我们尝试使用工作关卡设计师所使用的行业特定术语，但我们总是尝试用简单明了的语言来定义这些概念。当游戏行业术语非常薄弱或不发达时，我们会记下它，并且通常会强调来自建筑或邻近设计领域的更强大的概念。 展示传统的 3D 关卡设计实践是什么样的 在多种背景下从广泛的概念意义上解开“设计”，避免做出大假设的一刀切的技巧，尝试保留一些细微差别 将“发展”视为一种创造性的问题解决过程，需要时间，受益于规划，有起有落 强调功能性的试玩测试关卡而不是美丽的环境美术 观众 我们为高中/本科大学写作 阅读水平，并承担“认真”的长期设计和开发研究。偶尔有脏话和西方文化典故。我们的目标语气是“酷教授”。对于青少年/夏令营的形式来说，这可能太多了。 工具 请注意，本书强调理论和过程。 作为讲师，您必须为学生提供技术指导。 我们对最好的有意见 工具 教学： 教导 关卡设计作为一个行业专业 , 然后使用 雷神之锤（ Steam ） 或 《毁灭战士》（ Steam ） . 学生不必重新发明玩家控制器、战斗、人工智能、图形等。 《雷神之锤》和《毁灭战士》迫使人们将注意力集中在遭遇战设计上，并放弃环境美术，这是当今学生最常见的弱点 《雷神之锤》 和 《毁灭战士》 社区维护可靠的免费开源 MacOS 兼容工具 如果您想修改更新的内容，请参阅 工具 页面 教导 关卡设计工作流程 作为通才游戏开发教育的一部分，那么你可能可以通过 统一/虚幻/戈多 . 现代游戏引擎比复古射击引擎更加用户友好 非常适合那些不打算成为 AAA 战斗设计师的学生 步行模拟风格的项目是一个可行的周末介绍一般 3D 世界建设；有关研讨会形式的示例，请参阅 KO-OP “如何在 Unity 中制作很酷的东西” 但学生必须制作自己的机制原型，这可能会为实际关卡设计留下很少的时间 如何用这本书进行教学 过程 每个 过程 一页应该足够每周一次 60 分钟的讲座和讨论。 将每个讲座与“让我们玩”小组配对/作为一个班级一起玩游戏，将讲座概念应用到实际关卡。 为期 15 周的关卡设计课程的示例分解，重点是完成一个长期项目： 前期制作 ：1周 。强调设定体验设计目标/阐明设计约束。 像这样的概念 节奏 和 研究 在学生先完成几个项目之前，通常会觉得太抽象。在最终项目完成之前，不要分配太多的计划任务。 布局 ：2周 。没有人能够在没有练习的情况下可视化平面图中的流程，视觉传达显然是一项需要随着时间的推移而发展的技能。但布局仍然是关卡设计思维和实践的关键部分。因此，对于一个大型的期末项目，至少要花两周时间对布局进行至少两次迭代，并让学生练习向同学展示他们的布局。 白盒 / 脚本编写 ：5周以上。 学习如何使用 3D 工具至少需要 2 周甚至更长的时间。花费 1 周以上的时间进行 3D 建模和构建常见形状，例如坡道、楼梯、门口。 每两周上一堂课 试玩测试 同时也连接回关键的理论概念。 对于中期项目来说，经过 2-3 次试玩测试迭代的可靠白盒是一个很好的目标。 在前两周专注于 3D 构建之后，逐渐让非程序员轻松进入可视化脚本编写。花三周的时间教授触发器/收藏品、可交互按钮，然后 门 . 制作：5周以上 。我们通常会在学期的后半段完成期中白盒，以达到更高的完成度。这个重点将取决于您的班级/学生的重点： 对于 AAA 设计重点，进行更多试玩测试并 遭遇战设计 对于技术受众，请做更多 脚本编写 和 优化 对于通才和/或艺术家较多的群体，请更多地谈论 环境美术 和 灯光 演示和演示：1-2 周。 许多学生讨厌演讲，但它设定了对工作场所运作方式的期望：与同事和主管的会议。 这也是一个好时机 反思性实践 -- 学生应该记录并比较每次迭代，从布局到草图再到美术处理。 文化/研究 文化 文章提供了有用的背景和历史背景。 研究 在阅读和讨论本书中介绍的设计分析之前，最好有小组现场表演和/或学生演奏相关的实际关卡。 这两个部分是相辅相成的。一般青少年在出生前玩的游戏很少。但你不能完全理解 关卡设计师的历史 没有玩过《毁灭战士》、《雷神之锤》、《半条命》或《虚幻竞技场》。 工业级设计理论课程可以挑战学生展示他们自己的关键现场研究。学术研究写作课程可以要求学生撰写自己的设计历史。步行模拟器、炸药桶或电子游戏中的树木的历史是什么？ （例如： 斯蒂芬·墨菲的《电子游戏中的青蛙》。 ) 课堂活动 这 项目 部分有现成的项目想法和课堂实验室活动供您使用。每个作业中都内置了讨论和评估阶段，以及每个阶段的建议时间长度。 在黑板上展示说明或提供纸质打印输出。 如果您只是将学生链接到该网站上的项目页面，那么他们可能会分心或丢失浏览器选项卡。 如何进行批评 学生对他们的项目进行简短的非正式演示，总结意图和方法 导师+同学给出反应和反馈 “批评”可以是建设性的、有启发性的，也可以是羞辱性的、毫无意义的。教师必须塑造好的批评的样子——具体且开放，提出问题而不是残酷的意见。在任何批评会议之前，与学生讨论什么可以提供有用的反馈： 描述具体的核心优势 无用的反馈： “这个关卡看起来很有趣。” 更有帮助： “这个关卡关于拆除学生贷款办公室的幻想真的很吸引我。” 描述削弱这些核心优势的具体问题 无益： “关卡感觉很糟糕，很糟糕，这不太有趣。” 更有帮助： “该关卡是关于取消所有学生贷款债务，但我无法理解债务取消何时或如何发生。该关卡的哪些部分显示债务被销毁？我错过了那些部分吗？......” 使用第一人称“i statements”，参考你的具体反应和游戏过程 无益： “没有人会知道该关卡的走向。” 更有帮助： \" 我 不知道该去哪里的水平... 我 我以为债务怪物会在地下室，但我却在首席执行官的浴室里发现了它......”（为什么？） 避免使用第二人称“你的陈述”，避免指责/攻击 无益： “你制作了一个令人困惑的关卡，相反你应该做（这个）和（那个）。” 更有帮助： “这个关卡让我感到困惑。也许它可以做（这个）或（那个）。” 普拉特建筑研究生院的课堂海报示例， 照片由 Sarah Le Clerc 拍摄，经 CC-BY-ND 许可 海报女郎 在建筑教育中， 海报女郎 是一种批评，学生将他们的建筑图纸钉在墙上，“批评家”（教师、客人、学生）与设计师讨论他们的推理。 每周快速海报设计练习示例： 提示主题、设计限制或流派 （例如：“越狱”） 单独绘制简单的小地图 布局 纸上（5-15 分钟） 较短的时间阻碍了详细的绘图和过于复杂的概念 4人一组，画海报并展示，每组之后有3-5分钟的讨论 最好的情况是，海报能让学生对改进他们的设计更加兴奋 教学关卡设计的一般建议 本书是由实践关卡设计师和学者撰写的，因此我们对关卡设计教学的“最佳实践”有一些建议。 焦点 您将教授什么类型的关卡设计？大多数关卡设计课程必须重点关注作为通用架构方法的视觉空间规划方面，或者关注通过频繁的试玩测试和迭代来设计挑战和谜题。 对于通才调查课程，将课程分为不同的“单元”，每个月都专注于特定方法。然后，对于最终项目，允许学生专注于他们喜欢的任何单元，自己或小组更深入地探索这些主题。 通讯 设计可以发生在白板、纸上、对话或演示中。在大型商业工作室中，首席游戏设计师通常很少使用编辑器工具进行实际操作。 在游戏教育和 STEM 相关项目中，学生经常忽视他们尚未发展的“软”技能和基础知识。但如果不能沟通，就不可能成为一名优秀的设计师。当学生忽视软技能时，他们的职业生涯一旦要与人交谈就会崩溃。 过程 计划很少能完好无损地保存下来。问同学，你认为你的关卡符合你的设计目标吗？有更好的方法来实现这一点吗？您想调整您的设计目标吗？在下一个项目中你会采取什么不同的做法？强调开发是一个持续的过程，错误和问题肯定会发生。 共享工具 让每个学生使用相同的工具 起初， 在让他们选择分支之前。 关卡设计的大部分内容都需要开发一种共享的设计语言，如果你将学生的参考点分散化，他们将更难以绘制这些联系和比较。 共享社交 使用内部课堂社交媒体渠道分享工作和进展。如果您有 Slack 或 Discord 课程，请创建一个名为“#screenshots”的频道，并要求学生每周提交屏幕截图作为作业的一部分。学生需要看到彼此的作品，以便互相学习。 职业机会 一些学生寻求未来的关卡设计职业。然而，游戏行业通常对 3A 级 3D 动作游戏的初级设计师需求较低。相反，鼓励学生追随较小的工作室和独立团队，这些团队可能不会享有盛誉，但仍能提供指导和成长。 进一步阅读 “重新定位关卡设计教育”（2020），作者：Alexander Muscat，皇家墨尔本理工大学 。简短地谈谈关卡设计教学中的核心问题，以及马斯喀特为游戏设计大学课程中的典型学生（对游戏引擎和关卡设计拥有不同经验和兴趣的通才设计师兼开发人员）设计关卡设计课程的方法。 关卡设计相关书籍推荐列表 ."
                  },
                  {
                      "href":  "learning__projects.html",
                      "title":  "项目计划",
                      "description":  "在此页面上，我们列出了各种关卡设计项目计划/作业。这些对于教师计划课程很有用，而且对于任何想要自己学习和练习关卡设计的人也很有用。",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING"
                                      ],
                      "searchText":  "项目计划 在此页面上，我们列出了各种关卡设计项目计划/作业。这些对于教师计划课程很有用，而且对于任何想要自己学习和练习关卡设计的人也很有用。 目前，我们的重点是完成 第 1 册，过程 。所以这一部分有点被忽视了。 然而，我们确实有一些即将完成的项目计划，可以让您了解我们的目标： 经典战斗 ，制作（并思考）《毁灭战士》（ Steam ）/《雷神之锤》（ Steam ）关卡设计以及经典的街机风格射击游戏战斗。"
                  },
                  {
                      "href":  "learning__projects__classic-combat.html",
                      "title":  "经典战斗",
                      "description":  "经典复古射击游戏的设计练习",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects/classic-combat",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING",
                                          "项目计划"
                                      ],
                      "searchText":  "经典战斗 经典复古射击游戏的设计练习 简介 在此项目中，您将为快节奏街机风格复古第一人称射击游戏的战斗竞技场进行研究、推介和原型设计。 《毁灭战士》（ Steam ）和《雷神之锤》（ Steam ）等经典 FPS 游戏强调通过简单的 AI 模式不断移动来对抗成群的敌人，并严重影响了当今当代动作射击游戏的设计。此设计练习更注重您的设计思维和沟通技巧，而不是构建或生产技能。 在继续之前，请确保您已阅读 节奏 , 平衡 ， 和 遭遇战 . 教育工作者：如果您在课堂上分配此设计练习，我们强烈建议为每个人分配相同的游戏 - 《毁灭战士》或《雷神之锤》。 《雷神之锤 1》中的遭遇战设计，来自 Andrew Yoder 的“战斗设计之门问题”(https://andrewyoderdesign.blog/2019/08/04/the-door-problem-of-combat-design/) 1. 研究 玩《毁灭战士 1》、《毁灭战士 2》或《雷神之锤 1》中的几个关卡（60 分钟） 如果您是第一人称射击游戏的新手或通常不喜欢这些游戏， 选择《毁灭战士》或《毁灭战士 2》。 请按照本指南让 《毁灭战士》 正常运行 . 如果您对射击游戏设计的核心技术细节感兴趣， 然后学习雷神之锤。 请按照本指南让 《雷神之锤》 正常工作 。我们推荐使用 《雷神之锤》Spasm 源端口，并且不使用图形模组。 您最近可能没有玩过这些游戏（如果有的话）。无论好坏，这些都是标志性的关键游戏，永远深刻地影响了游戏行业。您也许应该了解原因。 出于本练习的目的，您需要玩至少 5-10 个关卡，以便您能够识别大多数武器和怪物，这可能需要至少一个小时。玩够了，你就可以谈论它，使用作弊或玩简单模式都可以——我们来这里是为了研究设计，而不是为了证明玩家的技能。 要在 《毁灭战士》 中激活刀枪不入，请输入 IDDQD . 要在 《雷神之锤》 中激活上帝模式，请使用以下命令打开控制台 ~（波形符） ，输入 上帝 ，然后按 输入 . 了解战斗的最好方法就是玩游戏！...《毁灭战士》(1993) 的屏幕截图 阅读战斗设计批评（30 分钟） 正如学者所说，《毁灭战士》和《雷神之锤》都已经“得到了很好的理论化”。在过去的几十年里，有很多关于这两款游戏的设计分析和批评。作为一名游戏设计师意味着与这些遗产进行互动并加入对话。 如果你玩过《毁灭战士》或《毁灭战士 2》， 读短文 《腔棘鱼：末日的教训》 作者：JP LeBreton，生化奇兵和 Psychonauts 2（ Steam ） 的行业级设计师。 然后反思这些问题： LeBreton 引用了一款 1982 年的街机游戏 Robotron 2084。它真的和《毁灭战士》那么相似吗？您可以自己决定并 在 Archive.org 上的浏览器中免费玩 Robotron （单击按钮启动模拟器，当看到“恢复出厂设置”屏幕时按 F2）。 当你玩了《Robotron》至少 15 分钟后，将其与《毁灭战士》进行比较。控件相似吗？武器、敌人，当然还有关卡设计又如何呢？ 勒布雷顿认为《毁灭战士》的“武器设计是强烈正交的”。你认为他这话是什么意思？举一个不同游戏中正交性的例子。 为什么这篇文章的标题是“腔棘鱼”？ （谷歌一下。）根据 LeBreton 的说法，现代 FPS 游戏有什么作用，他对它们有何看法？你同意还是不同意，为什么或者不同意？ 如果你玩过《雷神之锤》， 读 《雷神之锤》 mod“Copper”的变更日志 作者：Matthew Breit，《雷神之锤》 4、Titanfall 和 The Beginner\u0027s Guide 的行业级设计师。 然后反思这些问题： 解释布雷特对食人魔手榴弹瞄准公式的调整，并总结为什么他认为这是必要的。玩家反对这种新行为的可能理由是什么？ 谷歌《雷神之锤》中玩家护甲的工作原理。装甲伤害减轻公式是什么？布莱特对此有何批评和修正？你同意？ Breit 的 Copper 设计支柱是什么？ Breit 的 mod 和这篇变更日志帖子的受众是谁？这些受众与当今的现代 FPS 受众有何不同？ 自定义 《雷神之锤》1 关卡、Underdark Overbright 地图 1“太空大灌篮”（Matthew Breit）的屏幕截图 一般研究问题（15 分钟） 在您玩过《毁灭战士》或《雷神之锤》的关卡中，您最喜欢哪一个，为什么？ 描述一种对一种怪物类型有效但对另一种怪物类型无效的武器和玩家策略。为什么？ 识别在同一个房间里战斗的两种不同的怪物，以及两种似乎不能很好地协同工作的怪物类型。 布赖特指出 “《雷神之锤》 的游戏代码（或者就这点而言，《毁灭战士》 的游戏代码）中几乎没有什么东西会随着[难度]关卡而改变。” 你认为这是为什么？ 《毁灭战士》和《雷神之锤》都有一个称为“内斗”的辅助机制，其中一个怪物可能会意外攻击另一个怪物，导致它们互相争斗。哪种怪物类型似乎最适合引起内斗？ 《毁灭战士 1》和《毁灭战士 2》中的怪物；你认识他们吗？如果没有，用它们进行设计将会很困难 2. 布局 好的，是时候进行一些关卡设计了。你的任务是 设计一个 一间房间的竞技场 对于《毁灭战士》或《雷神之锤》。 它必须包括： 2-3种怪物 1-2种武器 游戏时长 1-2 分钟 绘制布局草图（10-20 分钟） 绘制 10+ 张小型 设计概念草图 缩略图。（1-2 分钟） 概念化竞技场背后的 核心想法 。不要想太多，只要画出任何可能象征关卡如何发挥的形状即可。你想进行什么类型的战斗？会有哪些武器和怪物？ 然后画出3+可能的草图 布局 对于一间房间的竞技场。 （每人 5 分钟） 出于本练习的目的，请勿尝试构建一个巨大的复杂关卡。相反，专注于让一个房间足够有趣。 然后，选择你最喜欢的布局，并重新考虑。 （5-10 分钟） 保持你的布局宽松，不要试图太快地锁定它。至少做出一项重大改变。如果你使用不同的怪物类型怎么办？如果用圆柱形房间代替四方形房间会怎么样？ 这张图应该有更多的细节，你绝对应该给它贴上标签并解释更多你的概念。它应该回答以下基本问题： 写1 玩家体验目标 为了相遇。你的遭遇战会强调什么样的战斗或战术？什么将鼓励充分利用作战空间？ 是否有任何带有生命值或弹药拾取的面包屑痕迹可以帮助激励玩家在竞技场中移动？ 您会使用任何上锁的门或钥匙来控制玩家的进度吗？ 标记核心元素，例如玩家和敌人的生成、物品、危险等，并突出显示主动线。 （TODO：展示一些单间竞技场遭遇战草图样本） 介绍您的遭遇战（10 分钟） 向其他人推销你的设计，让他们根据 (a) 体验目标、(b) 支持的游戏风格和 (c) 计划的清晰度，使用下面的标题来判断你的设计。例如。他们可能会说你的体验目标令人难忘，但并不真正支持任何明确的路径或策略，而且还有太多问题没有得到解答。 在你的演讲中，确保你以不同的方式叙述战斗遭遇战可能如何进行，同时总结你的意图和玩家体验。祝你好运！ 遭遇战音调评估标准 评价 体验目标 支持的游戏风格 计划清晰 😄 令人难忘、有凝聚力 多种稳健策略 可以想象这一切 🙂 典型、可预测 一条带有旁路的理想路径 需要澄清细节 😕 混乱、不兼容 没有明确的路径或策略 问题太多 3.白盒 尝试在实际游戏中实施您的设计计划。 查看标准尺度规范（10 分钟） 在开始白盒之前，请确保您了解 标准尺度规范（metrics） 为了比赛。为了您的方便，我们收集了 《毁灭战士》 和 《雷神之锤》 的基础尺度规范： 《毁灭战士》 的基础尺度规范 《雷神之锤》 的基础尺度规范 规划你的竞技场战斗（1-4 小时） 现在是时候打开关卡编辑器了，并且 白盒 一个简单的单间竞技场，里面有怪物和武器。 如果您不熟悉关卡设计和构建，我们建议您从 《毁灭战士》 开始，因为该编辑器使用更简单的 2D 界面。 如果您想使用更复杂的东西来学习，您可以尝试为 《雷神之锤》 构建全 3D。 请参阅 工具 页面上有 《毁灭战士》 和 《雷神之锤》资源的链接。 您不必完全遵循布局阶段的计划，而是在进行设计时使用草图作为一般指南 白盒 和 迭代 。当你进行试玩测试时，你可能会意识到你的计划并没有按照你想象的方式进行，你必须改变你的计划——没关系，这就是关卡设计的意义所在。 记住最初的概要并保持简短，特别是如果这是您的第一个关卡。竞技场的宽度不要超过 1024 个单位，并且花费的时间不要超过几个小时。 白盒阶段的目的是测试尺度规范和玩法。使用原型纹理，不要在装饰或照明上浪费时间。 《毁灭战士》和《雷神之锤》的设计技巧 怪物并没有真正的寻路能力，所以要保持区域稍微开放，以便给它们足够的空间来徘徊。您的走廊（如果有）宽度应超过 128 个单位。 要将怪物限制在某个区域，请在地板上建立高度差。通过将远程攻击的怪物（《末日》中的小恶魔、《雷神之锤》中的执法者和食人魔）放置在一个太高而无法下降的升高平台上，“束缚”它们非常有用。 试玩测试并获取反馈（1 小时） 首先，亲自测试关卡。你能完成自己的关卡吗？如果你不能，那么对于普通玩家来说可能太难了。 当关卡通过你的个人试玩测试后，继续 与至少 3 个不同的人进行试玩测试。 有关如何查找试玩测试人员或运行试玩测试会话的信息，请参阅 试玩测试 . 当您运行试玩测试时，问问自己： 在没有任何指导或干预的情况下，普通玩家可以完成你的关卡吗？ 每个玩家死亡并重新开始多少次？零死亡可能意味着它太简单，几次死亡意味着竞技场具有适当的挑战性，而 10 次以上死亡可能意味着它太困难，大多数玩家可能会放弃。 我们的目标是 1-2 分钟的游戏时间。如果战斗总是在一分钟或更短的时间内结束，那就太快了。如果战斗通常需要 5 分钟或更长时间，那就太多了。 迭代并进行更改（1 小时） 试玩测试的重点是根据反馈进行迭代和更改。如果您对测试会话没有采取任何措施，那么可以说您没有在进行设计。总是有可能改进某些东西。 至少对关卡几何形状进行一处更改。 重建一个房间，添加一个额外的平台，延伸一条走廊，开辟一个新的门口。没有一个关卡是完美的。 至少对怪物或物品的放置进行一处更改。 如果你尝试不同的怪物类型怎么办？如果您更改了关卡几何形状，这个新地板/墙壁/房间是否可以容纳新怪物？如果你为玩家提供一种不同的武器来对抗该怪物会怎么样？ 添加一个秘密， 例如隐藏的武器或物品。它可以藏在角落里，也可以放在看起来像墙的暗门后面。发现什么会让人感到满足？什么样的秘密会让关卡中的其他人感觉公平且合适？ 4.反思 恭喜，您刚刚构建了一个经典的第一人称射击游戏关卡！您遵循了之前无数关卡设计师和模组制作者的传统。 反思矩阵 花一些时间反思您的经历。您喜欢设计过程的哪些部分？这将如何影响你未来的创作过程？ 感觉 调研 布局+间距 白盒 试玩测试 😄 研究非常有用且相关。 我喜欢讨论计划。 我喜欢建造一个空间并在其中行走。 我喜欢看到别人玩我的作品。 🙂 我想研究还可以，我明白这一点。 沟通很有帮助。 建造一个空间还可以，但是工作量很大。 进行一些试玩测试很有用。一点。 😕 我不喜欢做研究，而且没有目的。 我宁愿不与任何人分享我的计划。 建造既无聊又耗时。 试玩测试让我感到焦虑和害怕。 现在怎么办？ 重复这个项目，制作另一个《末日》或《雷神之锤》关卡。 尝试其他一些 项目 . 阅读有关 遭遇战设计史 ."
                  },
                  {
                      "href":  "learning__projects__unfinished-wip-pages.html",
                      "title":  "未完成 WIP 页面",
                      "description":  "",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects/unfinished-wip-pages",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING",
                                          "项目计划"
                                      ],
                      "searchText":  "未完成 WIP 页面 第 4 册，学习 项目计划 未完成 WIP 页面 现代战斗 现代潜行 练习：直射光 练习：2D 白板图 关卡设计作品集 设计测试：改编 练习：布局 练习：纵向/垂直空间 上一页 经典战斗 下一步 现代战斗"
                  },
                  {
                      "href":  "learning__projects__unfinished-wip-pages__adaptation.html",
                      "title":  "设计测试：改编",
                      "description":  "对于此设计测试，您将把现实世界的建筑物或位置调整为单玩家关卡。",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects/unfinished-wip-pages/adaptation",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING",
                                          "项目计划",
                                          "未完成 WIP 页面"
                                      ],
                      "searchText":  "设计测试：改编 对于此设计测试，您将把现实世界的建筑物或位置调整为单玩家关卡。 重点关注这些设计考虑因素： 类型学：现实世界网站的主要结构模式是什么，如何简化这种逻辑，同时仍然保持很强的相似性？ 体块：哪些部分感觉轻或重、薄或厚、坚固或精致，以及我们如何将这些品质提炼到 3D 游戏中？ 玩法：什么类型的机制、遭遇战、谜题和场景最适合这种类型的地方？ 范围：我们应该适应多少位置，完整的外部和部分内部，还是反之亦然？"
                  },
                  {
                      "href":  "learning__projects__unfinished-wip-pages__exercise-direct-lighting.html",
                      "title":  "练习：直射光",
                      "description":  "要培养照明技能，请从尽可能简单的开始：忽略游戏引擎或渲染器的所有奇特照明功能，而是手动手动放置每个光源，包括任何反射光或补光灯。这是一种劳动密集型的“老式”照明 3D 空间方式，但它是一个有用的练习，可以迫使您思考灯光的作用。这个工作流程也比您想象的更相关； 《辐射 4》等相对较新的游戏没有预先计算的光照烘焙。",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects/unfinished-wip-pages/exercise-direct-lighting",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING",
                                          "项目计划",
                                          "未完成 WIP 页面"
                                      ],
                      "searchText":  "练习：直射光 要培养照明技能，请从尽可能简单的开始：忽略游戏引擎或渲染器的所有奇特照明功能，而是手动手动放置每个光源，包括任何反射光或补光灯。这是一种劳动密集型的“老式”照明 3D 空间方式，但它是一个有用的练习，可以迫使您思考灯光的作用。这个工作流程也比您想象的更相关； 《辐射 4》等相对较新的游戏没有预先计算的光照烘焙。 使用实时直接光和手动放置的间接照明照亮一个简单的遮光房间。 如果这是您第一次考虑照明，请使用灰度纹理对遮挡进行纹理化，并使用去饱和灰度照明。 如果您想要更多挑战，请使用彩色原型纹理和彩色灯光。 禁用预先计算的灯光烘焙，仅使用实时灯光，请参阅灯光页面以了解如何设置补光灯"
                  },
                  {
                      "href":  "learning__projects__unfinished-wip-pages__exercise-floorplan.html",
                      "title":  "练习：布局",
                      "description":  "这是绘制简单关卡布局的设计练习。",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects/unfinished-wip-pages/exercise-floorplan",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING",
                                          "项目计划",
                                          "未完成 WIP 页面"
                                      ],
                      "searchText":  "练习：布局 简介 这是绘制简单关卡布局的设计练习。 设计简介...关于开门和离开的 5 分钟单人游戏关卡，包括好的布局和糟糕的布局 规划 超越简短 定义体验目标 绘制关卡的主要节拍 调研 其他关卡做类似的事情吗？ 练习查看布局图...为什么他们要那样画？它传达什么信息？ 布局 设计概念草图 气泡图 布局"
                  },
                  {
                      "href":  "learning__projects__unfinished-wip-pages__exercise-whiteboard-2d.html",
                      "title":  "练习：2D 白板图",
                      "description":  "阅读 David Sirlin 关于《Donkey Kong Country》的收藏品文章",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects/unfinished-wip-pages/exercise-whiteboard-2d",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING",
                                          "项目计划",
                                          "未完成 WIP 页面"
                                      ],
                      "searchText":  "练习：2D 白板图 阅读 David Sirlin 关于《Donkey Kong Country》的收藏品文章 使用收藏品绘制 2D 平台游戏布局 对于特定的重点场景段落，标记玩家屏幕的轮廓；玩家能准确看到什么 展示并讨论该计划"
                  },
                  {
                      "href":  "learning__projects__unfinished-wip-pages__level-design-portfolio.html",
                      "title":  "关卡设计作品集",
                      "description":  "如果您负担得起，请注册自己的域名",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects/unfinished-wip-pages/level-design-portfolio",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING",
                                          "项目计划",
                                          "未完成 WIP 页面"
                                      ],
                      "searchText":  "关卡设计作品集 完成项目类别中的一些项目 寻找虚拟主机 如果您负担得起，请注册自己的域名 不要使用 wix...免费的 wordpress 可能更好 如果您的作品集以视觉为导向，只需制作一个艺术站 展平网页模板 说出你在顶部的位置 删除网页模板中的所有垃圾，删除除主页之外的所有内容 创建项目页面 不要写太多 包括 3-5 个屏幕截图和一个短视频，以及外部网站和评论的链接 在手机上测试 想象一下您是一位无聊的经理，正在浏览电子邮件 （可选）获取 Twitter，每周至少使用一次 表明您正在关注行业讨论和行业数据 帮助你假装你认识人，帮助你记住名字 上传简历 最多 1 页，文字越少越好 包括您的姓名、作品集 URL 和所需的开发角色 不要写你的 GPA 或你的辅修专业，但列出任何重大奖项、助学金、奖学金 不要填充你的“技能和兴趣”部分，想象一下读了 40 个这样的内容，它看起来就不那么可爱了 省略您的家庭住址或电话号码，您将把它放到互联网上 包括 PDF，以防他们想要保存和下载等 你的简历有两个功能：(1) 列出你的工作经验和资格，(2) 向面试官提供要问你的问题……不要让他们感到厌烦 定期更新你的投资组合 每个项目之后/申请之前 示例关卡设计作品集 安东尼·帕内卡西奥： https://www.panecasio.com/ 马格纳·詹森： http://magnarj.net/"
                  },
                  {
                      "href":  "learning__projects__unfinished-wip-pages__modern-combat.html",
                      "title":  "现代战斗",
                      "description":  "现代商业动作射击游戏的设计练习",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects/unfinished-wip-pages/modern-combat",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING",
                                          "项目计划",
                                          "未完成 WIP 页面"
                                      ],
                      "searchText":  "现代战斗 现代商业动作射击游戏的设计练习 简介 在这个项目中，您将为现代商业动作射击游戏的战斗遭遇战进行研究、推介和原型设计，其中包括动态的小队编队和战线。 在继续之前，请确保您已阅读 节奏 , 平衡 ， 和 遭遇战 。 我们还建议您执行以下操作 经典战斗 首先设计练习。 图表来自 Michael Barclay、Sam Howels、Pete Ellis 的“Creating Conflict：AAA 动作游戏的战斗设计”（GDC Europe 2016） 1. 研究 回顾《神秘海域 4》中的战斗（10-60 分钟） 理想情况下，您已经玩过《神秘海域》游戏或某种掩护射击动作游戏。 如果您从未玩过这些游戏中的任何一款，那么您应该在继续之前先玩一款。 至少，玩过教程关卡并完成几场枪战，这可能至少需要一个小时。 如果您熟悉该类型，请花一些时间回顾一下游戏的玩法。 搜索 《神秘海域4战斗玩法》 在 YouTube 上观看至少 10 分钟的比赛片段。 观看视频时，思考以下问题： 《神秘海域 4》中的大多数战斗是如何开始的？玩家如何知道战斗何时开始？玩家如何知道敌人在哪里？ 战斗要持续多久？感觉像是一场小战斗还是一场大战斗，为什么？ 战斗中有什么“节奏”吗？节奏和战斗故事是什么？ 战斗遭遇战如何结束？玩家如何知道游戏何时结束？玩家最后感觉如何？为什么？玩家如何知道下一个活动是什么？ 观看这位开发人员谈论《神秘海域 4》的战斗 AI（60 分钟） 接下来，观看 GDC 2017 演讲 “原创与系统：在《神秘海域 4》中寻找战斗 AI 的平衡”作者：Matthew Gallant 关于《神秘海域 4》的战斗 AI 和遭遇战设计工具。随意记笔记，并参考 PDF 幻灯片 供参考。 每个游戏对战斗 AI 的管理方式都不同，但《神秘海域 4》的核心方法与其他动作游戏和掩护射击游戏非常相似，代表了当前的行业实践。遭遇战设计师或战斗设计师必须了解游戏系统和人工智能工具。 研究问题（15 分钟） 分析 《神秘海域 1-3》中使用的“区域”方法的优点和局限性。 Gallant 的团队为《神秘海域 4》制作了几个新系统的原型，但最终没有使用它们。 分析 这些失败方法之一的优点和局限性。 Gallant 在设计《神秘海域 4》的三 (3) 个主要战斗角色时受到了吃豆人幽灵 AI 的启发。这些角色你还记得吗？ 您能回忆起任何具有有趣敌人设计的较早经典游戏（2000 年之前）吗？你如何将这种设计应用到像《神秘海域》这样的当代动作射击游戏中？ 设计 《神秘海域 4》的第四个战斗角色；这种敌人类型会做什么，其行为/能力与其他三种类型有何区别？ 可以应用于许多其他格斗游戏的主要要点是什么？ “遭遇战协调员”幻灯片来自 Matthew Gallant 的“Authored vs Systemic：Finding a Balance for Combat AI in 《神秘海域》 4” 2. 布局 现在是时候设计你自己的动态战斗遭遇战了。 描绘一场遭遇战（20 分钟） 在 1-2 分钟内绘制 10+ 张 设计概念草图 缩略图。不要想太多，只要画出任何可能象征这场遭遇战将如何展开的形状即可。 然后，画一个草图 布局 类似《神秘海域》的动作游戏中的一场小型战斗。但不要尝试绘制像《神秘海域 4》中那样庞大而复杂的草图！清晰比野心更重要。保持较小。玩家的遭遇战应该持续 2-3 分钟。 定义1 玩家体验目标 为了相遇。你的遭遇战会强调什么样的战斗或战术？ 设计至少 1 重点场景段落 并且至少 2 节奏 节拍。 标记核心元素，例如玩家和敌人的生成、物品、掩体和关键元素 视线 ，以及硬点/区域。 （TODO：展示一些遭遇战草图示例） 介绍您的遭遇战（5 分钟） 向其他人推销您的设计，并让他们使用下面的标题来判断您的设计。例如。他们可能会说你的体验目标令人难忘，但并不真正支持任何明确的路径或策略，而且还有太多问题没有得到解答。 在你的演讲中，确保你以不同的方式叙述战斗遭遇战可能如何进行，同时总结你的意图和玩家体验。祝你好运！ 遭遇战音调评估标准 评价 体验目标 支持的游戏风格 计划清晰 😄 令人难忘、有凝聚力 多种稳健策略 可以想象这一切 🙂 典型、可预测 一条带有旁路的理想路径 需要澄清细节 😕 混乱、不兼容 没有明确的路径或策略 问题太多 3.白盒 尝试在实际游戏中实施您的设计计划。 玩一场战斗游戏（2小时） 玩一个 可模组游戏 ，理想情况下是具有“半动态”或“动态”战斗设置的游戏。 TODO：确定一个可以真正支持此练习的游戏...哈哈 注意游戏的玩法/游戏如何设置战斗遭遇战。 不同的敌人类型和角色是什么？ 原型化您在游戏中的遭遇战（xx 小时） 打开关卡编辑器并构建一个具有动态战斗遭遇战的关卡。 您不必完全遵循布局阶段的计划，而是在草图和原型设计时使用草图作为一般指南。 测试你的遭遇战/与他人分享"
                  },
                  {
                      "href":  "learning__projects__unfinished-wip-pages__modern-stealth.html",
                      "title":  "现代潜行",
                      "description":  "具有掩护和战斗功能的现代潜行游戏的设计练习",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects/unfinished-wip-pages/modern-stealth",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING",
                                          "项目计划",
                                          "未完成 WIP 页面"
                                      ],
                      "searchText":  "现代潜行 具有掩护和战斗功能的现代潜行游戏的设计练习 简介 在这个项目中，您将为现代商业隐形动作游戏的战斗遭遇战进行研究、推介和原型设计，其中包括掩体系统和战斗后备。 在继续之前，请确保您已阅读 节奏 , 平衡 ， 和 遭遇战 。 我们还建议您执行以下操作 经典战斗 首先设计练习。 1. 研究 在《细胞分裂：黑名单》中回顾潜行（10-60 分钟） 理想情况下，您已经玩过最近的潜行动作游戏。 如果您从未玩过这些游戏中的任何一款，那么您应该在继续之前先玩一款。 至少，要通过教程关卡和第一个任务，这可能至少需要一个小时。 如果您已经熟悉该类型，请花一些时间回顾一下游戏的玩法。 搜索 《细胞分裂黑名单玩法》 在 YouTube 上观看至少 10 分钟的比赛片段。 观看视频时，思考以下问题： 黑名单中的大多数潜行遭遇战是如何开始的？玩家如何追踪敌人的动向？ 隐形遭遇战会持续多久？感觉像是小偷偷还是大偷偷，为什么？ 隐形遭遇战有什么“节奏”吗？节奏和幻想是什么？ 隐秘遭遇战如何结束？玩家如何知道游戏何时结束？玩家最后感觉如何？为什么？玩家如何知道下一个活动是什么？ 观看该开发人员谈论《细胞分裂：黑名单》的 AI（30 分钟） 接下来，观看 GDC 2014 演讲 “在《细胞分裂：黑名单》中模拟人工智能感知和意识”作者：Martin Walsh 关于《细胞分裂》的隐形人工智能和遭遇战设计工具。随意记笔记，并参考 PDF 幻灯片 供参考。 每个游戏对潜行人工智能的管理方式都不同，但《细胞分裂》的核心方法与其他潜行动作游戏非常相似，代表了当前的行业实践。遭遇战设计师必须了解游戏系统和人工智能工具。 研究问题（15 分钟） 对比 战斗人工智能设计与隐形人工智能设计。 “好的”隐形人工智能的目的是什么？它应该推动什么类型的体验？它跟踪什么信息，以及向玩家广播什么信息？ 沃尔什可以互换使用“感知”和“意识”。为什么？这两个概念之间有什么区别（如果有的话）？"
                  },
                  {
                      "href":  "learning__projects__unfinished-wip-pages__verticality.html",
                      "title":  "练习：纵向/垂直空间",
                      "description":  "垂直体块、高度、“z 层”、楼层",
                      "originalUrl":  "https://book.leveldesignbook.com/learning/projects/unfinished-wip-pages/verticality",
                      "breadcrumbs":  [
                                          "BOOK 4, LEARNING",
                                          "项目计划",
                                          "未完成 WIP 页面"
                                      ],
                      "searchText":  "练习：纵向/垂直空间 垂直体块、高度、“z 层”、楼层 当然，用自上而下的布局图很难在垂直维度上进行规划。这就是为什么建筑师绘制立面图和剖面图来描绘建筑物的垂直轮廓。但对于关卡设计规划来说，细节太多了。想得更抽象一些。 （垂直布局） 将您的区域分组为主要地平面/高程，并像高度图一样对其进行着色：较暗的区域较低，而较亮的区域较高。 忽略任何微小的高度变化或浅地形倾斜。 为坡道、楼梯以及任何引道或平台预留足够的空间。 如果您的地图由重叠的楼层组成，请分别绘制楼层并标记楼层之间的过渡。但对于底层不重要的结构，比如瞭望塔，那么你可以简单地忽略它。绘制最能传达关卡核心思想的内容。"
                  },
                  {
                      "href":  "process__blockout.html",
                      "title":  "🏠 白盒",
                      "description":  "如何通过体块、标准尺度规范、寻路和试玩测试构建基本 3D 版本的关卡。",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS"
                                      ],
                      "searchText":  "🏠 白盒 如何通过体块、标准尺度规范、寻路和试玩测试构建基本 3D 版本的关卡。 为什么要建立白盒？ 一个 白盒 （也称 blockmesh（块网格） 或 灰盒 ） 是一个使用简单 3D 形状构建的 3D 草稿关卡，但没有任何细节或精美的艺术资源。 目标是制作、测试和调整关卡的基本形状。 在下图中，请注意白盒版本和最终发布版本之间的差异。一个形状可能一开始是一个灰色的块——然后经过几个月的时间 试玩测试 和 美术处理 ，该块变成一堆桶......或者可能被完全删除。 《使命召唤：现代战争》(2019) 中“码头”的白盒与最终美术处理的比较 通过布莱恩·贝克 白盒 支持实验 . 删除或重建一些粗略的白盒模型体是“便宜的”，但扔掉最终的 美术处理 工作“昂贵”且浪费。 当你对关卡结构没有信心时，最好保持它“便宜”，直到它准备变得“昂贵”。 您无法对设计文档或布局草图进行试玩测试， 但你可以测试白盒 并评估其 动线 , 平衡 , 遭遇战设计 ， 和 标准尺度规范 。这是设计阶段，您最终开始发现这些想法是否可行。白盒只是一个开始。 “……如果我们考虑到 [Neon White（ Steam ）] 附带了超过 100 个关卡，团队的报废关卡数量达到了“双倍”，并且仅 Smackdown [关卡] 就做出了 50 多项更改，那么我们在整个游戏中将面临数千次调整和重新设计。[...] 三年后，Smackdown 完成了。” ——来自 《Neon White》关卡是如何制作的 作者：Blake Hester，游戏线人 #350 本·埃斯波西托 (Ben Esposito)、拉塞尔·奥诺尔 (Russell Honor) 和卡特·皮科洛 (Carter Piccollo) 主演的《Neon White》(2022) 中的《Smackdown》的早期白盒版本 （来自游戏线人） 关键概念 做白盒时，请考虑以下几个方面： 体块 是形状所传达的一般体积和重量感。 这个结构是厚/重，还是薄/轻？这是一个什么样的地方？ 风景 需要特别考虑。 构图 目前在关卡设计文化中被过分强调。 尺度规范 是关卡的一般比例、尺寸和比例。 这个区域太大还是太小？玩家可以进入这个房间吗？ 有用测量的示例： 《毁灭战士》 尺度 , 《雷神之锤》 尺度 寻路与引导 是玩家学习地图结构的导航过程。 如何帮助玩家找到 主动线 / 终点？玩家是否感到太失落？ 试玩测试 是当您运行实验来查看关卡是否满足其设计目标时。 大多数玩家都能完成该关卡吗？做 遭遇战 工作？是吗 平衡的 ? 试玩测试确实很重要。这就是白盒的全部意义所在。 示例白盒视频 - 《神秘海域：失落的遗产 - 火车关卡早期原型》 作者：马修·加兰特 构建方法 游戏中常见的3D关卡构建方式有五种： 原语： 排列简单的基本形状，如立方体和盒子。 画笔/建模： 在关卡编辑器中构造 3D 形状。 模块化套件： 将预制件连接在一起，就像乐高一样。 雕刻： “绘制”有机 3D 形状，对于风景很有用。 样条曲线： 创建按程序生成几何图形的数学曲线 基元 基元 是简单的 3D 形状，例如游戏编辑器中内置的默认灰色立方体和盒子。 移动/旋转/缩放形状。将它们排列在一起，相互堆叠，形成更复杂的形状组。 这是一种令人惊讶的强大白盒方法。您始终可以在任何 3D 引擎或工具中使用此方法，但您会遇到限制，很难搭建出简单方盒建筑之外的内容。 使用基本体做白盒的建议... 注意 标准尺度规范（metrics） , 建立规模是很棘手的。 做一个 坡道 ：制作一个长宽薄的立方体，然后旋转向下倾斜。使 楼梯 ：避免痛苦，只需制作坡道即可 做一个 门口： 两墙之间留有缝隙，没有门框。做一个 窗口： 制作类似门口的间隙，然后用齐腰高的短墙填充 Francis Ching 的维度体块图，摘自《建筑：形式、空间和秩序》 画笔/建模 刷子 是在关卡编辑器中建模的简单低多边形 3D 形状。 这是 20 世纪 90 年代至 2000 年代整个行业的主要关卡构建方法。 我们强烈推荐这种方法，因为它提供了最强的控制力和手工制作的感觉，但不幸的是，大多数现代游戏引擎的画笔建模工具通常很差。在这里找出工作流程可能很棘手。 用笔刷/低多边形白盒的建议... 使用一个 3D建模工具 强调低多边形几何。 统一： ProBuilder 没问题，但是 SabreCSG / RealtimeCSG 更加专注 虚幻：使用 立方网格 + 建模工具 （或 网格工具 ) 如果引擎可以使用 .MAP 或 .BSP 文件，请使用 TrenchBroom 使用一个 大粗网格尺寸 基于 标准尺度规范 ，具体来说 玩家宽度。 《毁灭战士》 或 雷神之锤 ：32u 宽玩家 = 将网格设置为 32 或 64 Unity：1m宽的玩家=将网格设置为1或2 Unreal：60uu 宽玩家 = 将网格设置为 50 / 100 或 64 / 128 使用“画笔”进行简单的 3D 建模 TrenchBroom ; GIF 演示 伯努瓦·“巴尔”·斯托德尔 模块化套件 将套件中的预制建筑片段拼凑在一起 模块化零件 . 然而，如果套件设计或配置不当，就会很难使用。如果您是初学者，您可能不应该尝试制作自己的工具包 - 只需下载一个即可。 有关规划、测量和构建模块化套件的更多信息，请参阅 模块化套件设计 . 有关下载免费模块化原型套件的链接，请参阅 资源。 使用模块化套件进行白盒的建议... 配置网格并打开网格捕捉 （操作方法： Unity , 虚幻 ) 根据模块大小使用大的粗网格 例如如果墙体模块宽5m，则将网格设置为5 使用顶点捕捉 精确对齐模块（操作方法： Unity , 虚幻 ) 只是 下载预制套件。 “灰盒”白盒模块化套件用于《上古卷轴5：天际》中的原型设计， 图片由乔尔·伯吉斯拍摄 雕刻 大多数现代引擎都有一个 雕刻工具 可以让您绘制平面并使其变形。 我们仅使用它来制作大而光滑的形状，例如地形和风景；这对建筑物等坚硬表面不利。 但如果景观是一个项目的核心，那么就无法避免雕刻。 有关雕刻和设计地形的更多信息，请参阅 景观地形 . 用雕刻做白盒的建议... 雕刻常常会让初学者分心。 只需单击一下即可制作一座山是如此有趣且充满力量，以至于您会忘记进行任何关卡设计。小心！不要让雕刻工具诱惑您！ 使用大尺寸的画笔 首先关注大核心形状。 定义地平面 与 设置高度（统一） 或 展平目标（虚幻） 刷子 将斜坡雕刻成阶梯式露台 定义渐变，然后对其进行平滑。 避免侵蚀/自动生成器工具， 你需要控制设计。 为《魔兽世界：军团再临》中的“纳格兰”地区雕刻景观 样条曲线 样条曲线 是沿着路径生成几何图形的不可见曲线。 这些曲线也 非破坏性的 ;您可以在任意点调整样条线并重新生成其几何形状。 样条线非常适合白盒道路或河流等弯曲的线性形状，它还可以自动使周围的景观变形。 也可以使用样条线生成非线性区域和建筑物，但这种类型的工作流程并不常见，通常需要自定义工具。 用样条线白盒的建议... 就像雕刻一样， 样条线通常会分散初学者的注意力。 使用样条线是如此有趣，以至于您会忘记进行任何关卡设计。不要让样条线诱惑您！ 样条工具各不相同。 它们直到 2010 年代中期才变得普遍。 Unreal 具有出色的内置支持 蓝图样条线 。 Unity 用户就没那么幸运了，必须尝试各种插件，例如 样条网格 或 编写您自己的样条线 . 样条曲线并不神奇。 如果你想制作比道路、河流或桥梁更复杂的东西，通常需要定制工具和大量的艺术支持。 用虚幻引擎 4 中的样条线定义的程序生成的桥梁的动画 GIF； 作者：Peter Severud（来自 Artstation） 为什么不使用 Blender、Maya、Max 或 SketchUp 等 3D 艺术工具来做白盒？ 人们争论这个 . 我们的看法是：3D 艺术工具不允许您调整玩法、碰撞、遭遇战或物品。试玩测试变得更慢且频率更低。 示例：在未命名的 AAA 游戏中，移动一块岩石需要一个长达一小时的多步骤过程：(1) 加载调试版本，(2) 查找哪个文件包含该对象，(3) 打开 Maya，(4) 编辑文件，(5) 重新编译游戏，(6) 再次加载调试版本以确认更改。 如何白盒 这是一个一般过程。如果您是初学者，或者正在开始一个新项目，请尝试做所有事情。您将逐渐个性化自己的流程和风格。 草图布局 添加地平面、比例尺图形、墙壁 试玩测试 再次发散、迭代和试玩测试 重复步骤4直至完成 1.S 双桅帆船 布局 如果没有任何计划，可能很难白盒，尤其是对于初学者来说。即使是简单的涂鸦也能有很大帮助。 请看下面的布局草图。左边的草图强调了每个空间的规模，中间的草图侧重于区域之间的关系，而右边的草图是更详细的平面图。这些草图中的任何一个都可以工作，它们中的任何一个都可以帮助您规划一个草图。 就画点东西吧！ 示例：三种相似但不同的布局绘图样式，也许可以帮助您规划布局...其中任何一个都可以帮助您开始，只需绘制一些东西 2. 添加地平面、比例尺图形和墙壁 创建地平面 （或一个大的扁平立方体）靠近 3D 空间的中心 (0, 0, 0)。 使用浅色网格原型纹理，以便您可以直观地估计尺寸和比例。该地板对象将帮助“接地”关卡几何体的其余部分，为其他所有物体提供水平线和上下文。 添加一个玩家人形比例人物 帮助建立规模。 如果您没有任何人形资产，请创建一个大致人形的块作为占位符。比例尺有助于玩家建立一致性和间隙。 有关常见走廊/墙壁尺寸和人形尺寸的更多信息，请参阅 尺度规范 . 有关免费原型设计和白盒纹理的链接，请参阅 资源 . 示例：一个灰色地平面，其上站立着一个黄色比例人物 建造一个墙段 大约是 比例人物高度的 150-200% . 如果您使用现代游戏引擎，尺寸不必非常精确——在这里建立比例感是最重要的。 如果您用 模块化套件 ，只需在图旁边放置一个标准墙模块即可。 用不同的颜色对墙壁进行纹理处理 从地平面。颜色和亮度为理解空间的组成以及这些不同的地板和墙壁平面如何相互关联提供了重要的背景。如果你担心颜色过多影响白盒的可读性，那么至少使用不同灰度的纹理。 示例：添加了一个白墙段，其高度是比例图的两倍 复制并粘贴墙段 建立更多的空间，直到您至少拥有一个房间或走廊。有些工具具有特殊的“复制”或“克隆”命令：在 Hammer 中，按住 Shift 并拖动画笔；在 UE4 中，按住 Ctrl+Shift 并拖动墙壁对象。 交叉路口没问题。凌乱也没关系。 要制作门口或窗户，只需在墙段之间留出间隙，然后再将其填充即可。入口和走廊的宽度至少应是比例图的两倍。 示例：基于第一面墙复制粘贴/复制更多墙段 3. 试玩测试 做一个简单的自我试玩测试： 在游戏引擎内，以完整的玩家重力、碰撞和速度在空间中行走。 白盒的目的是进行实验。要验证实验结果，必须测试原型。 不要只是在编辑器视图中飞来飞去， 这无助于你想象玩家的体验。 体块 . 关卡的形状有意义吗？是不是看着很混乱？ 尺度规范 . 玩家是否能够穿过每扇门和通道？楼梯/坡道有用吗？玩家可以跳到他们应该跳的地方吗？ 动线 . 运动感觉是慢还是快、平滑还是复杂？哪种类型的运动最适合您的预期设计目标？ 示例 GIF：在游戏引擎中的半建空间中走动，尽快进行试玩测试 4. 发散和迭代 偏离原计划并响应试玩测试。 99% 的情况下，你的白盒都无法通过试玩测试。房间会感觉别扭，门口太窄，布局太混乱。但这正是我们白盒的原因！ 想要重建大片白盒区吗？ 去吧。 想要删除整个房间吗？ 做吧。 需要将庭院分成两个较小的区域吗？ 你有许可。 示例：按照布局草图，用更多比例的图形搭建更多区域的白盒 对试玩测试和演练告诉您的内容保持开放的态度。 继续添加新比例的人物、墙壁和地板。 然后再次进行试玩测试。 GIF 示例：原来的白盒感觉太局促了，那么如果我们扩大空间并删除墙壁呢？ 5. 继续迭代 保持开放的心态并继续这个修改+试玩测试的循环。继续开发白盒。"
                  },
                  {
                      "href":  "process__blockout__massing.html",
                      "title":  "体块",
                      "description":  "核心结构形状的感觉和逻辑",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/massing",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒"
                                      ],
                      "searchText":  "体块 核心结构形状的感觉和逻辑 什么是体块？ 在建筑学中， 体块 是整体的 感觉 和 逻辑 的形状和空间。 房间是否给人感觉又大又重、又低又隐蔽、又或者又轻又开放？为什么？ 比较两个房间。它们距离很近还是很远？为什么？ 一堵墙看起来与另一堵墙相关吗？如果是这样，如何以及为什么？ 理想情况下，体块能够支撑建筑物的 节目 ，建筑组织背后的整体逻辑和功能。 Christopher Drummond 为斯德哥尔摩图书馆改建而进行的体块图研究摘录（ 完整的项目 ) 在 体块图 上图中，一位建筑师提议为公共图书馆增建一座新建筑。每个弥撒都有明确的功能和受众。 新的入口大厅（橙色）位于街道右侧，儿童区（黄色）位于该入口附近，这样孩子们就不会走得太远或打扰他人。中央开放空间（青色）是一个长庭院，作为核心社区空间和主要空间 循环 与现有的图书馆（金色）一起，突出了当人们从入口接近时不寻常的圆柱形形状。 添加的库翼（绿色）的对称性与现有库的对称性相匹配。临街零售空间（深灰色）位于入口大厅附近，以便人们可以在同一趟旅程中方便地参观零售店和图书馆。仓库（浅灰色）需要街道水平的通道来装卸货物，但利用了宽阔的地板和较低的自然光。 现在将体块理论应用到关卡中。玩家将如何以及何时使用每个区域？ （TODO：游戏的体块图示例） （TODO：游戏体块图示例的段落描述） 体块方法 维度 调整形状的最简单方法是在 3D 关卡编辑器中移动、旋转或缩放它。这最适合立方体和其他 3D 基元等基本形状。如果您尝试拉伸或挤压详细的网格和模块化套件，它可能会看起来很奇怪。 维度体块图，摘自 Francis Ching 的《建筑：形式、空间和秩序》 添加剂 通过组合更简单的较小形状来制作更复杂的形状。这是关卡设计和现实世界建筑中最常见的体块方法。 衔接： 当 形状感觉独立且独特，我们说它们是 铰接式 . 当各部分的尺寸适合人们的感觉时，铰接可以使建筑物感觉更小，并且建造在 人性化尺度 . 来自弗朗西斯·程（Francis Ching）的《建筑：形式、空间和秩序》的附加体块图 减法 将较简单的形状雕刻成较复杂的形状。这对于现代主义未来主义建筑或雕刻有机感觉的天然岩石形式很有帮助。 斜角/倒角/布尔运算是 3D 建模中的关键技术，但当今大多数关卡设计工具都缺乏 剪裁工具 或 减法CSG 支持。 连续性： 与加法体块相比，减法体块通常感觉更 连续的 . 连续性将整个形式统一为一个整体形状。巨大的巨石感觉起来不像人类那么大。 减法体块图，摘自弗朗西斯·程（Francis Ching）的《建筑：形式、空间和秩序》 层次结构 有些质量比其他质量更重要。形状更不寻常的较大物体会比周围的物体感觉更重要。如果这个大质量保持连续，它可以中断其他质量并优先于其他形状。 在下面由阿尔瓦·阿尔托和艾丽莎·阿尔托设计的塞伊奈约基城市剧院的照片中，建筑的主体感觉又宽又低，有点铰接成重叠的体块。但是后面喷出的那一大块棕色物质是什么？它是一个高大的整体形状，具有不寻常的角度。它与其他方形形状形成对比，颜色/材料也不同。 阿尔瓦·阿尔托和艾丽莎·阿尔托绘制的塞伊奈约基城市剧院平面图，摘自弗朗西斯·程的《建筑：形式、空间和秩序》 在塞伊奈约基城市剧院上方的平面图中，请注意该建筑如何由 4 个主要体块组成：餐厅、后台和办公室的三个线性网格，围绕中央音乐厅空间旋转（参见右上角的强调部分）。对于剧院来说，显然音乐厅是该项目中最重要的部分，因此这就是为什么这种不寻常的形状定义了其余空间。 （TODO：视频游戏示例） 可读性 可读性 是如何表明其水平 布局 并利用其外观进行组织。 一张地图 高可读性 将相对简单的形状排列成清晰不同的组，玩家可以轻松测量和记忆。 相比之下，地图 可读性低 其结构和形状令人困惑，碎片化的体块让人感觉像是伪装。但低可读性并不一定是坏事，因为低可读性仍然可以帮助您实现设计目标。破碎的体块会使形状变得复杂，并将其分成更小的形状，有时这就是您想要的。 “这里的体块可能被破坏得太多了”， 评论和摄影：Mark Hogan 在上面旧金山德哈罗街 580 号的照片中，大型联排别墅住宅区已被分成十几种不同的重叠形状、颜色和材料，这表明许多不同的 年轻独特的古怪家庭 住在这里。 如果建筑师将其保留为一个大的连续的整体形状，那么它会感觉更大并且不那么“有趣”，可能会削弱周围社区的特征及其财产价值。 （或者你可能会说，这感觉像是一种绝望的尝试，试图装饰一些公寓并掩盖席卷城市的中产阶级化的真实本质。） 将 580 De Haro 想象为一个视频游戏关卡。想象一下 布局 里面。这种体块如何影响玩家 寻路 策略？ 衔接：每个部分都感觉像是一个独立家庭的独立联排别墅。联排别墅可能不会相互连接，每个内部空间可能只有一个前门/街道入口。 连续性：然而所有这些联排别墅都是建造在一起的，形成了一个巨大的整体场所感。尽管它们不同，但它们也感觉有联系。也许它们内部的布局、动线模式和表面处理相似？这并不奇怪。 文化：现实生活中，您见过这样的现代联排别墅吗？如果您的观众熟悉这种类型的建筑，并且您的关卡使用现实主义，那么他们可能会期望内部布局感觉合理。 比例 勒·柯布西耶 (Le Corbusier) 的加什别墅 (Villa Garches) 的编号网格系统比例和平面图比较，摘自程弗朗西斯 (Francis Ching) 的《建筑：形式、空间和秩序》 有时你甚至不需要网格来建立比例/重心 厚度和重量 厚度很重要。薄底板与厚底板、薄盖板与厚盖板、窄唇缘与宽梁 一般来说，避免薄地板/墙壁，容易出现隧道和剪切问题 厚度作为玩法：子弹穿透和撞墙（siege、csgo、blops4） 角球 切片馅饼，尖锐与圆形（链接到平衡？）...视线 简单的角 一个简单的角落本身不会引起人们的注意。它作为更大形状或体积的一部分而存在。形状和纹理没有变化，唯一让它流行的是光线照射它的方式。 90 度或更小的视线阻挡器 如果是细微的斜角，请勿在白盒阶段进行 简单的角落强调了贝聿铭设计的艾弗森博物馆的整体形状和体积，摘自弗朗西斯·程的《建筑：形式、空间和秩序》 圆角 钝角（\u003e 90度）的角，统一的形状，使玩家绕其形成更顺畅的动线/移动 打开视线，作为掩护效果较差 非常适合汽车和车辆，动线顺畅 复杂的角落 详细的加固角强调角是一个明显的边缘，并将角边缘线转化为一个物体。这个角落与整体体积无关，现在它感觉更像是一个地方或一个可以使用的东西，它与墙壁的偏差和它自己独特的轮廓。 更复杂的角适用于： 构建特定的视图、视角或远景 使边界/外壳感觉更坚固、永久和接地 强调角落作为掩护对象/视线阻挡物，玩家应该停留在那里 - 但在这种情况下，不要过度细节化小间隙，保持相当厚实和坚实的感觉 角落细节强调了密斯·凡德罗设计的联邦长廊公寓和帕拉迪奥设计的大教堂的边缘，摘自弗朗西斯·程的《建筑：形式、空间和秩序》 开放的角落 用开口打破边缘，以强调墙壁是如何包围内部的平面。如果正面用厚墙照亮，开放的角落会感觉非常微妙且几乎不存在，以防你不希望玩家第一眼注意到它。 偷偷摸摸的角落？一个陷阱？ 非常现代，在传统砖石和木工中非常罕见 当用玻璃封闭时：花哨、通风、昂贵 避免形状心理 形状心理学 该理论认为某些形状传达普遍思想并影响行为。 这本书强烈主张形状心理学99%都是废话 。抽象的几何形状不会让所有人感受到相同的东西，也不会传达相同的想法。人类根据遗传倾向、个人经历和文化的复杂组合，与形状形成心理联系。 即使这不是废话，形状心理学也不一定会转移到电子游戏环境中。人们在现实世界中的行为方式通常是一种，但在电子游戏中的行为方式却有所不同。玩家行为更多地取决于游戏模式、机制、可用信息、文化框架和角色扮演角色，而不是形状是圆形还是方形。 为了在关卡中设计一致的玩家行为，您应该 试玩测试 相反。做好工作，而不是希望有什么神奇的理论来给玩家洗脑。 有关揭穿这种脑毒的更多信息，请参阅 形状与色彩心理学 . 形状心理学是错误的、糟糕的，甚至不起作用……相信我们，没有它你会过得更好"
                  },
                  {
                      "href":  "process__blockout__massing__composition.html",
                      "title":  "构图",
                      "description":  "关卡中形状的整体视觉排列和组织；地标、远景、途径；另外，为什么“引导线”不是真实的",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/massing/composition",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒",
                                          "体块"
                                      ],
                      "searchText":  "构图 关卡中形状的整体视觉排列和组织；地标、远景、途径；另外，为什么“引导线”不是真实的 什么是组合？ 构图 是关卡的整体视觉组织。有两种类型的组合： 空间构图： 核心整体大图3D排列 体块 。我们无法保证特定的视图，而是考虑了各种视角和位置。 这是建筑、室内设计和雕塑等 3D 艺术中实践的“构图”。 镜头构图： 从特定位置的特定角度，关卡在玩家的 2D 相机框架/屏幕中的外观如何。 这是绘画、绘画、摄影和电影等二维艺术中实践的“构图”。 许多关卡设计教程和资源都声称特定的镜头构图非常重要。由于许多原因，我们意见不一致，并且对构图有不同的定义。相反，我们认为 空间构图比镜头构图重要得多。 （待办事项：图像） 空间构图 空间组织包括建立一个空间 关卡制度 ，其中关卡的某些部分应该比其他部分更重要。层次结构的顶部是关键地标、焦点和中心区域， 对比 与周围环境有意义地结合在一起，并锚定构图的其余部分。建立空间对比的一些方法： 高度。 拥挤空间中的高大塔，或开放空间中的小矮物体。 密度/分布。 更宽的开放空间，周围环绕着更小、更窄的结构。 方向。 脱离周围网格的有角度的物体。 形状。 附近有很多长方形的东西吗？尝试在那里放一个圆形的东西。 昌迪加尔议会（左下）、德尔坎波广场（中上）和 Shokin-Tei 馆（中下）的焦点策略。摘自弗朗西斯·程（Francis Ching）的《建筑：形式、空间和秩序》第三章的图画。 在上图中，请注意中央立法院如何 昌迪加尔议会宫 勒·柯布西耶（Le Corbusier）（左下）在其平面图中使用了几种对比类型。它很大，是一个盒子里的圆圈，并且以与网格的其余部分分开的倾斜角度/轴旋转。所以感觉对于这座建筑的功能来说是非常重要和至关重要的！如果这是一个关卡，那么主要的场景或最终的 Boss 战斗可能会发生在这个圆形房间里。 房间偏离中心，几乎触及东墙。但它并不感觉偏离中心，不是吗？这是因为焦点在空间组织内创建了新的中心。想象一个来自重要区域的影响力区域；它有点“拉动”周围构图的其余部分。 （请参阅右下角的图表，了解焦点如何影响我们感知空间“中心”的方式。） 请记住， 层次结构取决于当地的对比和背景。 高大的物体只有被矮小的物体包围时才会显得特别。如果一件小事被大事包围，就会感觉更特别。 地标 一个 地标 或 兴趣点 (POI) 是关卡中独特且令人难忘的形状、质量或位置。 待办事项：示例 TODO / 重要提示：地标必须让人感觉相关且有用！否则它们就不能起到地标的作用！ 实际地标（玩家在游戏过程中注意到的内容）与假装地标（例如《最后生还者》中的随机天空盒元素不会引导玩家，实际上没有用） 显着性 视线 一个 视线 是空旷空间的轨迹，提供了另一个空间的可能视图。 视线是玩家在与当前游戏状态和目标相关时使用的工具。如果玩家没有理由沿着视线看，那么他们很可能根本不会使用视线。视线是玩家可能会忽略的机会/情境工具，它不能保证玩家的行为。 即使玩家看向某个方向， 无法保证他们会记住或处理他们所看到的内容。 （想象一下阅读一本无聊的书或观看一部无聊的电影；您的眼睛可能会看到文字/图像，但这并不意味着您实际上阅读或处理了它。） Sal Garozzo 和 Shawn Snelling 在《反恐精英（ Steam ）：全球攻势》中对 de_cache 的视线分析，来自 GDC 2015：竞技 CS:GO 的社区级设计（来自 YouTube） 在上图中，关卡设计师 Sal Garozzo 重点介绍了 2015 版多人竞技射击游戏地图上的常见战略视线 去缓存 在《反恐精英：全球攻势》中。每个视线提供不同程度的覆盖范围和信息，用于攻击/防御炸弹点 A 区域。 然而，所有这些视线对于初次玩游戏的玩家来说，第一眼看上去会很明显吗？ 不。事实上，识别和记住这些视线是学习游戏/学习地图的一部分。竞技选手必须积极研究这些视线；是的 不 一种自然的、潜意识的、明显的环顾四周的方式。 视线的存在并不意味着玩家会使用它，甚至不知道它的存在。 有关多人游戏环境中视线的更多信息，请参阅 平衡 . 维斯塔 那么我们如何让玩家第一眼看到视线很重要呢？ 一个 远景 是一个非常有深度的场景构图，提供了下一个区域的概览，让玩家有机会制定策略。在现代遭遇战设计中，预先引入具有远景的竞技场是很常见的，特别是当竞技场布局复杂时。 （TODO：通过示例更多地讨论 vista，这些示例也强调 vista 的流程/布局） 方法 安 方法 是一条有远景的路。 （TODO：显示方法示例） （TODO：例如……流水别墅？） 眺望-庇护 前景避难理论 是现实世界建筑中普遍存在的信念/设计模式，它认为人类通过寻找来导航空间 前景 （有利位置）对比 避难所 （安全区域），唤起他们与生俱来的生存本能。 我们认为前景避难是糟糕的理论（也是糟糕的科学/糟糕的艺术） 关卡设计的有限应用 。相反，我们建议使用较少哲学包袱的现有概念和术语，例如视线与掩护。 有关为什么我们认为这是糟糕的理论的更多信息，请参阅 眺望-庇护 . （TODO：包括前景避难所图像） 镜头构图（谬误） 镜头构图 是关卡几何形状相对于玩家相机视角的 2D 排列。 好吧，有时其中一些很重要。视线、方法、颜色和照明、视角——有时所有这些方面都很重要。 但一些关卡设计师将镜头合成误解为关卡设计。他们认为，如果你安排关卡中的所有内容以形成精美的框架视图，那么玩家将神奇地无言地知道要做什么和去哪里。 构图不是精神控制。这是关卡设计理论中非常常见的误解，我们将用一整个章节来揭穿它。出于这个原因，我们称其为 镜头构图谬误 ：一种看似正确且有用的信念，但实际上是严重错误的，会导致更糟糕的理解。 截图不是关卡 首先，截图并不是一个关卡。这似乎是显而易见的，但许多关卡设计师似乎已经忘记了。 相反，屏幕截图是游戏在特定位置、角度和时间的图像。 截图是一种摄影行为 . 照片是否捕捉到了某个地点或时间的客观事实？不。摄影师是选择地点和时间来创作图像的艺术家。即使是白盒的开发概述屏幕截图也会强调或淡化某些元素。照片是一种艺术诠释，捕捉 只有一方面 真实的人、地点或事物。 没有照片可以取代参观某个地方或与某人会面的体验，也没有屏幕截图可以取代试玩测试。 更重要的是，无法保证玩家会想象相同的取景或构图。 玩家永远不会游玩你的屏幕截图。 有关摄影和意义长达数十年的争论的更多信息，请参阅 关于摄影 作者：Susan Sontag（关于照片和美国政治）或 露西达相机 罗兰·巴特（Roland Barthes）（关于照片和死亡）。 “Ceci n\u0027est pas un niveau”（“这不是一个关卡”）改编自名画中的“Ceci n\u0027est pas une pipe”（“这不是一支烟斗”） 雷内·马格里特的《图像的背叛》 . 引导线（都是废话） 当前关卡设计的趋势是通过绘制“引导线”来分析屏幕截图，这些“引导线”似乎指向/引导玩家的眼睛看向远处的地标。 然而我们认为 引导线实际上并不有效 ，而且，引导线在它们自己的逻辑中甚至没有意义。 引导线误解了人类的凝视、感知和信息处理。 视网膜扫描和 视线追踪 技术展示了 2D 视觉构图的引导线和其他传统原则如何不像我们想象的那样“引导眼睛”。即使他们这样做了，也不能保证玩家确实处理了视觉信息。 几乎是你建造的每条走廊 似乎会在远处汇聚 。这种现象称为 透视缩短， 在平坦的 2D 图像中创建深度错觉。使用等距或平行投影的游戏使引导线变得不可能。的 透视画的艺术史 很有趣，但这不是关卡设计。 “引导线”始终存在于任何线性透视的屏幕截图中；你不能——不做引导线 讽刺的是，引导线会误导关卡设计师 相信镜头构图、环境美术和布景是核心关卡的设计问题，而不是 标准尺度规范 , 遭遇战设计 , 或 试玩测试 。即使引导线有效（实际上没有），您也会在关卡设计过程接近结束时进行。先关注关卡最基础的东西。 如果你真的费心进行试玩测试，引导线通常会失败。 您会发现玩家有 99% 的几率会看向其他地方，有 1% 的几率会朝预期方向看 0.5 秒。 截图不是关卡，没有人玩过截图。 引导线是 自我实现的预言 当您将游戏摄像机移动到特定位置以构建特定视图时。 当然截图要遵循构图规则！那是因为你就是这样写的！然后你在上面画了线！ 这是摄影，不是关卡设计。咨询 “黄金比例”梗 关于自我实现的构图模式的荒谬。 “引导线”的存在是因为您在图像上绘制了图案，就像“黄金比例”模因一样 这不是人们导航空间的方式。 人们利用模式识别、先验知识和文化联想在头脑中构建思维导图。 寻路与引导 是移动和使用环境的复杂主动过程，而不仅仅是从一个角度观看关卡中的一个点。 在空间内构建视图称为摄影，这是人类练习和发展的一项技能。这不是一个自然的潜意识过程。 镜头构图对于摄影、电影和其他静态平面 2D 媒体更有意义 作者对镜头的控制力很强，观众可以特别关注整个图像。然而，对于玩家可以在错误的时间将相机移动到错误的位置的交互式环境来说，它没有什么意义。 视频游戏关卡是一个地方，而不是绘画、照片或电影。 对于 更好的方法 影响/“指导”玩家，请参阅 寻路与引导 . 关卡设计不是摄影/电影摄影，抱歉（CC0 许可下的照片） 视线与引导线 视线和引导线似乎是相同的。它们都与追踪玩家从摄像机角度看到的内容有关。 然而，视线和引导线强调的东西截然不同： 视线： 空旷空间的轨迹，提供了另一个空间的可能视图 玩家在与当前游戏状态和目标相关时使用的工具 我们想再次强调： 视线由空旷的空间组成 视线是情境工具，不能保证行为 引导线： 假想的现象，墙壁和线性布景似乎在远处汇聚，下意识地引导玩家去往哪里 没有人在这样的空间中航行 没有人玩这样的电子游戏 不要为任何人制作关卡 要审查... 空间构图 是关卡中 3D 质量的整体组织。 层次结构 是指某些事物看起来比其他事物更重要，通常是因为它们在大小、形状、分布或角度方面存在对比。 地标 显着性 视线 是玩家可以用来查看另一个区域的空白空间线。 维斯塔 方法 镜头构图 这是一种有点扯淡的理论，认为玩家的观点决定了他们的行为，而不是玩家对空间的实际理解。 屏幕截图不是关卡；而是关卡。 关卡是玩家使用的空间 引导线 是脑毒，不要使用它们 不要将引导线与视线混淆，它们实际上是真实的 现在怎么办？ 将这个理论应用到 白盒 . 有关通过架构“引导玩家”的更多信息，请参阅 体块 和 寻路与引导 . 进一步阅读 我们在关卡设计中反对引导线/镜头构图的立场目前在游戏行业中还不是常态。虽然我们认为 99% 是脑毒，但其他可信的设计师不同意： “环境设计作为空间摄影：理论与实践” 作者：Miriam Bellard，Rockstar North（GDC 2019）介绍了 Rockstar 在侠盗猎车手 5 关卡中的电影环境构图方法。贝拉德提出了一种采用三分法叠加的演练方法，并强调体现空间的可供性/显着性模型。她还“打破了”主导线和小细节，同时认为它们仍然有用。总的来说，这可能是关于镜头构图最“平衡”的行业讨论，但也许只是不要喝太多 evo psych / 形状心理学酷援助 . “什么都没有的重要性：在关卡设计中使用负空间” 作者：Jim Brown，Epic Games（GDC 2014）"
                  },
                  {
                      "href":  "process__blockout__massing__landscape.html",
                      "title":  "景观地形",
                      "description":  "如何规划和雕刻 3D 地形以进行关卡设计；绘画、种植",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/massing/landscape",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒",
                                          "体块"
                                      ],
                      "searchText":  "景观地形 如何规划和雕刻 3D 地形以进行关卡设计；绘画、种植 什么是景观设计？ 老实说，关于关卡设计和景观的现有理论或记录知识并不多。环境美术家倾向于以有限的作品场景进行小规模工作，而关卡设计师则专注于建筑物。当您寻找有关此主题的教程或指南时，几乎所有内容都会集中于特定于引擎的雕刻工具和地质模拟工具，而与设计地形的实际行为无关。我们现有的设计理论基本上忽略了景观，当如此多的现代射击游戏、开放世界和多人游戏设计发生在景观中时，这感觉很愚蠢。 不幸的是，现实世界的景观设计只能为关卡设计师提供有限的洞察力。景观设计师必须考虑周围的生态、气候、水文、土壤化学、考古缓解、土地权利、建筑规范……这些都是世界建筑中需要考虑的有趣因素，但当你只是试图遮挡一些基本的几何形状时，这些因素绝对超出了范围。 因此，在本节中，我们希望重点关注设计和功能。我们定义 景观设计 在视频游戏关卡中，有目的地塑造地形，以帮助玩家实现所需的流程和体验目标。 山的解剖 景观由岩石、泥土和沙子组成，逐渐被风或水磨损（侵蚀）。 当沿着地壳的构造板块相互作用时，它们经常将岩石向上推（ 构造隆升 ）并形成各种 山 。当暖空气上升并将云层推向山顶时，较高的海拔和较低的气压会导致云层下雨。雨水从山上流回，形成 河流 和 山谷 。雨停留在山脉的迎风面，而另一面的下风面（ 背风处 ）将水分流失到较热的空气中，从而保持相对干燥和干旱（ 雨影 ). 雨影效果图，根据 CC-BY-SA 2.0 许可，来自 https://commons.wikimedia.org/wiki/File:Rain_shadow_effect.jpg 在较高的山脉上，通常有一个突出的 树线 这标志着树木因过于干燥、寒冷或多风而无法再生长的地方。在林线以上，山岩清晰可见，偶尔有灌木/植物，或者冬天有厚厚的积雪。 要设计合理的自然景观，请考虑各种类型的岩石、侵蚀和气候将如何塑造地形。然后考虑当地居民如何应对该地形。 水 向下流动并绕过障碍物。这意味着河流弯曲很多，这也意味着山脉和山谷弯曲很多。 ...所以道路和小路也应该弯曲，因为人类必须遵循地形。笔直平坦的高速公路和道路相对现代，意味着一个强大的工业社会可以投入（或浪费？）资源来平整道路。 植被 将污垢固定到位。根深的树木尤其具有抵抗侵蚀和阻挡风的能力。森林充当 防风林 ，这意味着森林的迎风/背风侧可以有不同的生物群落。 海拔 变化会影响风和水的模式。如果您的关卡以山脉为特色，那么迎风/背风的生物群落是否应该相同 Catherine Dee 对美国西雅图煤气厂公园的研究，《景观设计中的形式和结构》，第 23 页 景观雕刻工作流程 人们进行雕刻已有数千年的历史，因此有很多关于如何雕刻的理论，这是一个值得专门写一本书的主题。在这里，我们将重点关注雕刻的基础知识，因为它们与游戏引擎中的雕刻地形相关： 布局 ：绘制带有标签的简单景观图。 有哪些不同的生物群落和小气候？哪些领域最重要？ 白盒 ：为景观雕刻粗糙的形状，注意流动和规模。 每个山谷、山丘、山脉或峡谷有多大？是高还是低、是长还是短、是尖锐还是平滑？ 尺度规范 ：测量行驶时间、高度和可穿越的坡道/斜坡。 清楚玩家可以去哪里吗？感觉地点太近还是太远？ 美术处理 ：雕刻和绘制较小的细节，应用固定装饰。 这个空间有清晰的情绪吗？感觉是生活中的还是合理的？ “完成”……还是空的？ 每个阶段之后，我们当然强烈推荐 试玩测试 。试玩测试时，检查： 感觉太大的区域、感觉太长或太烦人的路线 不该白盒的白盒区域，看似可以攀登的无法攀登的斜坡 玩家可能会被卡住或掉进缝隙中的游戏破坏者 1. 地形布局 首先，画一个 布局 来规划景观。根据主题和当地气候对区域进行遮荫。标记并突出显示突出区域。您的景观布局图应该能够回答以下问题： 最大的区域是什么，哪些区域需要彼此相邻？ 每个区域的主题是什么？它与相邻区域有何关系？ 每个区域需要什么类型的艺术资产？ 在下面《魔兽世界》的示例布局图中，请注意开发团队如何从一个简单的开始 气泡图 开始解决空间关系。当他们花费数月/年的时间在关卡上进行迭代时，最终的陆地保留了类似的组织，但产生了截然不同的大小和形状。左上角的“悬槌”区域面积大约增加了三倍，冲积平原减半，海滩扩展为港口。计划偏离你的计划。 《魔兽世界：德拉诺之王》中纳格兰的内部布局图与完成的游戏内地图 (https://www.mmo-champion.com/content/4457-Artcraft-Level-Design-Part-3) 还要注意明确的区域颜色编码（棕色=无法通行的山脉，黄色=干旱，绿色=温带，深绿色=潮湿）以及它如何传达整体空间层次结构。顶部三分之一是河以北的湿润地区，中间三分之一是温带山谷，底部三分之一是干旱山脉。 2. 地形白盒 场地规划 玩家从哪里开始以及什么是 主动线 ，如果有的话？什么是主要和次要 循环 通过每个区域以及区域之间？ 是否 体块 感觉小而舒适，还是狭窄而幽闭？总体中每个区域的空间特征是什么？ 构图 ? 定义该区域中常见的大型重复形状和物体（例如房屋、树）的调色板，并将其占位符包含在遮盖区域中。 对于像暴雪这样需要跨多个部门协调制作的大型开发团队来说，这个白盒阶段也是一个好时机 研究 并与环境美术家一起规划： “与环境美术家合作，关卡设计师将帮助指导和定义所需环境资产的范围。这些资产包括地形纹理、树木、灌木丛、重点植物、岩石等。所需的模型和纹理范围不仅必须解决主要区域的外观，还要解决分解区域所需的子环境类型，同时将概念变为现实，同时保持在我们游戏引擎的能力范围内。这可能是一个挑战，而且经常如此。 以新纳格兰为例。我们不仅拥有你们所知的来自外域的纳格兰的环境，还有新的区域，如湿地和海拔较高的干旱地区。如果处理不当，这些不同环境主题的视觉冲突可能会非常不和谐。关卡设计师和环境美术家之间会就形状语言、颜色、多样性、规模、情绪、模型使用以及最终整个区域的视觉基调进行持续对话，以保持区域开发朝着正确的方向发展。” ——Ely Cannon，《魔兽世界》高级关卡设计师，来自 《Artcraft - 关卡设计第 3 部分》 《魔兽世界》中纳格兰的编辑器内屏幕截图（来自 https://www.mmo-champion.com/content/4457-Artcraft-Level-Design-Part-3） 3. 地形尺度规范 现在是考虑平衡的好时机……浅坡与深坡，薄壁架与厚壁架 在坡道/楼梯的顶部和底部留出足够的着陆空间，否则玩家可能会冲过并跳下壁架 该步行区域是否可读，边界是否清晰？玩家能从 __ 高度跌落并幸存吗？他们能爬上 __ 度的斜坡吗？ 出行时间，最近的快速出行点在哪里 4.美术处理 细化形状和整体 构图 并添加一些细节（草、植物、岩石）。轮廓、地质和侵蚀模式是否合理或一致？研究灯光、情绪和调色板。每个子区域是否感觉独特且可读？ Unity额外地形工具： https://docs.unity3d.com/Packages/com.unity.terrain-tools@2.0/manual/index.html Unity路径绘制工具： https://github.com/Roland09/PathPaintTool 顺便说一句，你仍然应该对地形进行大的改变，每次都重复步骤 2 和 3 程序生成的生物群落 手绘草和花非常耗时，如果你重做你的艺术，那么你只需要重新绘制所有东西。 最常见的方法是定义 生物群落 、树叶和纹理的主题调色板，自动装饰景观。然后地形系统可以通过程序生成细节来自动装饰自己。 大型 AAA 开放世界游戏在工具、脚本和环境美术方面投入了大量资金，以实现像这样的景观美术处理工作流程的自动化。除非您正在与团队一起开发一个大项目，否则这样做通常是不切实际的。 《光环》（ Steam ） Infinite (2021) 的内部关卡编辑器 Shiva 的屏幕截图，显示了程序生成的草原生物群系以及为 proc gen 系统提供动力的复杂视觉节点图形脚本；来自 “光环无限 - 工具 - 地形”，作者：Mikael Nellfors 拓扑结构 雕刻 使用“设置高度”画笔来布局地板平面和露台 您的一般雕刻工作流程将是：(1) 添加或减少质量，(2) 平滑，(3) 永远重复 要定义斜坡，请雕刻梯田“台阶”，然后平滑。对于沿着山或峡谷一侧的狭窄壁架坡道，专用坡道工具可能更容易。 不要过度平滑，不要让所有东西都变成一团团融化的混乱......锐化和折痕，定义形状 对于每个区域，从 3-4 种基本材料和色调开始。 油漆保持一致。不要将悬崖材料重新用作地面材料。 首先进行大型基本平面雕刻，然后切换到越来越小的画笔以平滑斜坡并为地板平面添加较小的高度变化。 避免使用侵蚀画笔做白盒...这些无法为您进行关卡设计！这些用于稍后在设计过程中详细说明您的关卡 拓扑模式 高原 是顶部平坦的凸起地貌。 露台 是从斜坡切下的平坦表面。 Catherine Dee 的高原研究，摘自“景观建筑中的形式和结构”，第 12 页。 59 陨石坑 是景观中的大深洞。 碗 是景观中的浅洞，并且 空洞 是较小的碗。将它们视为也可以梯田化的负面高原。下降到这些表面凹陷处可以提供安全感，或者可能是一种被困的感觉。 在现实生活中，梯田碗状结构形成了梦幻般的自然圆形剧场，可以集中声音并提供一个宽敞舒适的聚会场所。相反，一个小空洞可以给人一种亲密感。在游戏中，碗最常被部署为战场上的炮弹坑，以提供低浅的掩护——我们认为，这就是它自己的亲密形式。 凯瑟琳·迪伊 (Catherine Dee) 的碗和空心研究，摘自“景观建筑中的形式和结构”，第 12 页。 57 高原与火山口的结合产生了一种独特的火山般的效果，也可以兼作一种庇护所或藏身处（上图，左上角） CEDEC 2017 上《塞尔达传说：荒野之息》开发者演讲的屏幕截图 路径 路径设计 轴向路径是直的、有角度的且高效的，与人力和控制相关。 蜿蜒的小路是弯曲的、圆形的、低效的，与自然和休闲相关。第 91 页 路径响应约束： 用户。谁开辟了这条道路，今天又是谁在使用这条道路？ 地形。路径通常沿着景观或海岸线的曲线。切入景观或挖掘隧道需要大量工作。 植被。路径通常绕过大树或茂密的植被。清理土地是一项繁重的工作。 用硬质材料绘制的清晰路径意味着需要维护。废弃/偶尔使用软材料的路径模糊并溶解。 避免直线前进，逐渐让玩家更好地观察远处的地标，来自任天堂开发者在 CEDEC 2017 上的演讲 TODO：荒野之息“三角构图” TODO：找到与两个图匹配的 BotW 屏幕截图 路径类型 壁架路径 一侧开放，另一侧封闭。常见于山脉和峡谷的远足小径。可用于建议风景，或提供开放式景观与封闭式景观之间的令人愉快的对比。 插条 两侧都是封闭的，通常是通过地形或挡土墙“切开”的。在阳光明媚的日子里，它会让人感到安全和放松，在寒冷的黑夜里，它会让人感到潮湿和神秘。 山脊路径 两侧敞开并向上凸起。常见于大型开放湿地区域，如果高度足够，可提供一览无余的令人振奋的景色。 之字形 或 之字形路径 来回定期停留的地方来控制你的步伐。不是自然发生的，但经常用于陡峭的远足小径，以使上升（或下降）更安全。 凯瑟琳·迪 (Catherine Dee) 对各种壁架路径的研究，摘自“景观建筑中的形式和结构”，第 12 页。 94 对具有不同围护结构的各种浅层和深层切割的研究，作者：Catherine Dee，摘自“景观建筑中的形式和结构”，第 17 页。 95 Catherine Dee 对各种山脊路径（在湿地和英国哈德良长城顶部）的研究，摘自“景观建筑中的形式和结构”，第 17 页。 96 园艺 景观不仅仅是陆地和地形，它还涉及整体气候、生态和植被。景观设计师主要从事园艺和种植工作。 每个电子游戏景观都是一个花园，经过精心设计以促进审美或情绪。电子游戏希望我们停止怀疑，并假装在游戏世界的虚构中，这些都是未受破坏的荒野。这是我们为玩"
                  },
                  {
                      "href":  "process__blockout__massing__prospect-refuge.html",
                      "title":  "眺望-庇护",
                      "description":  "关于人们如何寻求优势和安全的心理学/建筑理论",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/massing/prospect-refuge",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒",
                                          "体块"
                                      ],
                      "searchText":  "眺望-庇护 关于人们如何寻求优势和安全的心理学/建筑理论 前景避难理论 是对建筑的一种普遍信仰，即人类有一种“与生俱来的欲望”去寻找 前景 （有利位置/了望台）和 避难所 （外壳免受威胁/查看）。 这本书认为，传统意义上的避难所， 在关卡设计中的应用有限 。视频游戏中的风险/安全/信息通常与现实世界的架构假设有很大不同。 （坦率地说，我们也怀疑它对于现实世界的建筑是否有用。） 在本页的末尾，我们建议使用关卡设计中现有的术语和概念来替代应用前景避难所理论。 （TODO：带有大红色 X 的前景避难所插图） 历史 在他 1975 年出版的书中 景观体验， 地理学家杰·阿普尔顿将心理学家丹尼尔·伯林的“觉醒理论”与早期进化心理学相结合，形成了他的前景避难理论。值得追查这是如何发生的。 在 20 世纪 50 年代和 60 年代，伯林利用实验室老鼠和好奇心进行了实验。他认为，当实验室老鼠（或人类）看到一个新空间时，它们在处理陌生的环境时会感到“兴奋”。 请注意，Berlyne 并不意味着性唤起，而是更像是 参与度 ——能量消耗和心理反应能力增加的总体状态。也就是说，一个更 复杂的 和 小说 环境刺激更多的唤醒/参与。 然而，太多的复杂性和新颖性是负面的。在他 1960 年的书中 冲突、唤醒和好奇心 伯林警告说，过多的环境刺激会导致焦虑和不确定性。如下图所示，它是“U 形”效应： 由 Berlyne 模型改编的“冯特曲线”，来自 “回到音乐偏好的倒U：文献综述”（2017） 进化心理学的基本前提是人类就像任何其他动物一样具有生存本能。阿普尔顿推断，伯林的环境唤醒也有助于人类的进化适应性。增强的心理反应能力对于穴居人/早期人类分析威胁并找到免受掠食者侵害的安全场所非常有用。 在心理学之外，直到 1988 年，建筑历史学家格兰特·希尔德布兰德 (Grant Hildebrand) 普及了阿普尔顿的前景避难所之前，没有人真正关心这一点。希尔德布兰德想要强化现代主义建筑对通用设计和功能的主张，因此心理学是一种有效的方式来论证为什么建筑师弗兰克·劳埃德·赖特的建筑据说具有内在的心理吸引力 - 在他 1999 年的书中达到了顶峰 建筑乐趣的起源。 （也许这些男人确实在暗指性唤起。） 批评 有多种方法可以批评前景避难理论，包括其科学和哲学： 伯林的行为主义和美学心理学 研究实验室老鼠的美学真的能教会我们任何关于人类美学的知识吗？ 艺术和美学真的可以这样研究吗？ 阿普尔顿添加了进化心理学 有 对进化心理学的广泛批评 即使 evo psych 是真实的，它与电子游戏有关吗？ 目前心理学领域正处于 复制危机 ，著名的实验和理论无法验证或重现 我们可以复制U型曲线吗？ （ 2021年学习： 也许不是） 我们可以复制前景避难效应吗？ （ 2016 年其他 34 项研究的荟萃分析 ：前景是真实的，但避难所不是） 乍一看，前景避难所理论似乎非常适用于游戏。与许多 3D 动作游戏一样，它关乎生存和安全。但由于上面列出的许多原因，我们认为最好不要依赖它。 如何在关卡设计中使用前景避难所： 也许不会。 我们认为，如果我们利用这些相同的想法会更有用 关卡设计中已有的术语和概念 。这些行业特定术语的哲学包袱较少，并提供更多的技术特异性，尤其是对于格斗游戏而言。 使用视线/远景而不是前景。 使用盖子/外壳/底座/安全屋代替避难所。 而不是前景... 一个 视线 是一条空白空间，其中一个区域可以从另一个区域看到。 一个 远景 是一个可以看到许多远处视线的有利位置。它在单人游戏关卡设计中最有用，可以传达进度节拍、预览地标并提供布局信息 - 特别是对于遭遇战开始之前的竞技场布局。 （TODO：链接到专门的视线和远景页面） 而不是避难... “避难”这个词的问题在于它意味着安全。但在电子游戏中，玩家的安全感是复杂的，并且远远超出了关卡设计的范畴。 对于许多动作游戏来说，威胁评估是玩家必须随着时间的推移而发展的核心机制/技能，具体取决于整体战斗设计。 游戏之间的生存和死亡系统也有很大差异：有些可能会奖励玩家的死亡，甚至会惩罚生存。 安全作为游戏状态 动作角色扮演游戏《《艾尔登法环》》（2022 年）进行了十几个小时后，玩家进入了一座魔法城堡中的“辩论室”。当大多数玩家达到这个地步时，都会感觉非常危险。 在《《艾尔登法环》》中，最难对付的头目敌人往往居住在装饰精美的地标区域。因此，这里独特的艺术资产将这个房间与过去的房间区分开来，它作为一个非常重要的特殊区域脱颖而出。 玩家在经历了 3-5 场战斗后到达了这一点，并且可能想知道下一个保存点在哪里。过去的头目竞技场在战斗前都有方便的保存点；而这一点则不然，并且会促使玩家冒着进步的风险。 （截图：辩论厅入口） 突然，一头巨大的发光巫师开始向玩家咆哮。 狼有一个名字和一个大的生命条，表明它是一个危险的头目敌人。 中等大小的房间，让大狼感觉更加庞大。想要躲避狼的攻击是很困难的。 家具和杂乱进一步限制了玩家的移动性和选择。 （直到老板摧毁家具，打开更多的地板空间，让战斗变得更容易。） 史诗般的戏剧音乐开始响起。 （截图：战斗正式开始） 注意所有让情况感觉危险的因素：用户界面、环境美术的一致使用、过去的遭遇战和进展系统，甚至音乐。 击败头目后，只剩下一个安静的“恩典”篝火般的保存点。这个具有里程碑意义的头目竞技场现在充当安全屋，是玩家在一场艰苦的战斗后赢得的领土。混乱不堪、半拆毁的议会厅现在呈现出一片和平废墟的气氛。 这是同一个房间，但在遭遇战前、遭遇战中、遭遇战后经历了三种不同的状态变化。 安全感较少依赖于布局/遮挡/架构，而更多地依赖于更广泛的游戏系统/遭遇战设计模式 游戏世界比现实世界更频繁地改变所有权和功能 如果过去的关卡有陷阱或伏击，某些东西就不会“看起来安全” 因此，“避难所”是一种情境/游戏状态，而不是建筑的形式质量。没有任何形状或布局是本质安全的。 外壳 那么我们应该用什么词来代替皈依呢？ 我们建议 外壳 ：区域被掩体包围的程度。 掩体 是阻挡视线和/或战斗的任何物体。 TODO：基地/安全屋 避难所作为围墙的设计策略示例；摘自凯瑟琳·迪伊的《景观设计中的形式和结构》"
                  },
                  {
                      "href":  "process__blockout__metrics.html",
                      "title":  "标准尺度规范（metrics）",
                      "description":  "关卡的比例和距离，关卡感觉有多大",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/metrics",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒"
                                      ],
                      "searchText":  "标准尺度规范（metrics） 关卡的比例和距离，关卡感觉有多大 什么是标准尺度规范？ 在关卡设计中， 标准尺度规范（metrics） 是整个关卡/游戏中的比例感、距离感和测量值。 所有关卡设计者至少使用两种类型的核心尺度规范： 玩家尺度规范 （或物理尺度规范）是引擎内测量的实际数字，例如玩家尺寸、移动速度、最大跳跃高度等。 描述 游戏物理， 导出的 来自游戏引擎 示例：“玩家尺寸”是一个可以测量和验证的具体事实 搭建尺度规范 是建议的地板/墙壁尺寸和指南，您可以根据自己的需求自行编写 体验目标 规定 游戏感觉， 决定 由设计师设计 例如：“常规走廊尺寸”是指导方针； “常规”对于每个项目意味着什么？ 比较玩家规模（物理）与环境标准尺度规范，摘自 Joel Burgess 和 Nate Purkeypile 的“GDC 2013：《上古卷轴5：天际》 的模块化关卡设计方法”（ 完整演讲和幻灯片来自 JoelBurgess.com ) 根据项目的不同，您可能需要 战斗尺度规范 或 谜题尺度规范 也是。 但要注意过度依赖尺度规范。数字和测量结果可能会给人一种设计法则万无一失的错觉——遵循这些数字会给你带来完美关卡的错觉。你必须拒绝这种幻想！您无法衡量获得良好游戏体验的方式。标准尺度规范是一个有用的设计工具，可以帮助您做出决策，但是 标准尺度规范并不神奇 . 请注意，“度量”也是“测量”的通用词，它不仅仅是一个关卡设计词。在整个游戏行业，我们还有移动游戏数据标准尺度规范（“KPI”）、受众数据标准尺度规范、营销数据标准尺度规范、商业化数据标准尺度规范……任何可以衡量的数据标准尺度规范。 规模 尺度规范可帮助您建立 规模 ，游戏世界有多大的一般感觉。 在关卡设计中，我们通常遵循现实世界的架构 人性化尺度 . 这意味着要确保房间不会让人们感觉太小或太大。在以现实风格工作时，适当的缩放非常重要，因为它使关卡感觉更合理——感觉更像是由人类建造并由人类居住的真实地方。 但是想象一下，一个关于猫的游戏，它需要一些感觉太大的房间（因为猫比人类小）。或者想象一个汽车游戏 - 它需要感觉太小的房子（因为汽车比人类大）。 对于游戏我们 “按照玩家的规模进行构建” ，这可能是也可能不是人类尺度。 电子游戏的规模很奇怪 人类尺度是有帮助的，但电子游戏空间不是人类的。电子游戏通常依赖于夸张的规模感，与任何一致的现实世界衡量标准并不相符。 在《毁灭战士》（ Steam ）中，玩家（“《毁灭战士》guy”）的宽度为 32 像素，换算为 1 米宽。霰弹枪长 63 像素，几乎长 2 米（6 英尺 5 英寸）。哦，《毁灭战士》guy 每帧运行 30 个单位，即 40-50 MPH，具体取决于哪个 备受争议的缩放系统 你用。不管怎样， 末日规模没有任何意义 ，不过玩起来感觉还是不错的。 在《上古卷轴：天际》中，世界面积约为 14 平方英里，最高的山峰海拔 766.5 米，玩家以 11.7 英里/小时的速度奔跑（不是冲刺）而不会感到疲劳。这意味着《上古卷轴5：天际》的整个“省”只有曼哈顿的一半大小，最高的山比迪拜的哈利法塔还要矮，而每个农民都是高性能的马拉松运动员。以任何现实世界的衡量标准来看，它都非常小而且奇怪。然而，不知何故，《上古卷轴5：天际》仍然感觉像是一个巨大的自然景观，有一座巨大的高山，居住着典型的中等健康水平的人。 《上古卷轴5：天际》中最高的山峰更像是迪士尼乐园中的马特洪峰，而不是任何现实世界中的山峰 因此，在构建视频游戏空间时，请记住，它应该只是“感觉”真实，作为情绪、氛围或美学的一部分。 但如果你的关卡设计过于像现实世界的建筑，那么具有讽刺意味的是，你的关卡会让人感觉太大、复杂且难以置信。 不要遵循现实世界的规模。 规模建议 “大”关卡感觉很大，但实际上比现实世界小得多。 玩家经常以非常快的速度移动……这在游戏世界中感觉很正常。 游戏世界给人的感觉是内在一致的，即使具体的数字看起来很愚蠢。 不幸的是这并不科学。只有当您在关卡和试玩测试中走动时，您才会知道“感觉不错”。 这就是为什么我们建议考虑尺度规范 白盒 阶段。您无法真正使用纸张布局来测试尺度规范，但如果您等待得太晚（例如在美术处理之后），那么进行重大更改将非常耗时。您甚至可能需要重新设计整个关卡。 Ketul Majmudar 为《蜘蛛侠》制作的屋顶竞技场白盒尺度规范 (PS4) 通过博客文章“为 SpidermanPS4 制作战斗空间” 基础尺度规范 理论上，您可以按照您想要的任何规模构建游戏或关卡。在实践中，物理实现假设默认比例，并且资产商店以常见的人形比例提供环境美术。遵循约定是......方便的。 为了您的方便，我们在下面提供了流行游戏引擎的常见标准尺度规范，但我们鼓励您查看我们的完整列表 工具 . 常见玩家尺寸 游戏/引擎 默认单位 边界框（宽度、高度） 眼高 Unity 米 1.0 x 1.8 m（或1.0 x 2.0 m） 1.5m - 1.7m 虚幻 厘米 60 x 176 厘米（半高：88） 152 厘米（88+64） 雷神之锤（ Steam ） / 半衰期 / 源引擎 英寸？* 32 x 72 英寸 64 英寸 （美国，现实生活） 英寸 20 x 69 英寸 （平均成人） 66 英寸 边界框/碰撞尺寸通常比实际角色模型大得多。 这种更大更厚的尺寸是为了更稳定的运动。这不是一个打击箱。 请注意 游戏中的眼睛高度通常低于实际眼睛的高度 。许多 FPS 游戏都会将您的眼睛放在脖子或胸部。有关更多详细信息，请参阅 感知标准尺度规范 - 相机高度 . *《雷神之锤》、《半条命》、Source Engine /“雷神之锤血统”游戏较少使用“英寸”（例如。 在《军团要塞 2》中，每个人的身高都是 7 英尺 ）并且没有真正意义。 现代建筑常见尺寸 游戏/引擎 内墙（深度、高度） 最小大厅宽度 门（宽度、高度） 台阶（高度、深度） Unity 0.1×3.0米 2.0米 1.25×2.5米 0.1×0.15m 虚幻 20×300厘米 150 厘米 110 x 220 厘米 15 x 25 厘米 雷神之锤 / 半衰期 / 源引擎 16 x 128 英寸 64 英寸 56 x 112 英寸 8 x 12 英寸 （美国，现实生活） 6 x 96 英寸 48 英寸 36 x 80 英寸 7 x 11 英寸（“7-11”） 最小走廊宽度应至少是玩家宽度的两倍。即使这样，也会感觉有点狭窄和不舒服。 现代门应该比走廊窄，以便为门框留出空间。 现代楼梯每 12-16 级台阶就有一个平台/平台。长或高的楼梯会给人工业化、纪念性或非住宅的感觉。 现代楼梯应遵循 30-35 度的坡度。 arctan(7/11) = 32 degrees 在 Source 1 和较旧的引擎中，水平网格遵循 2 的幂数。 Unity 用户通常更喜欢 1.0 和 10。 Unreal 用户根据年龄进行划分。使用您和您的合作者喜欢的任何数字舍入。 当以现实的现代风格建造时，做一些 研究 事先：收集计划、蓝图、示意图，甚至阅读当地的建筑规范。 建造符合建筑规范的甲板 由 CorporateM（通过维基百科，CC-BY-SA 4.0 Intl 许可证） 偏离传统尺度规范 明显偏离典型的尺度规范、比例和空间。 陡峭的楼梯会比浅楼梯感觉更痛苦和尴尬，如果是这样的话 体验目标 你想要，那就去做吧。通常，关卡中最好的部分就是不常见和意想不到的部分。但为了让某些东西感觉不寻常，你必须首先将它与足够多的常见元素进行对比。 如果关卡风格化/不现实怎么办？ 即使采用程式化的非现实艺术风格，尺度规范仍然需要让人感觉 内部一致 游戏世界/设计规范。例如，《雷神之锤 1》地图中的台阶通常有 16 英寸高，但游戏世界的其余部分则适当大且厚实，以匹配该比例。 如果关卡不是现代风格怎么办？ 做 研究 关于您正在使用的架构类型。例如，日本传统建筑采用 肯 （间） 比例系统。意大利文艺复兴时期的建筑师在古希腊和罗马建筑等方面使用了黄金比例（1：1.618）。 有关规划的更多信息，请参阅 前期制作 和 调研 . 传统日式房间中使用的带有“ken”测量系统的图表和图表（ 来自武藏野美术大学术语表 ) 如何使用标准尺度规范 将标准尺度规范引入关卡设计过程的一些方法： 构建 Metrics Zoo 测试图 原型核心玩家尺度 使用世界对齐的网格纹理 测试模块化套件 标准尺度规范调试工具、编辑器预览 整理共享建筑标准尺度规范 构建 Metrics Zoo 测试图 构建一个仅供开发人员使用的“标准尺度规范动物园”/“标准尺度规范游乐场”测试地图，展示所有关卡的不同游戏对象、模块和预制件。 白盒 . 用不同的房间、走廊和楼层高度制作一个简单的关卡。 可用性测试。 在重力作用下行走，在物体上跳跃，是一个普遍的麻烦。 试玩测试感受。 特别注意墙壁、门和地板的尺寸。楼梯台阶的高度感觉合适吗？门是否感觉太窄或太短？ 迭代 . 每次标准尺度规范修订后，再次进行试玩测试和演练。重复。 泰勒·麦库姆斯 (Tyler McCombs) 测量的示例标准尺度规范图 ( 通过 Twitter 帐户@TylerDanger ) 核心玩家物理尺度规范的一些示例 基本动作 步行速度、跑步速度 最大台阶高度、最大坡度倾斜度 最小走廊宽度、最小天花板高度 跳跃、坠落、坠落、高度 最大跳跃高度、最大跳跃距离、跑跳距离 重力强度、下落速度 1% 伤害与 100% 致命坠落伤害的坠落伤害高度阈值 《镜之边缘》的内部坠落损坏标准尺度规范图，来自 Elisabetta Silli 的“关卡设计挑战与解决方案 - 镜之边缘” （通过幻灯片） 使用世界对齐的网格纹理 做白盒时，使用某种具有少量表面细节的世界纹理。 不要使用平面纯色，它们在原型制作时会失去视觉尺度和深度提示。 不要使用详细的纹理，这些纹理在视觉上很繁忙，会扭曲比例，并且会分散注意力。 我们建议使用占位符网格/棋盘纹理，任何具有定期重复线条的东西，这将帮助您在搭建白盒时了解距离和比例。可在我们的 资源 页面查找各种原型纹理包链接。 网格原型纹理 (Prototype.wad) 和 Khreathor 的“教堂”遮挡 ( 来自作者网站和下载页面 ) 构建时，请确保纹理比例保持恒定且独立于 3D 对象比例。 为了在游戏引擎中保证比例一致： 《雷神之锤》/《半条命》/Source 引擎： 确保关卡编辑器的 “texture lock（纹理锁定）”已关闭 ，并将所有笔刷面设置为使用世界轴对齐。对于 TrenchBroom ，参见 TrenchBroom 手册的“使用纹理”章节 . 任何现代游戏引擎： 配置着色器或材质，让它使用带有平铺网格纹理的 三平面投影 。这样做的另一个好处是可以自动对所有对象进行 UV 展开，因此您可以更多地关注几何体而不是纹理对齐。 Unity： 可视化着色器编辑器内置 三平面节点 ；如果想深入编写自己的着色器，可以参考 Ben Golus 的帖子“三平面着色器的法线贴图” 虚幻： 材质编辑器内置 世界对齐纹理节点 ；如果想深入编写自己的着色器，可以参考 Ryan DowlingSoka 的帖子“虚幻中的三平面、抖动三平面和双平面贴图” Psychonauts 2（ Steam ） 内部标准尺度规范测试关卡的屏幕截图； 注意其中的网格原型纹理！ （ 来自 Devin Kelly-Sneed 的“代码背后：设计 Raz 的跳跃” ) 测试模块化套件标准尺度规范 与一个 模块化套件 ，您可以使用预先制作的图块和可卡合在一起的组件来构建一个关卡。 门口的最佳尺寸是多少？您不必再担心；该标准尺度规范被纳入门口模块中。在模块化结构中，您测量一次，然后基本上在整个关卡上复制并粘贴该测量结果。 然而，动态迭代模块化套件是很常见的——调整图块尺寸和尺寸、稍后完善和美术处理模块等。如果您对模块化套件的设计假设（例如图块网格尺寸或粒度）进行重大更改，那么您可能"
                  },
                  {
                      "href":  "process__blockout__metrics__doom.html",
                      "title":  "《毁灭战士》 尺度",
                      "description":  "生命值和伤害值、末日地图的常见大小和尺寸",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/metrics/doom",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒",
                                          "标准尺度规范"
                                      ],
                      "searchText":  "《毁灭战士》 尺度 生命值和伤害值、末日地图的常见大小和尺寸 以下是一些对 《毁灭战士》（ Steam ）/《毁灭战士2》 中的关卡设计有用的核心玩法值和数字。 然而，请记住，这是一款需要瞄准和躲避的动作游戏，因此实际伤害和每秒伤害 (DPS) 将在很大程度上取决于敌人的行为、可用的掩护、高度变化、敌人的构成等。 有关尺度规范是什么以及它们为何有用的更多信息，请参阅 尺度规范 . MAP07 《毁灭战士 2》中的“Dead Simple”，作者：American McGee 和 Sandy Petersen 世界尺度规范 单位和规模 《毁灭战士》 使用 2 的幂数的网格（例如 8、16、32、64、128、256...），纹理设计为以 8、16 或 32 为增量。 《毁灭战士》 的图形设计为 16:10 的宽高比 对于 4:3 显示，使用非方形像素垂直拉伸 20%。如今，这导致其许多艺术资产显得垂直“压扁”。它还扭曲了对 《毁灭战士》 真实世界尺度的任何尝试，我们可以猜测：16 个水平 《毁灭战士》 单位 = 10 个垂直 《毁灭战士》 单位 = 1 英尺 = 0.6 米。 典型地图结构 宽度单位 走廊（非常狭窄）、板条箱、传送垫 64 走廊（狭窄），大门，墙壁纹理 128 房间小 256-512 中型房间 512-1024 房间大 1024-1536 《毁灭战士 1》第 1 集的平均地图大小 ~4000 最大地图尺寸（推荐，最小故障） 32767 (+/- 16384) 最大地图尺寸（技术性、缺陷性和不稳定） 65535 (+/- 32768) 最大地图尺寸： 为了计算距离，《毁灭战士》 使用 16 位有符号整数，其最大值为 +/- 32767。但是，如果您实际上构建了一个从 -32767 延伸到 +32767（跨越 65535 个单位！）的地图，并以某种方式欺骗引擎运行它，那么它仍然会破坏其他距离计算，例如怪物的视线，因为 65535 的值会 溢出 过去的 +32767 变为 0。为了获得最佳结果，请将所有地图几何形状保持在 (0, 0, 0) 原点的 16384 个单位内。 武器标准尺度规范 《毁灭战士》通过每次命中时滚动虚拟骰子来随机模拟伤害值。对于霰弹枪，还有一个额外的铅弹散布模拟，其中每个弹丸必须与命中箱连接才能产生完全伤害。 每秒伤害 (DPS) 是根据射速乘以每次射击的平均伤害得出的粗略估计值。 武器 类型 范围 射速/秒 伤害/射击 输出功率 拳头 近战 0-32 2拳 2-20 22 狂暴之拳 近战 0-32 2拳 20-200 220 电锯 近战 0-33 9转 2-20 90 手枪 命中扫描 0-512? 2.5发子弹 5-15 25 霰弹枪 近 0-192? 1 发（7 颗子弹） 5-15 * 7 = 35-105 70 超级霰弹枪 关闭 0-128? 1 发（20 颗子弹） 5-15 * 20 = 100-300 150 链枪 命中扫描 0-512? 9 颗子弹 5-15 90 火箭发射器 中/长 128-512? 1 枚火箭（+ 128 范围溅射） 20-160 + 0-128 150 等离子枪 中 0-384? 12格 5-40 270 BFG 9000 中 0-384? 1 次射击（+ 40 个曳光弹，1024 范围） 100-800 + 49-87 ~1200 大多数地图一开始，会让玩家使用手枪和霰弹枪这样的基础武器，来击杀生命值较低的敌人。最终，玩家更多地依赖链枪、超级霰弹枪和火箭发射器，同时偶尔会改用等离子枪来对付更强大的敌人。 火箭发射器、等离子枪和 BFG 通常在很远的距离上效果较差，因为它们的射弹飞行时间存在滞后。在远距离时，怪物可以在被击中之前移开。末日的 自动瞄准 怪物的随机移动也意味着引导射击可能会很棘手。您可以将怪物放置在没有掩体的柱子上，限制它们躲避玩家射弹的能力，从而平衡远距离遭遇战对玩家有利的情况。 怪物标准尺度规范 怪物的视觉和听觉 怪物可以朝基本方向（N、E、S、W）和序数方向（NE、SE、SW、NW）看，基本上以 45 度增量。他们有一个基于其初始朝向的 180 度视锥，并且可以根据以下区域听到战斗声音 线定义 设置为白盒声音。 如果设置为“伏击”模式，怪物将拥有 360 度视锥并忽略声音。 怪物运动 最小走廊尺寸 给出为 (monster width + 2) x (monster height + 2) 但实际上，你的走廊通常应该更宽，因为怪物可能会以更大的增量“行走”，并且怪物会阻挡其他怪物。狭窄的斜角走廊将迫使怪物进行较慢的之字形移动，因为记住，它们只能以 45 度的增量转动和移动。 楼梯 对于怪物来说很棘手。一般来说，深度长、坡度浅的台阶总是更可靠。 台阶高度必须始终小于等于 24 单位（否则怪物就没有办法通过），最小台阶深度 / 最大坡度与怪物宽度成正比。例如，对于 24u 高的台阶，士兵需要 33u 深的台阶（35 度上升，2:3 比例），而恶魔则更宽，因此需要 51u 深（25 度，1:2 比例）​​。如果您想亲自查看边界框计算，请参阅 PCheckPosition() 和 PTryMove() 功能于 p_map.c 《毁灭战士》 源代码。 为了简化怪物的构建，我们通常建议： 最小走廊尺寸： 128 宽 x 128 高，大部分以 90 度角正交建造，以与网格对齐，偶尔也有 45 度角。 楼梯踏步尺寸 ：16 高 x 64 深（15 度上升，1:4 比例）或 8 高 x 32 深。 怪物战斗 怪物将在其目标的 64 个单位内使用近战攻击，而荒野猎人将尝试在 196 个单位内使用近战攻击，即使目标太远。 如果距离超过 64 单位，拥有远程攻击的怪物越接近玩家，就越可能发动攻击，最远距离为 2048 单位。但恶魔的远程攻击特别危险，因此它只会攻击 896 单位以内的敌人。 被击中时，怪物有随机几率被击晕 疼痛状态 -- 射速快的武器（链枪、等离子枪）或多弹丸武器（霰弹枪、超级霰弹枪）特别适合让怪物陷入硬直，并打断它们的攻击。 有关怪物行为和调试的更多信息，请参阅 末日维基上的“怪物行为” . 末日1怪物 怪物 健康 疼痛机会 分钟。走廊尺寸（宽 x 高） 分钟。台阶深度（24u台阶高） 玩家 100 -- 33×58 1 僵尸人 （士兵） 20 80% 42×58 33 中士 （霰弹枪家伙） 30 68% 42×58 33 小鬼 （火球恶魔） 60 80% 42×58 33 失落的灵魂 （飞骷髅） 100 100% 34×58 -- 恶魔 / 幽灵 （快猪） 150 71% 62×58 51 卡科德蒙 （大传单） 400 50% 64×58 -- 地狱男爵 （厚实的山羊） 1000 17% 50×66 41 蜘蛛恶魔 （老板） 3000 13% 258×102 254? 网络恶魔 （最终boss） 4000（+50% 火箭抵抗） 5% 82×112 74? 毁灭战士2怪物 《毁灭战士 2》包含《毁灭战士 1》中的所有怪物，并添加了更多中层怪物，旨在延长生存时间并与其他怪物互动。 怪物 健康 疼痛机会 分钟。走廊尺寸（宽 x 高） 分钟。台阶深度（24u台阶高） 重武器老兄 （链炮手） 70 68% 42×58 33 亡魂 （带有导弹的骷髅） 300 40% 42×58 33 痛苦元素 （大传单，产生失落的灵魂） 400 50% 64×58 -- 蜘蛛管 （蜘蛛恶魔宝宝） 500 50% 130×66 124? 地狱骑士 （较弱的地狱男爵） 500 17% 50×66 41 曼库布斯 （大型火焰喷射器怪物） 600 31% 98×66 90? 邪恶的 （火焰僵尸，复活怪物） 700 3% 42×58 33 毁灭战士设计分析 一张颇具影响力的《末日世界》海报 Linguica 提供了以下关于《末日怪物》设计的有用设计思路： ...《毁灭战士2》的怪物很棒。它们几乎都沿着三个轴中的一个或多个轴增强玩法： 时间意识 - 发生了什么需要我立即解决的事情？ 即时空间意识 - 现在我附近有什么？ 一般空间意识 - 我所在区域的建筑布局如何，例如墙壁、建筑物等？ 《毁灭战士 1》的敌人是由我们今天所认为的 FPS 新手玩家设计的，对于他们来说，基本的移动和躲避已经足够具有挑战性，没有怪物会让事情变得更加困难。然而，作为一名更高级的FPS玩家，你在与他们战斗时最终会遇到哪些战术问题呢？除了陷入死胡同之外，几乎没有什么可以白盒你毫无挑战地无限期地风筝《毁灭战士》怪物。你会遇到的唯一问题是逐渐被霰弹枪手击中（士兵甚至不值得一提）或网络恶魔火箭的溅射伤害（我在这里将蜘蛛恶魔视为“正常”敌人，但实际上它基本上是一个巨大的速射霰弹枪手，所以无论如何）。 现在让我们看看新的《毁灭战士 2》怪物以及它们带来的好处： 这 链炮手 是一个“低级”敌人，即使是更高级的玩家也需要担心，因为尤其是集体，他们真的可以很快摧毁你。有一个 时间意识 因为如果您不尽快照顾它们，您的健康将受到严重损害。还有一个元素是 一般空间意识 如果您需要撤退到掩体后面。 这 曼库布斯 的偏移火球意味着你不能仅仅依赖于无意识地扫射炮弹，实际上需要注意它们，否则你最终可能会遇到炮弹。这牵涉到你的 即时空间意识 。 （你最终学会了左中右扫射的“Mancubus舞蹈”吗？那么恭喜你，游戏教会了你新的行为。） 这 蜘蛛管 的快速等离子体也牵涉到 即时空间意识 因为如果你来回扫射，你必须小心“过河”并在此过程中被击中。你认为 Mancubus 和 Arachnotron 在同一关卡中快速连续出现并且不包含其他敌人是巧合吗？我不这么认为。这两种敌人让你所做的不仅仅是《毁灭战士 1》中围绕单个火球进行简单扫射的标志。如果您还没有明白这一点，游戏会告诉您，这将不再起作用。 这 痛苦元素 是一个烦人的敌人，是的，但它纯粹是为了牵连你的 时间意识 ——它甚至不能直接伤害你！它对你的危险与你让它停留的时间成正比。 这 亡魂 再次强调，它的寻的导弹意味着你不能仅仅依赖于无意识地围绕射弹进行扫射，实际上需要注意它们，这涉及到你的即时空间意识，而且你还需要留意可用的掩护，这样你才能摆脱寻的火球，这涉及到 一般空间意识 。你甚至可以说这涉及你的 时间意识 ，因为如果你让大量的寻的火球积累起来，它们最终可能会立即杀死你。 （或者，也许，另一个敌人？？） 这 阿奇维尔 的火灾袭击强烈牵连到你 一般空间意识 和 时间意识 - 你需要知道掩体在哪里，并且你需要立即到达那里。此外，它复活死去的敌人的次要行为还涉及更多 时间意识 - 如果你把它放得太久，它就会回到你已经努力杀死的所有敌人。 这 地狱骑士 是唯一一个不会使游戏在战术上沿着这些轴线之一变得更深入的新敌人。它只是一个地狱男爵，而没有像真正的男爵那样战斗那么乏味。不过，这确实为地图绘制者提供了何时以及如何使用男爵的新选择，这是一件好事。 ——林吉卡上 2014 年 8 月 28 日主题“毁灭战士 1 还是毁灭战士 2？”在末日世界上 维恩图比较了各种《毁灭战士 2》怪物的“意识”标准尺度规范；通过林吉卡 ( 通过末日世界 ) 物品经济 弹药拾音器 小号 大号 默认弹药 怪物掉落 子弹 剪辑 (10) 子弹盒 (50) 手枪 , 链枪 (20) 僵尸人（5，或 Hard+ 上 10） 贝壳 4枚猎枪弹 (4) 霰弹枪弹盒 (20) 霰弹枪 (8), 超级霰弹枪 （8）（在 毁灭战士II ) 火箭队 火箭 (1) 火箭盒 (5) 火箭发射器 (2) 细胞 能源电池 (20) 能源电池组 (100) 等离子步枪 (40), BFG9000 (40) 来源 该页面使用的数据来自 末日维基 ，根据 CC-BY-SA 4.0 国际许可。 地图单位 - The 《毁灭战士》 Wiki 《毁灭战士》 尺度 作者：斯科特·安波克"
                  },
                  {
                      "href":  "process__blockout__metrics__modular.html",
                      "title":  "模块化套件设计",
                      "description":  "如何测量和设计建筑层级的模块化套件、3D 图块集",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/metrics/modular",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒",
                                          "标准尺度规范"
                                      ],
                      "searchText":  "模块化套件设计 如何测量和设计建筑层级的模块化套件、3D 图块集 当做一个 白盒 或 美术处理 ，你可能会使用 模块化套件 -- 3D 图块集 模块 ，网格设计为咬合在一起。这来自现实生活中的建筑实践 预制模块化建筑 . 如果您不熟悉 3D 建模或关卡设计，那么先不要尝试设计自己的套件。设计一个强大的套件需要考虑很多因素。您的第一个工具包可能会很难使用，特别是如果您还没有从使用其他人的工具包中学习的话。相反，请参阅我们的列表 资源 下载适合原型设计的免费预制模块化套件。 但如果您有关卡设计和 3D 工具经验，那么您就已经准备好了。在此页面上，我们将详细介绍设计您自己的模块化套件的许多注意事项和最佳实践。 此页面上的大部分信息来自 Joel Burgess 关于为大型开放世界游戏设计模块化套件的精彩 GDC 演讲： “GDC 2013：《上古卷轴5：天际》 的模块化关卡设计方法” ( 幻灯片 ）和 《GDC 2016：辐射 4 的模块化关卡设计》 ( 幻灯片 , 视频 ). 《上古卷轴5：天际》中“Dwemer 废墟”的核心建筑套件，由 Joel Burgess 拍摄 (http://blog.joelburgess.com/2013/04/skyrims-modular-level-design-gdc-2013.html) 在《《上古卷轴5：天际》》中使用 Dwemer 套件构建的示例地下城环境，由 Joel Burgess 拍摄 (http://blog.joelburgess.com/2013/04/skyrims-modular-level-design-gdc-2013.html) 1. 前期制作 您是否有大量的关卡设计师时间，并且需要多次重复使用有限的美术资源？ 规划装备百分比，首先决定什么是最重要的 该套件应该有多细/粗？取决于设计师需要/想要什么关卡，更多的定制还是更快的原型设计时间？ 2. 封闭套件 暂时不要制作变体，只需先构建基本部分 原型尺度规范 决定你的单位...按照人性化的规模建造 玩家大小与环境尺度图，图片由 Joel Burgess 提供 (http://blog.joelburgess.com/2013/04/skyrims-modular-level-design-gdc-2013.html) 常见模块类型 地板、天花板、墙壁、门口（单）、门口（双）、窗户、角落 平台（景观） 胶水 法兰和拱门（洞穴） 贝壳（洞穴） 用于《上古卷轴5：天际》中关卡白盒的“灰盒”模块化套件，由 Joel Burgess 拍摄 (http://blog.joelburgess.com/2013/04/skyrims-modular-level-design-gdc-2013.html) 定义足迹 留在足迹/边界框内 资产命名 注意命名，关卡设计师和套件艺术家需要就模式达成一致 Epic 推荐的命名方案？ 3. 标准尺度规范：对套件进行压力测试 不要仅仅停留在理想情况 碰撞是最大的问题之一，确保你不会被卡住？ 环回测试 堆栈测试 你能构建多层次的环境吗？地板不应该像纸一样薄，它们有像墙壁一样的厚度和质量 间隙测试 你们有足够的胶水用于斜角结构的内饰套件吗？对于隧道或洞穴套件至关重要 4.对套件做美术处理，制作变体 纹理变化有很长的路要走，而且“便宜”——您不必再次测试和验证模块几何形状 考虑构建一个可以轻松交换模块类型的工具，这将使美术处理和重新网格化速度更快 来源 正如本页顶部所述，此处的大部分信息来自 Joel Burgess 的两场精彩的 GDC 演讲，这是 必读 对于任何从事模块化建设的人： “GDC 2013：《上古卷轴5：天际》 的模块化关卡设计方法” ( 幻灯片 ）是“101”介绍性演讲，介绍了模块化套件设计注意事项，以及他们如何构建《辐射 3》和《上古卷轴5：天际》的关卡，同时避免《湮灭》中最严重的错误。 《GDC 2016：辐射 4 的模块化关卡设计》 ( 幻灯片 , 视频 ）是“201”中间谈话，详细说明了他们为《上古卷轴5：天际》的模块化套件所做的工作，并在构建《辐射 4》时进行了扩展。 进一步阅读 Lee Perry 的《模块化关卡和组件设计》 《游戏开发者》杂志，2002 年 11 月。《战争机器》(2006) 的首席关卡设计师撰写的一篇内容扎实的文章，是最早详细介绍模块化构造实践的游戏开发著作之一，这种做法直到 2000 年代初期才开始出现，当时基于笔刷的 CSG 构造开始不再流行。包含在这里主要是为了历史兴趣；比较 关卡设计师简史 ."
                  },
                  {
                      "href":  "process__blockout__metrics__quake.html",
                      "title":  "《雷神之锤》 尺度",
                      "description":  "用于设计单人 《雷神之锤》（ Steam ）1 地图的玩家尺寸和速度、生命值和伤害值、常见尺寸和建筑尺寸",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/metrics/quake",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒",
                                          "标准尺度规范"
                                      ],
                      "searchText":  "《雷神之锤》 尺度 用于设计单人 《雷神之锤》（ Steam ）1 地图的玩家尺寸和速度、生命值和伤害值、常见尺寸和建筑尺寸 以下是一些对《雷神之锤 1》关卡设计有用的核心游戏价值和数字。 有时，流行的模组会在社区中发展出新的设计规范。毕竟，自 1996 年 《雷神之锤》 发布以来，已经过去 25 年多了。我们注意到与默认零售未修改的 《雷神之锤》（“Vanilla 《雷神之锤》”）的差异。 有关尺度规范是什么以及它们为何有用的更多信息，请参阅 尺度规范 . 有关大量 《雷神之锤》特定信息和链接，请参阅 《雷神之锤》资源 . id Software 的 《雷神之锤》1 屏幕截图，有点像 1996 年的样子 核心玩家尺度 显然，雷神之锤使用了雷神之锤引擎。因此，主要的任何基本扩展和标准尺度规范建议 标准尺度规范 有关 《雷神之锤》谱系引擎（Source Engine 等）的页面也适用于此处。 1 个《雷神之锤》单位 (u) = 1 英寸，但实际上并非如此。没有一致的尺度。 Z轴向上 《雷神之锤》 使用“二的幂”网格。大多数制图者 白盒 网格大小为 64 或 32，然后向下移动到网格大小 16 或 8 以开始细化细节。仅对非常小的细节使用网格 4、2 或 1。 没有蹲伏、冲刺或+使用键/交互按钮。 玩家尺度规范 尺寸（长 x 宽 x 高） 碰撞船体尺寸 32×32×56 绝对最小走廊宽度 33 绝对最小天花板高度 57 ViewPos / 相机距地面的高度 46（24u 分钟范围 + 22u 视图偏移） 最大运行速度 320个/秒 坠落损坏高度* 256+ 绝对最大台阶高度** 18 最大可爬坡度** 45度倾斜？ 水下高度 29+（可以通过 武器技巧 ) 最大跳跃距离（跑步开始）*** 244 最大站立跳跃高度*** 43 坡道跳跃 *** 96高？ 手榴弹跳 *** ~320 长 - ~128 高？ 火箭跳 *** ~320 长 - ~128 高？ *如果玩家以任何高于 650 单位/秒的向下垂直速度撞击地面，则坠落伤害为 -5 生命值。实际上，这意味着坠落伤害很少会导致玩家死亡。要从高处杀死玩家，请创建一个 trigger_hurt 或 trigger_void （在某些模组中实现）。 考虑惩罚跌倒的玩家的其他方式（下面的怪物，或者水，粘液，熔岩），或者甚至只是让玩家跌倒，探索，然后再次找到回来的路。 ** 台阶高度和坡度假定正交（90 度）轴对齐表面。 《雷神之锤》 碰撞使用轴对齐边界框 (AABB)，没有真正的旋转支持，因此沿着对角线走上斜坡会感觉更陡。 最佳做法是使坡道和斜坡轴线对齐。 许多地图使用《毁灭战士》（ Steam ）风格的阶梯地形，而不是平滑的倾斜地形，部分原因是为了防止出现物理问题。怪物似乎也更喜欢它。 *** 跳跃距离和高度假定为典型玩家的绝对极限。 打造较短的跳跃距离/高度。大多数玩家没有完美的反应能力和时机。 不要强迫玩家在平台上进行坡道跳跃、手榴弹跳跃或火箭跳跃 主动线 ;为可选的捷径或秘密保留这些特殊跳跃。 熟练的玩家可以使用 兔子跳 增加速度和距离，在半空中改变方向等。但不用担心。让这些玩家破坏你的地图，没关系。 来自“的关卡的屏幕截图 幽暗地域超亮” (UDOB) 作者：马修·“卢纳兰”·布赖特 常见的 《雷神之锤》 搭建尺度规范 建筑元素 推荐/典型尺寸 天花板，低 64u 高，最低限度；更大的怪物不适合 天花板，常规 128u高；推荐最低值 天花板，高 256u+高 栏杆/桌面 32U高 通风管道 64u 宽，64u 高（没有蹲伏按钮） 走廊，常规 128u+宽 房间，小 256u宽 房间，中等 512u宽 房间，大 1024u+宽 坡道 1:2坡度（26.57°倾斜） 楼梯，简单 16 上升 : 32 运行 (1:2 坡度) 楼梯，密集 8 上升 : 16 运行 (1:2 坡度) 重力 800 单位/秒² 低重力 100 单位/秒²（在 E1M8“Ziggurat Vertigo”中） 玩家武器标准尺度规范 请记住，这是一款需要瞄准和躲避的动作游戏。实际伤害在很大程度上取决于敌人的行为、可用掩护、高度变化、敌人构成等。“每秒伤害”只是一个粗略的估计。 武器 最大弹药量 弹药/秒 损坏 输出功率 范围 传播/半径 斧头 -- -- 20 40 64u -- 霰弹枪 * 100 贝壳 -2.0 24（4x6） 48 2048u +/-4.4° 超级霰弹枪 * 100 贝壳 -2.8 56（4x14） 80 2048u +/-8.0° 钉枪 200 个钉子 -10.0 9 90 6000u -- 超级钉枪 200 个钉子 -10.0 18 180 6000u -- 榴弹发射器 100 火箭 -1.66 40-120 200 ～900u 160u 火箭发射器 100 火箭 -1.2 40-120 150 5000u 160u 迅雷 ** 100 细胞 -10.0 30 300 600u -- *霰弹枪有点复杂： 伤害是通过命中扫描分布来计算的；为了造成全部伤害，所有命中扫描都必须击中目标。 这 有效范围 远低于2048u。 经验丰富的《雷神之锤》玩家使用默认霰弹枪更像是手枪 因为它的射程较窄，火力较快，弹药成本较低。 ** 在水下发射雷电会导致爆炸，导致玩家死亡。这种“放电”会消耗所有细胞并造成 cells x 35 损坏。 100 个细胞，对敌人造成 3500 点伤害 任何可以在水下看到玩家的东西 ...包括玩家。 但如果玩家拥有无敌能力，他们就能生存。 在原版《雷神之锤》中，狭窄走廊中的人群控制比看起来更难——在死亡动画中，武器无法穿透怪物，爆炸性飞溅伤害也存在问题。最近的模组如 铜 或 奥术维度 修复这些错误。 集线器关卡的屏幕截图 奥术维度 ，作者：Simon \u0027sock\u0027 O\u0027Callaghan 等人 怪物标准尺度规范 雷神之锤 健康 损坏 船体（宽x高） 碰撞箱（宽x高） 腐鱼 25 3-6（咬） 32×56 32×48 罗威纳犬 （狗） 25 1-24（咬）， 10-20（跳跃） 64×88 64×64 咕噜声 （霰弹枪） 30 1-16（命中扫描霰弹枪） 32×56 32×64 僵尸 60+ 复活直到 碎尸 10（肉身射击） 32×56 32×64 骑士 75 12-18（剑）， 20-30（收费） 32×56 32×64 执行者 （激光） 80 15（激光射击） 32×56 32×64 斯克拉格 （传单） 80 9（射弹） 32×56 32×64 生成 （斑点） 80 10-20（跳跃）， 120（爆炸） 32×56 32×64 食人魔 （大佬） 200 4-12（电锯）， 40（手榴弹） 64×88 64×88 死亡骑士 250 20-36（剑）， 9 x 6（螺栓） 32×56 32×64 恶魔 （跳线） 300 40-50（跳跃）， 10-15（爪） 64×88 64×88 沃尔 （蜘蛛腿） 400 40（“Voreball”归巢射击） 64×88 64×72 尚布勒 （大毛茸茸的） 600 + 50% 防爆 10-30（闪电，范围：600）， 80-120（爪） 64×88 64×88 怪物碰撞 雷神之锤有两个碰撞系统。 QBSP 烘焙 碰撞船体 用于基本的运动剪辑（实体与世界碰撞），然后还有 命中框 对于移动物体（实体与实体碰撞）。两种碰撞类型都使用无法旋转的 AABB（轴对齐边界框）形状。 世界碰撞外壳尺寸共有三 (3) 种： 船体 0：1x1x1 （“点”如射弹、导弹） 但导弹的 命中框 是 32x32x32 （通过 movetype FLYMISSILE / BOUNCEMISSILE ) 在游戏中，导弹甚至不使用这个船体，而是穿越 BSP 船体1：32x32x56 （“小”玩家，类人生物） 船体2：64x64x88 （大型怪物） 同时，每个怪物的碰撞箱大小略有不同，并列在上表中。 建议：如何避免陷入困境 允许超出怪物大小的额外空间，否则它将难以移动： 距地面至少 16 个单位/距墙壁 16 个单位。 将怪物稍微放置在空中是很常见的。 一般来说，放置怪物 至少在空间中 双 它们的宽度和高度 . 例如，食人魔 (64 x 88) 在宽 128+、高 176+ 的房间中效果更好。为了便于施工，通常将房间高度向上舍入为增量 64 (192, 256)。 Fiends 和 Spawns 跳跃很多，肯定需要 128+ 高的房间，最好是 256。 但有时怪物移动越少越好，这完全取决于关卡。 吉宾 吉宾 当怪物同时受到大量伤害时就会发生这种情况。如果他们的生命值足够快地下降到某个负阈值以下，那么他们就会变成“gib”碎片，而不是播放死亡动画。这通常仅在玩家使用爆炸性武器（榴弹发射器、火箭发射器）或四倍伤害加电时才会发生。 在原版《雷神之锤》中，这个机制只对僵尸重要，僵尸会自我复活，除非它们在一帧内失去所有生命值（60）并被撕成碎片。同样，玩家通常需要炸药或四轮手枪来永久杀死僵尸。 内讧 内讧 当怪物伤害时发生 不同的 怪物类型，这会导致受伤的怪物以其他怪物而不是玩家为目标。 例如，当食人魔的手榴弹不小心伤害了恶魔时，恶魔就会转身攻击食人魔。但如果一个执法者的激光击中另一个执法者，就不会发生内斗。 仅限近战的怪物永远不会引起内讧。只有远程怪物可以。 减少内讧 更多内讧 只是近战或远程类型 混合近战和远程类型 怪物更少，种类更少 更多怪物，更多类型 提升/束缚远程怪物 将远程怪物保持在地面水平 分散怪物 将怪物紧紧地包裹在一起 开阔的空间 空间较小，有阻塞点 频繁的内讧会让遭遇战感觉过于轻松和不平衡。但有时内讧会让战斗变得更有趣。这一切都取决于。 可以将您的地图设计为 要求 通过放置更多怪物/更少弹药来发生内讧。然而，平衡这些类型的战斗谜题是很复杂的。确保给玩家设定一个明确的期望，即需要内讧，否则玩家会困惑为什么没有足够的弹药。我们建议仅针对困难模式设计这些情况。 技能关卡/难度关卡 《雷神之锤》有 4 个难度关卡： skill 0 “容易”， skill 1 “正常”， skill 2 “难”，以及 skill 3 “噩梦”。 一般来说，生命值和伤害不会随着难度关卡自动调整；技能0-2依赖于地图制作者手动调整怪物数量和物品。 技能 3 噩梦是个例外，它会强制执行一些代码关卡的更改： 1996 年香草噩梦： 更快的怪物攻击速度/频率 不太可能击晕怪物（进入“痛苦框架”动画） 蹒跚闪电的持续时间延长 33%，最多造成 40 点伤害 Vore 球移动速度加快 40% 2021 年重制 / 铜梦魇 : 所有 1996 年噩梦特定的更改均已恢复；困难现在与噩梦相同 除了玩家的最大生命值现在为 50 而不是 100 项目标准尺度规范 弹药 获取弹药的方式有3种：拾取弹药 项目 , 拾取一个 武器 ，或拿起一个 掉落 来自死去的怪物。 弹药拾取/掉落 来源 类型 金额 item_shells 项目 贝壳 +20（大：+40） 武器_霰弹枪 武器 贝壳 +25 武器_超级霰弹枪 武器 贝壳 +5 怪物咕噜 掉落 贝壳 +5 物品尖峰 项目 指甲 +25（大：+50） 武器钉枪 武器 指甲 +30 武器_超级钉枪 武器 指甲 +30 项目火箭 项目 火箭队 +5（大：+10） 武器榴弹发射器 武器 火箭队 +5 武器火箭发射器 武器 火箭队 +5 怪物食人魔 掉落 火箭队 +2 项目单元格 项目 细胞 +6（大：+12） 武器_闪电 武器 细胞 +15 怪物执行者 掉落 细胞 +5 所有弹药物品拾取都可以标记为“大”，这使它们提供的弹药加倍。 碎尸（gib） 的怪物不会掉落弹药。 陆军步兵死于 2 次霰弹枪射击，但掉落 5 发炮弹，导致 +3“利润”。如果您在关卡中使用大量此类怪物，请相应地平衡您的 item_shell 数量。 食人魔会死于两枚火箭，但也会掉落两枚火箭，因此"
                  },
                  {
                      "href":  "process__blockout__playtesting.html",
                      "title":  "试玩测试",
                      "description":  "如何运行试玩测试，然后收集/分析数据",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/playtesting",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒"
                                      ],
                      "searchText":  "试玩测试 如何运行试玩测试，然后收集/分析数据 一个 试玩测试 就是当有人玩你的关卡时，你会观察你的关卡是否有效。 试玩测试是游戏设计中的一项基本技能和流程。你应该做试玩测试。 不过，为什么要做试玩测试呢？ 试玩测试是指您见证自己的关卡是“有趣”还是无聊、清晰还是令人困惑、愉快还是烦人。如果玩家讨厌你的关卡，你应该尽快解决这个问题。 “尽早且经常进行试玩测试。” 关卡设计需要很长时间，在项目过程中失去动力是很自然的。当你看到其他人尽管心存疑虑却在享受你糟糕的破碎的半破碎的地图时，与其他人一起进行试玩测试可以增强你的能量。 商业游戏行业非常重视试玩测试，他们会执行许多阶段的测试，例如用户研究、质量保证、测试市场、可用性、认证等。最大的游戏公司甚至运营自己的专门试玩测试实验室。 工业级用户研究可用性实验室的照片 Experience Dynamics ;试玩测试实验室类似（但更丑） 试玩测试形式 每个试玩测试都有不同的目的，具体取决于受众。 自我试玩测试： 测试你自己的关卡。 作为设计过程的一部分，您应该每天自己测试自己的关卡 适合发现明显的问题（关卡是否有负载？门口是否足够宽？） 评价： 其他人（通常是游戏开发人员）会测试你的关卡，然后为您提供丰富的反馈。你们甚至可以进行一次对话，集思广益如何解决问题。 理想情况下，在每个阶段之后执行此操作：在布局、草图、脚本编写和美术处理等之后。 这是大量学习和协作发生的地方，这在工作场所很常见 适合帮助你处理 “棘手问题” ——问题太复杂了，你甚至无法描述问题，更不用说解决它了 公开试玩测试： 其他人（最好是“普通人”/公众，而不是开发人员）对关卡进行试玩测试。 观察他们的行为比他们的反馈更重要 对于发现隐藏的问题（“未知的未知数”）非常重要 但普通人很难进行试玩测试白盒，你可能必须先通过艺术测试 \"Blind\" playtest: 公开试玩测试，但很少有指导或提示；假装他们正在独自玩关卡，看看他们会做什么 各种人在一个地方玩测试游戏的照片 纽约大学游戏中心的“星期四试玩测试”活动 大约2014年 如何寻找试玩测试者？ 评价： 如果想获得评价和反馈，可以加入线上 关卡设计社区 ，最好是在该类型或游戏引擎方面具有特定经验的论坛或 Discord。 如果可能的话，尝试进行现场试玩测试。看看有没有本地的 国际游戏开发者协会 (IGDA) 分会 和/或独立游戏开发者聚会。 您需要具有足够游戏设计经验的人来适当地结合他们的反馈——这些人知道如何审视未完成的系统、明显的错误或占位符艺术，并找到设计核心的真正问题。 公开试玩测试： 把你的关卡摆在朋友或家人面前，他们通常在社交/情感上有义务参与您的兴趣。 如何组织一次试玩测试 运行试玩测试会话的方法有很多种。 下面是一次 现场公开试玩测试的一般流程： 1. 准备试玩测试 在进行试玩测试之前，您应该弄清楚您要测试什么！将其视为科学实验——形成假设并设计程序。 这是基本的试玩测试准备清单： 范围： 您正在测试多少游戏/关卡？它需要多长时间？ （例如：“第 2 级的上半场，最多 15 分钟”） 重点： 哪些部分最需要测试？您最大的问题是什么？ （例如“关卡出口够清晰吗？boss太难了吗？”） 简介： 您会给试玩测试人员什么指示？有内容警告吗？ （例如“使用 WASD 移动，但不要按空格键，我还没有修复跳跃......哦，游戏有蜘蛛，你可以接受蜘蛛吗？”） 数据： 您正在收集什么数据？你将如何收集它？ （例如，使用秒表应用程序来计时他们到达老板 #1 需要多长时间） 注意事项： 您是否正在做笔记/记录观察结果？如何、在哪里？ （例如用笔在笔记本上写笔记...哦不，我忘了带笔！...） 2. 简短的试玩测试 简要介绍一下概念以及试玩测试会话将运行多长时间， 设定一些基本期望 尊重试玩测试者的时间和精力。如果试玩测试会话可能包含跳跃恐慌、蜘蛛或昆虫、闪烁或闪烁的灯光、性内容或图形/露骨暴力，则给予 内容警告 并征得玩家的知情同意。 您还可以告诉试玩测试人员您想要反馈什么，并为试玩测试设置一些基本界限和重点。如果你的试玩测试者是一位设计师，那么更具体的简报会非常有帮助，这样他们就可以调整他们的反馈。 简报示例： “使用 WASD 和鼠标...玩得开心” “我正在寻找战斗想法，告诉我这些遭遇战是否有好处” “我还没有通过美术关卡，所以只关注布局，这些都是占位符” “尝试多使用二段跳，我想看看它是否适合这个关卡” “布局是最终的，出于预算原因我们无法更改它，所以请只向我提供有关敌人放置和拾取的反馈” 但请保持简短。 不要过于简短，也不要过多关注免责声明，特别是当您正在让其他开发者进行试玩测试时。作为设计师，我们经常对我们的工作将如何被接受感到不安全或焦虑，但我们理解您的关卡将是未完成的或正在进行的，到处都是占位资产和错误。 3.O bserve 试玩测试/收集遥测数据 大部分时间应该花在观看屏幕上，记录玩家的行为、反应或任何需要修复的问题。确保在试玩测试者身后近距离观察，不要只是在他们的肩膀上呼吸。 请随意询问关于试玩测试者的行为或思维过程的简短澄清问题，但不要为了道歉或解释而中断试玩测试。每当试玩测试出现问题时，就让这种不适和焦虑在你的脑海中酝酿一段时间。然而，如果试玩测试人员确实被卡住了或者关卡明显已经被破坏，那么就继续进行干预。 如果不是现场试玩测试，则要求测试人员录制屏幕并发送视频上传的私人链接。或者更好的是，试玩测试人员可以播放私人直播并通过聊天或语音回答问题。对于多人游戏地图，最好要求现有的玩家组、服务器或部落在地图上玩并允许观察员。 收集数据/遥测 跟踪基本统计数据，例如游戏时间、死亡人数、获胜百分比等。大多数统计数据收集不需要任何特殊的插件或工具，只需细心记笔记即可。 有些游戏可以自动聚合玩家数据并可视化模式，尤其是多人游戏地图。玩家是否在狙击手地图上过于频繁地使用霰弹枪，或者是否有太多玩家在重生室外死亡？ 遥测 自动收集的数据发送到统计服务器，该服务器可以跟踪玩家行为并在表格/电子表格中显示数据。遥测类型包括： 数据表 与 战斗 最常见武器、进度或装备的统计数据 热图， 自上而下的可视化显示玩家经常移动、赚取积分、击杀或死亡的位置。 （TODO：热图示例） 4. 汇报试玩测试员 寻求反馈并向试玩测试人员汇报。 为试玩测试者准备一些调查问题。你可以提出理解性问题（“你注意到门上方的橙色灯光了吗？你认为这意味着什么？”）或询问更主观的意见（“boss 战斗感觉容易还是困难？） 善待并尊重你的试玩测试人员，即使他们给你的反馈是你不一定想听到的。如果有人善意地提出建议，无论如何，请微笑并优雅地接受。该建议本身可能不是一个设计问题的糟糕解决方案，但该建议的原因以及它强调的问题几乎总是真实有效的。 但还要记住，试玩测试会话并不是为了测试人员的利益。如果试玩测试者有有害的态度或给出辱骂性的反馈，特别是在面对面的试玩测试会话中，那么您完全可以结束试玩测试并要求他们停止游戏或说话。 5. 分析试玩测试数据 试玩测试后，您需要弄清楚到底发生了什么以及您将采取什么措施。 “我们在工作室进行了大量的试玩测试，并且我们有非常好的遥测工具来记录试玩测试的数据，以便我们在事后进行分析。 此遥测数据 [如下图] 来自预发布的 20 名玩家试玩测试。 [...] 底部数字显示每行不同的盔甲套装，但从左到右的日期不同。这些让我看到了装备受欢迎程度的模式、游戏中哪些地方受欢迎、玩家使用同一装备的时间、何时切换……我使用这些图表来识别可能不健康的体块。 ...在游戏开始时，可​​用的盔甲不多，所以每个人都使用前三个中的一个[...]但是这里发生了什么？很多人都坚持穿着这件阿尔夫海姆盔甲。这是我应该调查的事情吗？ （剧透，我们确实削弱了阿尔夫海姆装甲……）因此，我们需要查看数据来强化您的期望，以实现健康的传播。” ——罗布·迈耶， “清算命运：诸神黄昏规模的战斗设计”(2023) (YouTube) 来自《战神：诸神黄昏 (2022)》20 人试玩测试的玩家进度遥测数据，来自 Rob Meyer 的《命运的清算：诸神黄昏规模的战斗设计》（2023 年）（来自 YouTube） 如何成为对其他人有用的试玩测试员 试玩测试的目标是帮助设计师预测他们的游戏是否适合受众。这与玩家的表现无关。留意这些常见倾向： 游戏/游戏开发新手： 太“友善”，不会用语言表达问题或挫败感 游戏玩家： 太挑剔、夸大小问题、表现太多 批评设计师同事的最佳实践 简报 如果您不熟悉该类型或设计风格，请说出来。 问“你想要什么反馈？” 问“在开始之前我应该知道什么？” 演奏 大声思考 ，尝试说出你不断思考的事情。没有人能读懂你的心思。同时，如果开发人员忽略您所说的话，请不要生气。 不要挑剔 除非开发人员要求你这么做。 如果你破坏了游戏，请告诉开发人员，然后继续 。除非开发人员要求您重复破坏游戏进行分析，否则不要继续以同样的方式破坏游戏——不要试图让开发人员难堪或羞辱。 诚实地表达你的情绪。 如果你喜欢某件事，就说出来。如果有什么事情让你感到困惑或惊讶，请说出来。 汇报 说一下是什么 难忘的 对你来说，无论是积极的还是消极的。 提出问题 关于意图和计划的解决方案，将其变成 谈话 . 试玩测试流程示例 Valve 的试玩测试 在 Valve Software，关卡设计师每周五都会对各种不同的试玩测试人员类型（设计师同事、非设计师、非开发人员，有时是“开放”公开测试）进行试玩测试。试玩测试是他们设计流程的基础，每周都会推动他们做出许多决定。阀门液位设计师 Phil Co 讨论了他们的流程： 在 Valve 的一个典型项目中，阴谋集团（团队的较小子集，由 6-8 人组成）每周工作一次。每个星期五，我们都会与团队外部的人员（甚至是公司外部的人员，具体取决于我们的进展情况）一起测试我们负责的游戏部分。 我们本周所做的一切都集中在周五的试玩测试上。 [强调] 周一，我们召开会议，决定试玩测试的目标以及每项任务的负责人。 [...] 你可能必须设计一个需要程序员参与的新机制的原型，或者你可能必须执行一个涉及你关卡的美术处理，其中需要一名艺术家。 来自 GDC 2009 演讲“Valve 的试玩测试方法”的幻灯片，作者：Mike Ambinder（来自 gdcvault.com ) 然而，我们从试玩测试中学到了一切，因此我们可能会过多地了解一种特定的玩法，而试玩测试者会感到疲劳。我们通过多种方式纠正这个问题。 例如，在《半条命 2》（ Steam ）第 2 集中，玩家在桥上获得汽车，我们决定添加一个战斗高潮时刻。获得汽车的大部分关卡都是战斗，但一次只有几个敌人。它被设计成僵尸游乐场。我们添加了您可以打开屋顶板的建筑物，以便 Alyx 可以根据我们的试玩测试反馈帮助您使用狙击步枪。 ——菲尔·科，来自 “构建关卡：Valve 关卡设计师 Phil Co 的独家专访”(Interlopers.net) ，大约2013年 《半条命 2：第二集》中“僵尸狙击游乐园”部分的屏幕截图，根据试玩测试反馈进行了改进（屏幕截图来自 闯入者网 ) 玩家数据和分析 https://twitter.com/MonsterclipRSPN/status/1268371601348685826 https://www.youtube.com/watch?v=Ij2nmt3EuJY 有关试玩测试的进一步阅读 GDC 2009：“Valve 的试玩测试方法” ( 幻灯片来自 gdcvault.com ，免费）由 Mike Ambinder 撰写，是基础行业文本，涵盖试玩测试基础知识。 Ambinder 概述了 Valve 的核心面包和黄油“直接观察”和迭代流程，这对于普通关卡设计师来说绝对是最有帮助的事情。有两个重要的历史记录：（1）数据科学/遥测现在在行业中更加重要，（2）像心率监测/脑电波记录/眼睛注视跟踪这样的生物识别技术在行业中很少见，其他工作室认为这对于"
                  },
                  {
                      "href":  "process__blockout__playtesting__persona.html",
                      "title":  "玩家画像",
                      "description":  "对玩家及其动机/长期行为进行分类的不同方式",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/playtesting/persona",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒",
                                          "试玩测试"
                                      ],
                      "searchText":  "玩家画像 对玩家及其动机/长期行为进行分类的不同方式 什么是玩家画像？ 一个 玩家画像 是玩家玩游戏的长期行为模式和总体动机。 将玩家分类为不同的画像/类别可以帮助你研究玩家并解释 试玩测试 数据。 事实上，玩家从来不只是一类。人是所有这些动机以及更多动机的复杂组合。 尽管如此，这种简化的简单性对于做出设计决策和想象受众是有用的。理想情况下，每个关卡都能照顾到每类玩家画像。 （TODO：进一步充实这一点） 游戏风格与玩家画像 惠津加的政治游戏 玩家 骗子 破坏运动 巴图的“游戏玩家心理学” 1996年 玩家心理巴图测试 是对视频游戏玩家进行分类的最早尝试之一。 Bartle 正在研究早期基于文本的 MMO 游戏中的玩家行为。 MUD ，并将所有这些 MUD 玩家分为四大类： 成就者 想要获得最多分数，最大化游戏进度 探险家 想要发现新的地方或系统，绘制游戏空间 杀手 专注于 PvP/与其他玩家的竞争冲突，有时是不公平的 社交达人 注重与其他玩家的合作、角色扮演和粉丝文化 （TODO：包括 4 象限矩阵图像）"
                  },
                  {
                      "href":  "process__blockout__wayfinding.html",
                      "title":  "寻路与引导",
                      "description":  "玩家导航，如何“引导”玩家通过关卡",
                      "originalUrl":  "https://book.leveldesignbook.com/process/blockout/wayfinding",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏠 白盒"
                                      ],
                      "searchText":  "寻路与引导 玩家导航，如何“引导”玩家通过关卡 什么是寻路？ 寻路与引导 当玩家找到自己在关卡中的位置时 （方向） 和/或找到通往目的地的路线 （导航） . 大多数关卡设计师的目标是让玩家以“沉浸式”的心情“自然地”在游戏世界中找到出路，尽量减少迷失方向或挫败感，同时与设计师的意图相一致 主动线 （s）。这种风格平衡了自然主义、合理性和微妙性。但更常见的情况是，目标是表现出虚假的微妙之处——看似微妙的有用细节（对某人、某处？），但实际上对大多数玩家来说非常明显。 （视频嵌入？） 寻路与引导 数十年的行业关卡设计师正统观念声称，关卡设计的目标是操纵/欺骗玩家，让他们“感觉自己很聪明”，同时“下意识地”遵循主动线......对此，我们说： 不，停下来！我们能不能放弃这样的想法？ 欺骗并不是与玩家建立联系的有效方式，并且对玩家实际玩游戏的方式构成了错误的心理理论： 玩家常常会回避被感知到的 主动线 有目的地探索侧面区域并按照自己的节奏在游戏中取得进展。在开放世界和多人游戏中，玩家反复非线性地穿越同一空间，没有一个静态不变的目标始终引导他们前进。有时玩家只是想忽略玩法并放松一下，在虚拟空间中闲逛，与朋友共度时光，甚至破坏游戏并上传愚蠢的愚蠢视频。 这些都是有效的玩法。让我们远离关于秘密控制玩家的奇怪（和令人毛骨悚然）的规定性设计师幻想，以我们想要的方式玩。 （图片） 相反，可以这样想： 我们正在与玩家共同创造游戏体验，我们的目标是提供工具和信息来帮助他们使用我们的关卡。 有时留在主动线上很有趣，有时忽略它也很有趣。有时拥有大量信息很好，有时拥有很少信息更好。有时，一组狭窄的解决方案可能会让人感到沮丧或做作，有时限制选项可能会带来更好的体验。 我们认为，玩家引导是理解人们如何使用关卡和虚拟空间的一种有缺陷的方式。 “指导玩家”未能解释玩家如何构建自己的游戏。同时，寻路是建筑和可用性设计领域的标准术语，强调玩家的代理（寻路）和积极的共同创作 动线 . 寻路理论 人们在建筑、环境心理学、行为地理学和设计领域进行了大量研究，探讨人们如何驾驭空间。虽然人类穿越虚拟空间的方式显然与现实世界空间不同，但我们希望/想象心理过程是相似的。 心理学 人形 心理地图 在概念上表示一个空间。 路径 - 用于移动的道路 边缘 - 定义边界和连续性中断的道路 地区 - 具有相似特征的地区 节点 - 道路的强交叉点，如广场或交叉路口 地标 - 用于点引用的易于识别的实体，通常是物理对象 短期记忆与长期记忆 航位推算/路径整合 是一种在没有可用地标时猜测和跟踪您所在位置的方法。您可以通过 (1) 确定起始位置，以及 (2) 沿着您的移动方向、速度和行进时间进行推断来估计您的当前位置。在无线电和卫星出现之前，水手和飞行导航员严重依赖航位推算计算，甚至你的手机也经常使用运动传感器和航位推算来估计其位置——但即使没有数学或技术，人类和动物也经常使用松散的直觉推算。 凯文·林奇的城市形象 策略 跟踪：依靠道路上的方向标志 路线跟随：遵循给定的规则，例如旅程开始前预先计划的路线 受过教育的寻求：利用过去的经验得出关于该去哪里的逻辑结论 推论：应用事物现状的规范和期望 筛选：系统地搜索该区域以寻找有用的线索，尽管很可能没有任何线索 瞄准：找到一个可感知的目标并朝该特定方向移动 地图阅读：使用便携式或固定式地图并帮助用户定位自己 指南针：用象征性的指南针为自己导航，例如太阳或地标的位置 社交导航：跟随人群并学习其他人的行为 标牌理论 来源 https://fabrikbrands.com/the-wonders-of-wayfinding-design/ 信息性：这些提供有关用户所在位置的有用信息，例如免费 WiFi、开放时间等。 定向：顾名思义，这些用箭头指导用户，无论出于何种目的，该走哪条路。这些最常见于用户必须做出路线决定时的路口。 识别：为了帮助用户识别他们当前所在的位置，可以在建筑物、公园等的入口处放置识别标志。它们象征着到达目的地。 监管：这些让人们知道在特定区域可以做什么和不能做什么，并且最常被使用负面措辞，目的是创造一个安全的环境。例如“禁止吸烟”或“禁区”。 例如，当玩家走出《半条命 2》（ Steam ）中的介绍性火车站时，他们会看到一个具有深度构图的戏剧性城市景观，突出了城市中心的城堡塔。为了让玩家注意到这个重要的地标，Valve关卡设计师将门框向外指向城市广场，伴随着一群鸟突然向上飞翔。 此示例强调了场景构图的三个准则： 除非有什么东西吸引了玩家的注意力，否则玩家不会向上看。 玩家看着他们移动的方向。 玩家注重对比（颜色、形状、灯光和运动）。 寻路辅助工具 下面是向玩家传达导航信息的各种方法的表格，从顶部非常微妙的方法开始，一直到底部非常明显的引导方法。如果可能的话，从顶层开始，逐渐采用不太微妙的方法来应对 试玩测试 . 一个 寻路辅助工具 是任何可以帮助玩家导航去哪里以及如何理解空间的东西。 正面强化，吸引玩家靠近。 负强化，知道 你不能去的地方 去理解 你可以去哪里。 我们按照“%确定性”组织了下面常见的寻路辅助工具——对可能感知和使用辅助工具的玩家比例的非科学估计。 微妙（1-20% 确定性） 微妙的寻路辅助工具最好与其他更可靠的寻路辅助工具重叠作为额外的细节/抛光。或者，仅使用这些方法让一个区域对于一小部分玩家来说更加独特或特别（例如，一个非常秘密的房间）。模糊的轻推。 方法 示例 % 寓言 对现有地点、游戏或关卡的娱乐或致敬 （例如《初学者指南》的介绍是对 de_dust 的致敬） 1% 世界建设 、建筑模式 例如城堡的底部有地牢，有钱有势的人住在中间深处/后面/顶部......现代房屋通常有卧室，附近有套间浴室 4% 关注 NPC 以下人形 NPC 或周围野生动物暗示的目的地（例如《半条命 2》中的鸟类、《变形金刚》中的微粒、《上古卷轴5：天际》中的狐狸） 7% 不寻常的细节 地面或墙壁上的细微裂缝（塞尔达），明显使用目的不明的游戏元素（例如没有任何影响的爆炸桶） 10% 声音设计 环境声音（例如听到远处的流水声）、音乐的动态使用（例如进入危险区域时听到紧张的音乐） 15% 类型学 例如射击关卡中的大房间充满了掩体，但还没有敌人，或者房间的结构就像是 Boss 竞技场 20% 粗略（35-60% 确定性） 粗略的寻路方法依赖于玩家的先验知识或对常见关卡设计模式的熟悉程度。常见于具有探索幻想的“电影”或“沉浸式”游戏。使用这些方法来补充主动线，或标记可选资源或辅助路由。一个建议。 方法 示例 % 构图 , 视线 密集的细节簇需要近距离检查，稀疏的天空盒几何形状需要避免，远处的高大地标具有宽阔的视线，窗户框架特定的视图 35% 灯光 , 颜色 灯光位置暗示的路径（《求生之路》）、明显照亮的入口和出口、颜色对比（例如深橙色景观中的亮蓝色门） 40% 世界内的标牌 世界内的标志和标语牌； 很容易被误认为是不相关的布景 40% 玩家比喻 例如瀑布隐藏着宝藏，或者爬上塔楼以获得奖励 45% 环境故事讲述 地板上的血迹（《毁灭战士》（ Steam ））、破坏痕迹（《生化奇兵》）……由角色或事件形成的清晰的创作路径 50% 地面成分 延伸出壁架的木板（神秘海域）、火车轨道（军团要塞 2（ Steam ））、粗糙的壁架标记（古墓丽影）……清晰的游戏功能 55% 重复 在类似情况下重复使用先前的元素，直接唤起玩家的记忆和模式识别 60% 情境（70-93% 确定性） 情境寻路方法会让人感觉关卡设计师强烈敦促玩家遵循某个路径或方向，但并不强迫玩家这样做。这些方法包括临时摄像机控制、情景 UI 弹出窗口、直接威胁以及对玩家进度的直接好处。重重一推。 方法 示例 % 脚本序列 友好的 NPC 直接引导玩家（半条命 2）、带方向的画外音、突然爆炸等。 70% 资源、物品、面包屑路径 一排收藏品或强化道具（大金刚国度）、远处可见的收藏品或强化道具（“威尼”）、宝箱等。 80% 过场动画 脚本化的剖面镜头镜头显示一扇新解锁的门（塞尔达）...假设玩家实际上正在观看，而不仅仅是检查手机或跳过过场动画 90% 动态世界 UI / HUD 发光 GPS 路线（侠盗猎车手 5）、动态路标（黑手党 3）、ping（Apex 英雄（ Steam ））、替代视觉（蝙蝠侠阿卡姆游戏中的“侦探模式”） 92% 主动威胁 敌方 NPC 主动攻击玩家，被仇恨的 NPC 发出吠叫声，引起危险的注意 93% 同样，这些方法不能保证玩家的特定行为。 例如，假设一个房间有两个出口：1 号出口和 2 号出口。 2号出口前有很多敌方NPC。玩家会跑向这些敌人来与敌人交战，从而首先被吸引到 2 号出口吗？或者这些敌人的危险和威胁会将玩家推向 1 号出口？如果 1 号出口类似于一扇上锁的门，而玩家的钥匙为零怎么办？ 预期的“信息”和由此产生的行为将在很大程度上取决于玩家当前的健康状况和资源、之前的遭遇战和模式、整体关卡节奏等。 但 93% 的玩家可能会明白以下内容：那些敌方 NPC 守卫着 2 号出口，而 2 号出口可能是主动线的一部分，在某些时候玩家可能想要更仔细地检查 2 号出口。 直接（95-98% 确定性） 尽可能地告诉玩家“你不能去这里”。静态、始终在线、永久的游戏元素，玩家可以明确地相信它们是游戏设计师的声音。一堵厚实的、坚固的、牢不可破的墙是敦促玩家“不要穿过这堵墙”的好方法，因为他们实际上不能……除非玩家是速通者，或者玩家正在试图寻找秘密，等等。 方法 示例 % 静态深宽障碍 深坑、峡谷、熔岩、河流等物理上阻碍运动但不阻挡视线的物体，无法被破坏或桥接 95% 始终在线的全局 UI / HUD 目标标记（使命召唤）、目标箭头（生化奇兵）、屏幕上的目标文本、带有图标的小地图... 有时“放弃”也是可以的 97% 静态硬屏障 物理上阻碍行动和视线的墙壁、栅栏、防御工事无法被摧毁 98% 寻路建议 请注意，其中一些导航辅助工具是无法避免的，有些甚至有点超出您的控制范围。那是因为 游戏中的所有内容都是寻路辅助工具 ，一切都在引导玩家在空间中发挥作用。墙让玩家绕着它走；楼梯保证了上方或下方的另一个空间。一切都是玩家接收到的信息，所有这些信息都根据他们的心情而不同程度地变化，而且没有一个是万无一失的。与任何其他信息一样，这些导航辅助工具都可能被误解、忽视或忽略。 我们在下面更详细地讨论其中一些寻路辅助工具： 地面构成 TODO：从 David Shaver 的演讲中获取一张幻灯片 标牌 CS:GO 讽刺炸弹现场标志...一些涂鸦非常微妙，可能效果不是很好 面包屑导航 高度依赖于流程？...也许把它放在流程或遇到部分我认为 审查 寻路与引导 是提供导航帮助以了解水平面的做法 布局 。我们敦促关卡设计师拒绝“引导玩家”的概念——相反，我们认为玩家以多种方式玩游戏，从而引导自己。强大的寻路设计可帮助玩家构建思维导图，从而更有效地导航和使用关卡。 寻路对玩家来说有很多意义： 向玩家展示“他们应该做什么”，让他们遵循预期的作者 主动线 进步 与玩家建立信任，承诺游戏世界经过精心设计，并通过一致的导航模式保持可读性 展示传统工艺和生产价值 反对寻路 但是如果玩家不想遵循“他们应该做的事情”怎么办？或者，如果您不想与玩家建立信任，或者您不关心传统工艺和最佳实践怎么办？ 大量使用地标、路标和面包屑导航，会让关卡感觉像是 迪士尼乐园 。在许多情况下，这种受控幻想/“安心架构”的感觉可能是令人向往的。主题公园的假森林、假荒野是常见的，也适合典型的商业动作冒险题材游戏。 然而，如果需要真正的荒野感，那么设计可能需要某种反寻路功能。理想情况下，自然而狂野的空间不应该给人一种设计的感觉。如果一个完全未受破坏的地方的想法对于该项目至关重要，那么路标和面包屑就会让人感觉不自然，并损害地方感和真实性。 您的个人住所或家有地标和标牌吗？当然不是——个人导航和记忆的私密性使这个家属于您。相比之下， 迪士尼乐园 不宜居住。 没有人"
                  },
                  {
                      "href":  "process__combat.html",
                      "title":  "🔫 战斗",
                      "description":  "设计玩家和/或 NPC 之间的身体冲突",
                      "originalUrl":  "https://book.leveldesignbook.com/process/combat",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS"
                                      ],
                      "searchText":  "🔫 战斗 设计玩家和/或 NPC 之间的身体冲突 什么是战斗设计？ 战斗设计 是关于为玩家和通常由人工智能控制的敌人之间的身体冲突制作游戏系统。 在关卡设计中，我们通常假设这是第一人称射击游戏或其他实时 3D 动作游戏的战斗。本书也将做出这样的假设。 注意竞争 玩家对玩家 (PvP) 功能与单人/合作游戏非常不同 玩家与敌人 (PvE) 战斗。 PvP 通常意味着所有战斗者都有公平的获胜机会。相比之下，PvE 提供延迟但有保证的胜利。这是向玩家做出的两个截然不同的承诺，因此关卡设计也不同。 如果事实上您不选择暴力，那么请直接跳到了解 布局 . 《毁灭战士》（ Steam ）(1993) 的屏幕截图，一款早期的第一人称射击游戏，如今普及了许多战斗设计模式 战斗系统 制作格斗游戏时，您有两种选择： 修改现有的战斗游戏。 从头开始构建您自己的战斗游戏。 没有良好的战斗系统，你就无法取得优秀的战斗关卡。但开发这个核心战斗工具包需要大量的代码、美术、动画、音频和调整。 这是一个复杂的主题，超出了The Level Design Book 中文版的范围。问“如何打好战斗？”就像问“如何制作一款好游戏？”这是一个大问题。 这就是为什么我们强烈建议进行改装：这样，您就可以重复使用游戏中已经经过验证的核心战斗系统，而无需构建自己的系统。 有关推荐修改和研究的格斗游戏列表，请参阅 工具 . 从谈话中滑出 “深入玩具箱：《Skylanders Spyro》冒险设计一探究竟” 作者：Mike Stout，来自 2012 年 GDC 也就是说，即使您对现有的战斗游戏进行了修改，您仍然必须能够理论化它是如何工作的。所有单人和多人战斗游戏都具有某种形式的这些核心元素： 战斗机制 武器设计 经济 在具有专门开发角色的大型商业工作室中， 这些核心战斗元素都不是关卡设计师的责任 。然而，关卡设计师在不理解关卡的情况下就无法制作关卡。 图片来自 “制造冲突：AAA 动作游戏的战斗设计” 作者：Michael Barclay 等人，来自 GDC 2016 战斗机制 战斗机制 是玩家用来对抗敌人的重复动作/技能/武器。一些常见的战斗机制： 移动 远离危险，控制 领土 目标 针对特定的敌人类型/弱点 时机 一次攻击 告诉/电报 （机会） 连锁攻击进入 连击 ，结合行动或武器 块 敌人的攻击； 招架 / 克制关系 / 逃避 在正确的时间 使用 陷阱 如炸药桶、水、熔岩、悬崖等 索尼圣莫尼卡 2014 年《战神》（ Steam ）(2018) 早期测试地图 + 战斗原型的动画 GIF 武器设计 许多游戏为玩家提供多种武器可供使用。 武器设计 是关于概念化、实施和平衡这个武器库。需要考虑的一些方面： 武器手感和幻想 （例如慢速大枪 vs 鬼鬼祟祟的刀 vs 响亮的电锯） 统计数据 比如不同的伤害、射程、射速、弹药供应 对于枪支：不同的散布、后坐力、瞄准器、穿透力、弹匣尺寸、装弹速度 态势感知 选择最合适/有效的武器 《毁灭战士》（1993）中的武器激发了许多射击者的灵感：(1) 电锯、(2) 手枪、(3) 霰弹枪、(4) 超级霰弹枪、(5) 链枪、(6) 火箭发射器、(7) 等离子枪、(8) BFG 经济 经济 是玩家在整个游戏过程中必须考虑的总体成本/收益/奖励系统的通用游戏设计术语。玩家对资源的访问会影响他们使用哪些机制和武器以及何时使用： 武器经济： 弹药、时间 (DPS)、武器库/装载 例如：玩家还剩下 1 个火箭，所以他们会保存它，直到与对火箭较弱的强敌战斗为止 例如：玩家在水下只有15秒的氧气，所以他们需要高DPS的武器来对抗水下的敌人 玩家状态： 短期经济 例如健康、库存、消耗品 例如：玩家有 99% 的生命值，所以他们会避免使用增加 +25% 生命值的生命值物品，因为这会“浪费”24% 的拾取物 玩家进度： 长期经济 例如经验值、福利、升级、装备 示例：玩家有 99% 的生命值，但如果他们的生命值完全，他们的升级会产生 +100% 的伤害，因此他们决定无论如何都要拾取 +25% 的生命值物品，因为伤害加成比浪费的治疗更有价值 用于动作角色扮演游戏《战神：诸神黄昏》(2022) 的武器进度电子表格，摘自演讲 Rob Meyer 的《命运的清算：诸神黄昏之战》（2023 年）（来自 YouTube） “我们试图以一种我们认为在纸面上健康的方式来模拟我们对装备获取和进展的期望，然后我们不断地进行试玩测试和迭代，试图让试玩测试的现实与我们的模型相匹配。 [这是一个电子表格（如上图所示）] 计划的功率关卡进展，以及游戏中不同点的不同装备槽。按时间顺序，每一行都是游戏中的不同关卡。每一列都是不同的装备，这些是我们期望您在游戏中的那个时刻获得该装备的关卡。我们会不断地交叉参考我们认为应该发生的事情和试玩测试中实际发生的事情...... 我们使用的一个技巧是[让升级现有装备比购买新装备更昂贵]，这样你就会有暂时的动力去寻找新装备[...]或者类似地，当我们知道从 4 级升级到 5 级的资源尚不可用时，在探索内容期间奖励 5 级盔甲，因此我们保证盔甲会在短时间内令人兴奋和诱人。” ——罗布·迈耶， “清算之门：诸神黄昏规模的战斗”(2023) (YouTube) 战斗实例 这里我们总结了三种主要的对抗方法： 经典战斗 （《毁灭战士》、《雷神之锤》（ Steam ））专注于 运动 灵魂之乐 （《黑暗之魂》（ Steam ）、《血源》、《埃尔登指环》）需要 闪避 战斗通常是近距离且连续的。 军事现实主义 （《反恐精英（ Steam ）》、《使命召唤》）是关于 瞄准 大逃杀 （《堡垒之夜》（ Epic ）、PUBG（ Steam ）、《Apex 英雄》（ Steam ））添加了更多内容 经济 战斗通常是远距离且不稳定的。 现代战斗 （光环、军团要塞 2（ Steam ）、守望先锋（ 官网 ））强调 损坏 掩护射手 （战争机器、神秘海域）添加 定位 战斗通常是中距离且有节奏的。 注意：没有任何游戏可以完全归入某个类别。这些只是示例/只是思考这些游戏的一种方式。 American McGee 和 Sandy Petersen 创作的《毁灭战士 2》中标志性关卡“Dead Simple”的屏幕截图。 经典战斗 《毁灭战士》(1993) 中的战斗 具有强大的内置自动瞄准辅助功能。玩家甚至无法垂直向上或向下看。 《毁灭战士》显然与瞄准无关。相反，《毁灭战士》的高速度使得关卡具有大量敌人、遭遇战变化和庞大的关卡布局。 “[玩家]的奔跑速度约为每小时 50 英里——以现代标准来看，速度快得离谱。《毁灭战士》的大多数敌人都没有即时命中的投射物攻击，而且大多数有即时命中投射物攻击的敌人都相当弱——低等士兵和中士。其他敌人的投射物都需要时间才能到达目标，在更真实的视觉呈现中看起来会很滑稽。 因此，由于玩家在《毁灭战士》中移动得如此之快，而且大多数敌人的攻击都是可以躲避的，因此玩家只需移动即可避免大量伤害。 [...]这使得《毁灭战士》的遭遇战能够发布出大量的敌人，通过混合不同比例的威胁来改变场景，并拥有巨大的、蔓延的、通常是非线性的空间，玩家可以轻松穿越。” ——JP 勒布雷顿， 腔棘鱼：末日的教训 类似《黑暗之魂》的动作角色扮演游戏通过“闪避翻滚”和“无敌帧”（I 帧）将躲避机制正式化，在良好的时机下提供完全的伤害抵消。学习如何解读敌人的动作，以及重新定位/躲避以避免伤害，通常比使用最好的武器或拥有最好的装备更重要。 1996 年《雷神之锤》(1996) 的屏幕截图 军事现实主义 最初的《反恐精英》（1999 年）以现实的军事风格普及了基于团队的多人竞技游戏。武器具有极高的杀伤力，战斗会在几秒钟内结束。成功取决于快速的反应速度和在正确的时间瞄准正确的地点，同时清除射击角度和视线，但闪光弹和烟雾弹可能会导致视野丧失。不同的枪械精度、后坐力和子弹穿透机制补充了对观察和瞄准的关注。 最近的大逃杀游戏类型最初是作为一款名为《ARMA》的现实军事模拟射击游戏系列的模组，其大部分方法都延续到了《PUBG：绝地求生》中，这是第一款在商业上取得成功的大逃杀射击游戏。即使在《堡垒之夜》或《Apex》等军国主义程度较低的大逃杀游戏中，这种情况仍然存在，新玩家突然死于一百米外看不见的狙击手的情况仍然很常见。然而，这一切都取决于玩家积累物资和枪支的能力，为每轮添加库存管理方面和类似角色扮演游戏的进程。 Dave Johnston 为《反恐精英》1.6 设计的标志性多人游戏地图 de_dust2 上的游戏截图 现代战斗 在光环：战斗进化（2001）中，玩家移动缓慢，跳跃非常飘逸，所以这里没有太多躲避。但也没有太多的目标；众所周知，默认手枪是游戏中最好的武器之一，可以进行廉价的频繁中距离/远距离爆头，并具有微妙的自动瞄准“磁性”，非常适合休闲游戏机游戏。 《光环》（ Steam ） 的重点不是移动或瞄准，而是管理伤害： “在几乎所有现代第一人称射击游戏中，玩家的移动速度都相当缓慢，而且很大一部分敌人都配备了即时攻击武器——手枪、机枪、狙击步枪。这通常会让玩家扮演“伤害海绵”的角色——他们的目的是从大多数不可避免的敌人攻击中吸收一定量的伤害，然后寻找掩护并治愈。光环的充电护盾使这一机制变得非常明确——默认情况下，你在寻求掩护时会受到伤害并会死亡。停止这种情况并完成任何战斗的基本循环。” ——JP 勒布雷顿， 腔棘鱼：末日的教训 像《军团要塞 2》这样的多人团队射击游戏非常强调治疗，以至于每个团队都需要一名治疗者。 《守望先锋》以光环的再生护盾机制为基础。像《战争机器》或《神秘海域》这样的掩护射击游戏具有恢复生命值的功能，但将这种节奏与隐藏在物体后面联系起来。现代战斗就是被射击，危险和休息交替进行。 来自 Bungie 的 《光环》: Combat Evolved 的深受喜爱的多人游戏地图 Blood Gulch 的游戏截图 TODO：如何构建战斗 白盒测试场地 开放区域和/或 3 通路 放置一些敌人 试玩测试和重复 如何知道战斗何时“足够好”？ 战斗关卡的关键概念 一旦您建立了核心战斗系统，无论是通过玩您正在修改的游戏还是从头开始构建自己的战斗，您就可以开始设计更具体的战斗场景： 敌人设计 是关于定义不同的敌对 NPC 类型。 理想情况下，每种类型都有独特的行为、优点和缺点。 如果没有不同敌人的名单，战斗就会感觉重复。 遭遇战 是针对 NPC 的结构化战斗。 开放式战斗谜题；玩家通常必须临时想出一个解决方案 实施通常涉及一些 脚本编写 . 掩体 是关于建造战斗空间。 哪里安全，哪里风险高？玩家可以在哪里战斗或恢复？ 掩体因机制/武器而异。首先你需要核心战斗设计。 地图平衡 是玩家选择的公平性，通常在 PvP 中。 玩家可以去哪里，他们可以控制什么领土？玩家如何知道？ 平衡的关卡有助于玩家信任 布局 并对结果进行投资。 我们建议按照上面列出的顺序进行战斗。每个方面都取决于前一个方面。为了构建遭遇战，你首先需要设计敌人。为了协调掩护，你需要了解战斗应该如何进行。为了平衡地图，您需要知道哪些覆盖图案有意义。 《光环》 (2001) 中的敌方角色是一款早期游戏机 FPS，普及了动态小队战斗和载具 要审查... 战斗设计 是关于设计针对身体冲突的系统。 要制作战斗关卡，您首先需要一款战斗游戏。但制作一个完整的游戏是很困难的，而且这只是一本The Level Design Book 中文版。修改游戏更容易。 常见的战斗系统包括： 战斗机制 比如瞄准、躲避、时机等等。 武器设计 ，一组各种有趣的工具可供使用 经济 ，武器、库存和进度的成本/收益系统 一些战斗示例： 经典战斗 \u0026 灵魂之爱 强调速度和躲避火力 军事现实主义 \u0026 大逃杀 让枪支和瞄准变得更加重要 现代战斗 \u0026 掩护射手 是关于管理健康/损害 要构建一款战斗游戏，（TODO） 现在怎么办？ 阅读有关战斗关卡设计关键设计概念的更多信息： 敌人设计 遭遇战设计 掩体 "
                  },
                  {
                      "href":  "process__combat__balance.html",
                      "title":  "地图平衡",
                      "description":  "玩家在整个关卡中的选择，玩家可以去的地方的公平性",
                      "originalUrl":  "https://book.leveldesignbook.com/process/combat/balance",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🔫 战斗"
                                      ],
                      "searchText":  "地图平衡 玩家在整个关卡中的选择，玩家可以去的地方的公平性 为什么要平衡关卡？ 地图平衡 是整个关卡中玩家定位的真实和感知的公平性。玩家会责怪自己不了解如何使用关卡，还是会责怪关卡设计师将他们置于不可能的境地？ 平衡良好的关卡支持多种游戏风格，并让玩家对结果投入精力，而平衡不佳的地图可能会导致玩家因沮丧或冷漠而退出。 虽然我们可以将平衡性概括为适用于任何关卡，但平衡性对于面向战斗的关卡和竞争性多人游戏地图最为重要。 单人游戏没有平衡性 对于击败人工智能对手的游戏来说，“平衡”的概念毫无意义。几乎所有的合作“玩家对抗敌人”（PvE）和单人游戏都是故意不平衡的，以利于玩家。 敌人 AI 会故意采取具有明显弱点的不利位置，因为游戏的设计目的是立即完成。在这里，“公平”的关卡为玩家提供了充足的信息和获胜的机会。 AI对手的目的是以一种有趣的方式输掉比赛。 从本质上讲，我们必须以对玩家有利的方式操纵游戏，并为玩家提供进一步操纵游戏的令人信服的机会。 所以当我们谈论地图平衡时，我们的意思是 多人游戏地图平衡， 不是单人游戏/PvE。 有关单人游戏/PvE/合作战斗的更多信息，请参阅 遭遇战 相反。 游戏平衡 首先让我们回顾一下一般游戏平衡的基础知识。 克制关系 在 剪刀石头布 (RPS) 每一步 克制关系 另一个。竞技游戏经常依赖 RPS 来实现平衡。像《街头霸王》这样的格斗游戏可以归结为攻击、投掷、格挡（攻击克制投技，投技克制格挡，格挡克制攻击）。像星际争霸这样的战略战争游戏就是步兵、炮兵、骑兵（步兵打败骑兵，骑兵打败炮兵，炮兵打败步兵）。这种模式因游戏和类型而异（近战、施法者、远程...霰弹枪、狙击手、步枪...坦克、支援、DPS...携带、上路、中路、打野、辅助）。 从这个角度来看， 平衡意味着提供克制手段。 如果玩家对对手的行动或策略没有任何可能的反击，那么系统就是不平衡的。 任何平衡的克制系统都需要 3 个以上的选项 ，这样就可以对抗计数器（ “尤米” ）是不同于他们最初的第一选择以及对手的第二选择的第三选择。 （例如“石头纸”不起作用。） 石头剪刀布与攻击扔块的比较图（右图由 David Sirlin 拍摄，来自 https://www.sirlin.net/articles/designing-yomi） 困境、收益、占优策略 囚徒困境是20世纪50年代美国军事智库设计的一个思想实验，是《囚徒困境》的核心概念。 博弈论 : 犯罪团伙的两名成员被捕并入狱。每个囚犯都被单独监禁，无法与其他囚犯联系。 [...] 每个囚犯都有机会通过作证对方犯罪来背叛对方，或者通过保持沉默来配合对方。可能的结果是： 如果 A 和 B 各自背叛对方，则各自入狱两年 如果A背叛B而B保持沉默，A将被发布，B将入狱三年 如果A保持沉默而B背叛A，A将入狱三年，B将被发布 如果 A 和 B 都保持沉默，则各只服刑一年 以下是可能的结果，表示为 收益矩阵 ，其中监禁年数表示为负分，目标是最大化最高分数： B保持沉默（合作） B 背叛（缺陷） A保持沉默（配合） 答： -1 年，乙： -1 年 答： -3 年，乙： 0 年 A 背叛（缺陷） 答： 0 年，乙： -3 年 答： -2 年，乙： -2 年 在这个标准版本的囚徒困境中，博弈论学家认为玩家应该总是叛逃。为什么？想象一下你是A。如果B合作，那么你应该叛逃，因为0年监禁比1年监禁要好；即使B叛逃，那么你仍然应该叛逃，因为2年监禁比3年监禁要好。 囚徒困境在英国游戏节目 Golden Balls 的最后一轮“Split or Steal”中最受戏剧化 因此，叛逃是一种 占优策略 因为其他玩家做什么并不重要。总是叛逃最好的情况下会给你带来胜利，最坏的情况下会为你带来平局。就成本/积分而言，如果你总是背叛其他玩家，你实际上不会输。要了解原因， 观看英国游戏节目 Golden Balls 中最著名的时刻 ，参赛者尼克·科里根 (Nick Corrigan) 使用这种优势策略来对抗其他参赛者易卜拉欣·侯赛因 (Ibrahim Hussein)，取得了令人惊叹的效果。 从这个角度来看， 平衡意味着避免系统中的主导策略 ，占优策略是一种获得最高理论收益的游戏模式 . 如果存在占优策略，那么理论上所有理性参与者都会选择它，这使得其余策略变得无关紧要，从而不平衡。 反馈循环 加热器是一个简单的自平衡系统。当加热器检测到温度太低时，它会加热；当加热器检测到太热时，它会自行停止加热。在 系统动力学 , 这个 负反馈循环 是一个 平衡环路 因为它稳定了系统的状态。相比之下，想象一下一个加热器，当它变得更热时，它会加热得更多，最终着火并烧毁一座房子——这是一个 正反馈循环 , 一个 加强环 从而强化其自身的效果。 在游戏中， 平衡循环可以帮助较弱的玩家从错误中恢复过来 。例如，赛车游戏通常会通过给予他们更快的速度奖励（例如《GT赛车》中的AI汽车）或更好的物品（例如《马里奥赛车》中的蓝色贝壳强化道具）来“橡皮筋”那些排名最后的人，从而使比赛感觉更刺激和更有竞争力。然而，这也可能会导致不公平的指责，或者导致比赛旷日持久，让人感觉像是人为的僵局。 强化循环可以帮助更强的玩家增加优势， 就像在任何资源产生更多资源的游戏中一样（例如在《反恐精英（ Steam ）》中，金钱可以购买更好的枪支，这使得杀戮更容易，可以赚更多的钱，可以购买更好的枪支......等等）。 （反馈回路图） 平衡感觉 游戏平衡现在看起来像是一个你可以证明的数学问题——如果所有计数器、反馈循环和数字加起来，那么你的游戏或关卡现在就完美平衡了！ 看哪， 完美平衡 标准剪刀石头布的支付矩阵： B 演奏摇滚 B 玩纸 B 玩剪刀 A 演奏摇滚 甲：0，乙：0 A：0，B：+1 A：+1，B：0 A 玩纸 A：+1，B：0 甲：0，乙：0 A：0，B：+1 A 玩剪刀 A：0，B：+1 A：+1，B：0 甲：0，乙：0 理论上，剪刀石头布是 完美平衡 所有选择始终同样可行。不存在导致连胜的强化循环，过去的回合不会影响未来的回合。是这样吗 完美的平衡 让石头剪刀布成为有史以来最伟大的游戏？相反，有些人可能会说完美的平衡最终使它成为一个无聊的游戏！所有的动作感觉都一样，没有办法为了获得大的连续奖励而冒很大的风险，并且 33% 的可能结果会导致什么也没有发生。 不平衡的反击、主导策略或失控的负反馈循环在游戏中并不一定是坏事。如果主导策略使我们的体验目标得以实现，那么就继续并保留主导策略。即使不那么陷入困境，使用占优策略仍然会让人感觉戏剧性和有影响力。除非是重大胜利，否则胜利可能不会让人感到胜利。 在 吃鸡游戏 我们想象两辆车相向而行，如果两辆车都“缺陷”并发生碰撞，就会受到非常令人兴奋的共同惩罚。 B 转向（配合） B 保持笔直（缺陷） A 转向（配合） 答： 0 ，乙： 0 答： -1 ，乙： +1 A 保持笔直（缺陷） 答： +1 ，乙： -1 （崩溃）答： -1000 ，乙： -1000 如果我们想让“摇滚”感觉像是一个重大的戏剧性决定怎么办？ B 演奏摇滚 B 玩纸 B 玩剪刀 A 演奏摇滚 答： -10 ，乙： -10 答：0，乙： +5 答： +15 ，乙：0 A 玩纸 答： +5 ，乙：0 甲：0，乙：0 A：0，B：+1 A 玩剪刀 答：0，乙： +15 A：+1，B：0 甲：0，乙：0 《风之旅人》（ Steam ）是一款玩家可以在彼此附近“叽叽喳喳”地为对方玩家的跳跃能量充电的游戏。合作是这里明显的主导策略，但这就是重点。 B 鸣叫（合作） B 不鸣叫（缺陷） 叽叽喳喳（配合） A：+1 跳跃，B：+1 跳跃 A：+0 跳跃，B：+1 跳跃 A 不鸣叫（缺陷） A：+1 跳跃，B：+0 跳跃 A：+0 跳跃，B：+0 跳跃 这一切只是为了说： 完全平衡的游戏/关卡通常并不一定理想。 （待办事项：图像） 公平性 公平性 是玩家整体心理的平衡感。即使在平衡的系统中，玩家仍然可能会感觉到不公平——或者玩家可能会认为不平衡的系统是公平的。 平衡的 PvP 地图为攻击者和防御者提供了机会，并在占领任何特定领土时进行权衡和反击。 竞争性多人游戏地图应该为团队提供接近相等的平均 50% 胜率。 一般来说， 优先考虑公平而非平衡。 它不是关于完美的数学，而是更多关于理解玩家的体验和反应。除非你想以艺术家的身份采取特定的立场，否则玩家就是真相的来源。如果您所有的玩家都说 2+2=5，那么请考虑更改游戏中的数学公式。 游戏设计师对“公平”的定义不同。 大卫·瑟林定义公平 因为“无论开始条件如何，技能相同的玩家都有平等的获胜机会。” （图：公平） 比赛/锦标赛设计 地图平衡和公平总是发生在整个游戏的大背景下。规则和程序会影响玩家如何使用地图，尤其是在竞争性多人游戏中。 换边。 当团队在游戏中交换立场/角色时，地图平衡就不那么重要了，因为理论上，所有玩家都有平等的机会利用（或遭受）任何不平衡。这种方法在许多体育运动中都很常见，球队会在半场休息时换边。 关卡列表。 对于 MOBA 和格斗游戏来说非常常见。将不同的关卡、角色或装备分类为“层”，并仅在该层内保持平衡。例如B级选项应该彼此大致相当，但没有人会指望C级选项能够击败S级选项。 Sirlin 认为所有 S 级或 F 级角色都应该重新设计。 锦标赛。 竞技性多人锦标赛的设计有一套完整的科学，你可以说这基本上是元关卡设计。公开赛还是封闭赛、循环赛、淘汰赛？如果一支队伍在某张地图上比另一支队伍更好怎么办？团队可以否决地图吗？地图池是什么？ 芬威公园绿色怪物墙的照片，由“wallyg”在 CC-BY 许可下拍摄 (https://commons.wikimedia.org/wiki/File:Fenway_Park_Home_Plate_and_Green_Monster.jpg) 例如上图所示的就是 《绿色怪物》 位于美国波士顿芬威球场左外野后方的一堵异常高的绿墙。从关卡设计和地图平衡来看，绿怪给场上的防守方带来了巨大的优势；绿色怪物非常高（11.3米），击球手很难击出越墙本垒打。 但在整个棒球比赛的多局比赛中，球队反复转换角色的大背景下， 公平 因为两支球队都会处于相似的劣势。 整体游戏设计框架了我们如何理解平衡 ，有时地图平衡甚至有些无关紧要。 （棒球迷争论绿色怪物是否对击球手不利。击球手可以瞄准墙壁并将球从墙上弹开，这对于左外野手来说更难接住。 左撇子投手在芬威球场的数据往往较差 因为右手击球手在这些“墙球双打”中得分更多。） 地图平衡 平衡关卡的各个部分涉及比较 效用 该地区的 成本 访问它，以及 信息 可供玩家使用。 效用： 这个领域有用或者有趣吗？为什么玩家会去这里或留在这里？ 成本： 该地区交通方便或居住方便吗？玩家是否需要大量时间/资源才能做到这一点？如果玩家在这里，是否会让其他地方变得脆弱？ 信息： 玩家知道这个区域的存在吗？玩家必须跟踪或记住多少信息才能利用该区域？有隐藏费用吗？ 误解所发生的事情很有趣吗？ 我们关卡设计的目标是 不 以最大化效用。始终有用的“完美”地图区域 （实用性高） 并且很容易到达 （成本低） 在明显的位置 （可见信息） 在关卡设计中实际上并不理想，因为所有“理性”玩家都将不可避免地使用它并依赖它作为主导策略。如果玩家不使用它，为什么要构建地图的其余部分呢？ 理想情况下，地图的每个部分都应该具有取决于游戏状态的特定用途，并通过情境弱点阻止玩家停留太久，并通过有限的信息过滤，让玩家犯下有趣的错误。 领土/地图控制 一个玩家的 领土 是他们可以追踪、防御并普遍受益的关卡区域。请注意，玩家不一定必须出现在该区域内才能防御或从中受益。领土的概念比这更抽象，更多的是关于谁控制该区域的访问权，以及谁可以轻松地进入该区域。 例如，一个 每个具有玩家和空间的游戏都可以支持理论玩家驱动的对领土的“元”理解。当您玩棋盘游戏大富翁并积累许多相邻财产时，该区域可以被视为您的领土。当你打篮球并且在篮筐附近"
                  },
                  {
                      "href":  "process__combat__cover.html",
                      "title":  "掩体",
                      "description":  "阻挡视线的形状，在战斗和潜行游戏中提供保护",
                      "originalUrl":  "https://book.leveldesignbook.com/process/combat/cover",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🔫 战斗"
                                      ],
                      "searchText":  "掩体 阻挡视线的形状，在战斗和潜行游戏中提供保护 什么是掩体？ 掩体 是阻挡视线或保护某人免受攻击的任何物体或结构。 如果游戏有投射物和墙壁，那么它也有掩体。这几乎是不可避免的功能 战斗 游戏，与该类型本身一样古老。 然而，掩体实现可以从简单的类似街机的感觉到具有动画和脚本标记的复杂掩体系统。与任何战斗机制一样，核心游戏设计的其余部分都会影响玩家实际使用掩体的方式。 两种不同掩体游戏风格的插图；掩护作为机动（ 周围 掩护）与掩护作为战术（ 与 掩体） 游戏掩体简史 太空侵略者 (1978) 有盖子。但你最好把时间花在隐蔽的射击上。早期的第一人称射击游戏喜欢 毁灭战士（ Steam ） (1993), 雷神之锤（ Steam ） (1996), 和 虚幻 (1998) 所有游戏都具有类似街机般的专注于快速射击的特点，有时你会在再次奔跑和射击之前短暂隐藏。躲避通常是比站在掩体后面更好的策略。在这里， 掩护是一种机动 . 更多“现实”射击游戏，例如 半条命 (1998) 和 反恐精英（ Steam ） (1999) 有更快的击杀时间，因此蹲在掩体后面是必不可少的，而且无论如何你都需要更少的射击时间。在这里， 掩护是一种策略 这会减慢所有战斗的速度。你开枪 来自 覆盖，而不是 周围 盖。 光环 (2001) 后来使用了再生护盾机制来进一步稳定这种鸭子掩护的节奏，直接奖励玩家的掩护。 （左）《太空侵略者》（1978）、（中）《半条命》（1998）和（右）《合金装备》（1998）的屏幕截图 在早期的 3D 第三人称动作游戏中，例如 合金装备 (1998) 角色可以拥抱墙壁或蹲在板条箱后面。在这里，寻找掩护更像是角色进入的一种独特的动作/模式。这标志着掩护系统的开始，尽管更多地用于隐身而不是战斗。 有点晦涩的 杀戮开关 (2003) 是第一个被普遍认可的 掩护射手 以其形式化的 覆盖系统 ，一种机制，角色可以动态地捕捉到掩体，将他们的身体和碰撞箱摆到掩体几何形状上。 战争机器 (2006) 后来普及了掩体系统，定义了我们今天所知的现代掩体射击游戏类型，现在常见于《最后生还者》、《全境白盒》和《神秘海域》等系列中。 早期掩体射击游戏的游戏截图； （左）《杀戮开关》（2003）和（右）《战争机器》（2006） 掩体是运动 掩体的功能取决于玩家如何在其周围移动/与它一起移动/穿过它。 掩护作为机动 ，在具有街机感觉的快节奏游戏中，当您不奔跑和射击时，短暂地站在障碍物后面。偶尔用于生物管理。 搬家 周围 盖。 掩护作为战术， 在现实动作游戏中，尤其是“坚韧不拔”的 2000 年代射击游戏中，您经常躲避和掩护的一般策略。减慢原本快速的杀戮时间。 搬家 与 盖。 覆盖作为系统 ，这是一种不可或缺的机制，在具有身体意识的第三人称掩体射击游戏中，处于掩体中是一种独特的状态。掩护是默认的战斗模式。 搬家 通过 盖。 掩体设计 在核心战斗和掩体实现确定之后，关卡设计师通常只关注掩体设计的两个方面： 盖形状 : 单个覆盖对象的几何形状，通常是墙壁或类似盒子的形状。 掩体放置 ：总体 布局 竞技场或遭遇战中的掩体形状。 盖子形状 盖子可以具有多种形状和功能。有时掩体是一个独特的对象，有时它更像是一个物体的一般特征 风景 . 主要方面： 身高 , 宽度 , 坚固性 ， 和 面向 . 次要方面： 纵向/垂直空间 , 角球 , 持久性 ， 和 作者身份 . 高度（半/低与全/高） 你可以射击或跳过齐腰高的桌子，但要隐蔽就需要蹲下并靠近。 高大的掩体可以防止高处的攻击者，但站立/回避可以暴露更多。 宽度 （窄与宽） 浅窄的掩体可能会让您暴露在外，而深而宽的掩体则提供可靠的保护。 曝光 有助于削弱 NPC 的位置、使某处更加危险或鼓励更多的移动。 坚固性 （软与硬） NPC 在灌木丛或高草等非固体软掩体中会忽略你，但 PvP 就不那么慷慨了。 柔软度各不相同。 能量护盾/防弹窗可以阻挡子弹，但不能阻挡视线；格栅可以阻挡运动，但不能阻挡子弹； 《反恐精英》具有子弹穿透力（“撞墙”）。 面向 （定向与独立式） 定向掩护为攻击者留下了盲点 侧翼 或者防守队友来掩护你，这对前线很有好处。 独立式掩护通常会导致“绕着玫瑰绕圈”舞蹈，在决斗中盘旋，更适合高潮的最后一战。参见 倾斜运动 . 纵向/垂直空间 （海沟与高程） 清理战壕中的 NPC 感觉很好，但自己被狙击手或炮塔压制通常会感觉很糟糕。 标高提供更强的高度优势，具体取决于 攻角。 另请参阅 流动：纵向/垂直空间 . 角球 （锋利与圆形） 锋利的“盲角”（90 度以上）即使在近距离也能保护您。 圆角让您更多地暴露在外，具体取决于 曲率 。较长的曲线更难隐藏。另请参阅 倾斜运动 . 持久性 （动态与静态） 大多数掩体是永久且静态的，但是 易碎品 提供临时的半硬掩体，就像《F.E.A.R》或《黑暗之魂》（ Steam ）中那样。 移动盖 （尤其是半掩体）应该移动缓慢（有效载荷车）或很大（长火车），否则很难使用。 作者身份 （设计师与玩家） 《堡垒之夜》（ Epic ）让你 建造 硬掩体；反恐精英有 效用 （烟雾弹）创建软掩护。这些游戏的地图上开发者创作的掩体较少，因为玩家用自己的掩体填充开放空间。 盖板结构 覆盖标准尺度规范 有关一般关卡设计测量的更多信息，请参阅 尺度规范 . 覆盖标准尺度规范 是标准化掩体的特定尺寸和测量值。 一致的掩体对于想要避免歧义的格斗游戏或任何具有掩体系统/身体意识动画且需要对掩体形状做出假设的动作游戏非常有用。 对于《神秘海域 4》，顽皮狗设计师确保所有掩体和墙壁高度符合三个高度范围： 高盖。 物体站立时头高1.75米以上。 低覆盖。 站立物体腰部高度，1.0-1.25米。 不盖。 膝盖高度0.5米或以下的物体 《神秘海域 4》中不同掩体高度范围的带注释的屏幕截图图，来自 “定义视频游戏的环境语言”作者：Emilia Schatz（来自 80.lv） 相比之下， 模糊覆盖 是一个让人感觉不明确或不一致的掩体对象。 在残酷、不公平的动作角色扮演游戏《黑暗之魂》中，有时你认为自己在掩体后面受到安全保护，但无论如何你都会突然被一枪毙命。或者考虑像《ARMA》这样的军事模拟射击游戏，您可以在细节中主动控制自己的立场，动态调整姿势并倾斜以符合掩体，需要以严格的军事模拟方式掌握。 所以这完全取决于您的体验设计目标。你想让你的掩体做什么？你的机制是什么？你们是在制作《神秘海域》、《黑暗之魂》、《ARMA》还是其他完全不同的东西？ （TODO：模糊覆盖示例） 掩体脚本 最简单的掩体实现不需要特殊的脚本。您建造一堵墙或放置一个板条箱，盖子就可以使用了。 更复杂的掩体实现需要一些脚本标记来帮助 NPC AI 使用掩体。使用半条命 节点 ，由关卡设计师手工放置的可能的战斗位置。 《半条命 2》（ Steam ）和《战争机器 1》实施了多种类型的专业化 覆盖节点， 指示用于掩体系统的正确角色动画。 如今，大多数游戏都会自动执行部分或全部掩体标记过程： 模块化 工作流程：通过重复使用图块或预制件来重复使用手工创作的掩体标记。 烘焙工作流程：自动检测并烘焙与导航网格（“navmesh”）烘焙通道相关的覆盖标记。允许手动编写边缘情况的覆盖。 有关 NPC AI 和节点的更多信息，请参阅 脚本：导航 . （左）半条命 2 中地图 d3_c17_07 中手工放置的覆盖节点网络的游戏内调试可视化， Tom Edwards 通过 Valve 开发者 Wiki 截屏 ; （右）战争机器 mod 中手工放置的掩体节点的编辑器屏幕截图， 截图由 Nick Urko 通过 nickurko.com 提供 掩体放置 不同的游戏需要不同的掩体 布局 . 流派 第三人称潜行游戏与第一人称射击游戏有不同的掩护需求。 潜行：掩体是玩家管理敌人、信息和可见性的工具。 在战斗中：以上都是，而且掩体是抵御敌人火力的硬性保护。 力学 强烈影响掩体布局。 根据伤害系统/友军火力，较大的敌人可以充当移动掩护。 多人游戏 地图使用掩体作为一部分 地图平衡 ，但单人游戏关卡可以有针对特定情况量身定制的“不公平”掩体 遭遇战 和玩家路径。 （左）潜行游戏的典型布局与（右）掩护射击游戏的典型布局；改编自图表 作者：Iuliu-Cosmin Oniscu，通过博客文章“如何处理掩体放置” 考虑潜行游戏（左上）和射击游戏（右上）的掩体布局： 隐身盖布局 掩体射手布局 敌人开始暴露且毫无察觉 敌人一开始不暴露，躲在掩体后面 敌人控制中路 中间是“无人区” 冲过去=没有掩护 冲过去=一些掩护，可行 旁路是主动线 为细心的玩家提供可选的小路 旁路有脆弱的间隙 旁路提供零漏洞作为奖励 想象一下交换这些布局。它们可以正常工作，但玩家的行为会有所不同。 如果我们在射击游戏中玩潜行布局，玩家可能会一看到手无寸铁的敌人就爆头，并完全忽略掩体。如果我们在潜行游戏中玩射击游戏布局，初学者可能不会注意到隐藏在掩体后面的守卫——或者如果守卫很明显，那么受保护的小路就会感觉明显且容易，就像教程或任务开始一样。 这暗示了潜行战斗游戏关卡设计的难度。理想情况下，所有掩体放置必须支持两种截然不同的游戏风格/游戏状态。 掩体系统战斗游戏截图来自动作潜行游戏杀出重围：人类革命（2011） 掩体越少越好 经常 掩体越少越好 。掩体阻挡了视线，使玩家无法注意到正在发生的事情。如果你不知道要防御什么，那么防御就毫无意义。 在单人玩家遭遇战中，敌人的掩护通常应该让 NPC 在某种程度上暴露在外，否则玩家不会注意到他们。 太多又宽又高的掩体会造成令人困惑的迷宫状 动线 和 寻路 ，这对于大多数动作游戏来说通常是不好的。 对于《战争机器》，Epic Games 设计师认为 “一般来说，低盖比高盖好” 在多人掩护射击游戏环境中： “一般来说，低掩体比高掩体更好。[使用墙壁]通常您的互动仅限于墙壁的末端[并且]您也极大地限制了玩家的可见性并将玩家与墙壁上发生的所有动作分开。 如果你降低了墙，你就大大增加了玩家的选择。他们现在知道墙外发生的事情，并可以监视侧翼和敌人的动向。他们可以从墙上的任何地方弹出并射击，这让他们在射击位置上有更多的选择。他们可以保持蹲伏状态，在进行更好的射击时感觉很狡猾。当然，他们也可以翻过墙。一旦他们开始沿着高墙移动，他们就会脱离并简单地穿越地图，但在低墙的情况下，他们仍然完全参与到比赛中。” ——史诗游戏， 《多人游戏地图理论（战争机器）》 《战争机器》 1 团队多人游戏地图“Gridlock”的官方布局图，由 Epic Games 制作 Gridlock 是掩体射击游戏 《战争机器》 的团队多人游戏地图。这是该系列中最具影响力的地图，也是几乎所有续集中唯一的地图。 Epic Games 将其成功归功于其开放空间和低矮掩体的使用： “僵局是[可见侧翼]最明显的例子。由于有大量的低掩体，视线遍布整个地图，让优秀的玩家能够不断了解敌人的位置和潜在的侧翼。 [...你会]经常看到交火方向旋转，占据相同的空间，但行动发生在不同的轴上。 [...像这样的地图]具有如此长的视野距离，以至于它们奖励那些观察力敏锐的玩家，他们可以看到敌人离开产卵区域后分散到哪个方向。” ——史诗游戏， 《多人游戏地图理论（战争机器）》 倾斜运动 掩体取决于 角度 ——战斗人员在拐角处旋转时的视线。 为了可视化角度，请将角的边缘想象为中心 轴 / 支点 。当您转过拐角时，您的视角逐渐变宽，但您可能的曝光也会变宽。 现实生活中的军队和警察称之为 “切馅饼” ：绕过拐角，逐渐积累更多房间的视线“切片”，直到清除所有角度。 “切馅饼”清理房间的 GIF 动画；踢门者的镜头， 来自 TrialBySnu 的“踢球者战术指南” 定向罩 限制可能的角度（你可以拥有多少“馅饼”），同时 独立式盖 支持多个角度（360 度的饼图！），但这也意味着您必须选择要防御的角度。 例如，在《Dust2》的《反恐精英》B站中，定向掩体和独立掩体都有不同的"
                  },
                  {
                      "href":  "process__combat__encounter.html",
                      "title":  "遭遇战",
                      "description":  "连续不断的开放式挑战；通常与NPC战斗",
                      "originalUrl":  "https://book.leveldesignbook.com/process/combat/encounter",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🔫 战斗"
                                      ],
                      "searchText":  "遭遇战 连续不断的开放式挑战；通常与NPC战斗 什么是遭遇战？ 遭遇战 是一组连续的、系统性的挑战，用来支持玩家采用多样化的 战术 。 顺序： 可以连续有多个节拍/波浪/挑战 系统性： 使用游戏元素的重复设计语言 品种： 理想情况下，不仅仅是一种特定的解决方案或最佳策略 战术： 即兴的短期游戏风格/行为 许多游戏以谜题、对话或迷你游戏的形式以非暴力方式应对挑战和冲突。但在关卡设计文化中，“相遇”通常意味着 一个 在动作游戏、射击游戏或角色扮演游戏中进行单人游戏或 PvE（玩家与敌人）战斗/战斗。 (TODO) 有关非暴力挑战设计的更多信息，请参阅谜题。 基于掩体的军事射击游戏的战斗正面图，摘自 Michael Barclay、Sam Howels、Pete Ellis 在 2016 年 GDC Europe 上的“Creating Conflict：AAA 动作游戏的战斗设计” （来自 GdcVault.com） 战斗故事 相遇都是关于 节奏 。发生了什么、何时发生，玩家对这次遭遇战有何反应？ 你可以把它想象成一个故事，但通过战斗来策划——一个 战斗 故事 开头、中间和结尾： 开始、之前 战斗： 敌人是否已经在战斗中，或者没有意识到，或者正在途中？ 玩家可以选择何时进入战斗吗？ 玩家已经知道布局和敌人构成了吗？ 中间，期间 战斗： 短还是长？有多少波或阶段？ 有影响战斗的脚本事件吗？ 有什么具体的路线或策略值得强调？ 结束，之后 战斗： 玩家如何知道战斗何时结束？ 是否有多种可能的结果？ 良好的遭遇战设计可以帮助玩家了解正在发生的事情，足以讲述一个具有明确因果关系的连贯故事。 在上述纪录片《成龙：我的特技》（1999）的视频片段中，成龙为电影《尖峰时刻》（1998）导演了一场打斗场面。成龙强调每个演员的动作都有逻辑性；因此，当他和克里斯·塔克的行为相互配合时，就标志着他们的角色伙伴关系达到了高潮。不要像愚蠢的布雷特·拉特纳一样，反复问有关枪支道具的愚蠢问题 （拉特纳：“但是这是你的枪吗？”） 因为枪不是重点！ （陈：“我不在乎。”） 枪只是帮助观众跟随打斗的工具。 遭遇战设计是利用动作、姿势和动作来讲述故事。然而，讲述比具体故事本身更重要。 有关关卡设计中一般讲故事/节奏的更多信息，请参阅 节奏 . 立足点 对于强调掩护的单人动作射击游戏，让玩家有机会在战斗真正开始之前调查竞技场。他们需要时间环顾从哪里战斗，预测敌人将从哪里战斗，并制定逃跑计划，以防战斗对他们不利。 如果你不帮助玩家理解布局，那么玩家就会毫无想象力地从门口战斗而不会做出承诺。你的竞技场设计将被闲置，玩家会责怪游戏提供的信息和使用竞技场的动机太少。 我们如何吸引玩家进入竞技场，了解布局，然后与敌人交战？ 安德鲁·约德（Andrew Yoder）将此称为“战斗设计的门问题”。 有几种方法可以让玩家有机会找到立足点： 方法一：玩家伏击敌人 开始与不知道玩家存在的敌人遭遇战， 从竞技场入口处可见。这让玩家有时间制定计划，并在准备好时发起攻击。 虽然玩家一开始可能会很容易地消灭暴露的不知情的敌人，但你可以在拐角处隐藏或产生更多敌人，并在战斗开始时引入这些增援。 这种模式在开放世界游戏或任何散布着敌人前哨的大型景观中很常见。它符合该类型提倡行动自由的审美观。 方法二：敌人伏击玩家 开始没有敌人的遭遇战， 所以玩家会徘徊到竞技场的中间。一旦他们通过某种中场门槛，就会触发敌人并开始战斗。 （可选）在中间放置一些物品和资源作为“诱饵”。 有经验的玩家可能会理解这是一个明显的陷阱，如果空房间的结构像竞技场，或者如果诱饵是免费提供的，没有明显的成本或危险，他们会变得特别怀疑。 请注意，在玩家第一次尝试后，惊喜很快就会失去光彩。避免让敌人的伏击变得非常困难，因为反复的死亡和反复试验的玩法，加上玩家对伏击缺乏控制，可能会让人感到刺耳或不公平。 这种模式在经典射击游戏和恐怖游戏中很常见。当这种设计能够让玩家感到震惊时，他们会更容易接受。 方法 3：单向入口的 Vista 开始与不知情但无法攻击的敌人遭遇战 , 从远景可观察到 （制高点）但被牢不可破的窗户隔开或远离攻击范围。玩家可以收集信息，制定计划，并在需要时开始战斗。 或者，强制玩家通过单向入口进入竞技场，并在他们身后关闭一个短的垂直下降或气闸门。这样一来，这样一来，玩家几乎没有机会偷袭敌人，或用取巧方式规避战斗。一旦玩家进入竞技场，就必须真正投入战斗。最接近“公平战斗”的事情。 如果试玩测试人员不使用远景，请尝试：(a) 在远景处放置资源，(b) 使进入远景的流程更加顺畅，(c) 阻碍流向竞技场入口并首先混淆入口（例如，使用 U 型转弯类型），或 (d) 上述所有方法。 这种模式在 Boss 战或任何大型高潮场景遭遇战中很常见。迫使玩家停在专门设计的远景处是一种强烈的设计姿态，它警告玩家：不要轻率，要做好准备。 敌人调色板 有关使用不同敌人类型的更多信息，请参阅 敌人设计 . 这 敌人调色板 是针对遭遇战的敌人类型的具体选择。 大多数时候，一次只使用几种敌人类型。 使用太多的敌人类型就像制作一部有太多角色的电影，或者烹饪一个有太多不同口味的菜肴。它缺乏焦点，不清楚发生了什么。越简单通常越好。 是的，大型混乱的战斗也可能有用且令人兴奋。然而，请记住，任何有经验的玩家都会开始整理混乱——孤立地解决一种敌人类型，战斗的一小部分，而忽略遭遇战的其余部分。 敌人类型# 功能 对玩家的影响 1 辅导、休息 首先，孤立地关注特定类型。之后，简单/舒适，休息。 2 \"Regular\" 两种敌人类型以一种有趣的方式合作，即一种关系。 3 综合体 同时处理 3 种关系是很困难的，电子游戏里也是如此。 4 争吵 为了保持可读性，让两个派别以 2v2 的方式互相战斗。 5+ 屠宰 混乱的大乱斗。一开始很令人兴奋，但玩家不可避免地会关注一小部分。 《毁灭战士 2》（ Steam ）中的所有怪物类型。想象一下尝试同时对抗所有这些怪物：大约 1 秒钟既令人兴奋又有趣。 玩家画像 有关对玩家进行分类和研究的更多信息，请参阅 玩家画像 . 一个 玩家画像 指的是玩家整体的长期行为、动机和游戏风格。这就像玩家的个性，他们的“主要”，他们的“体型”，他们最喜欢的武器。一般不会改变。一些例子： 平台游戏 可能有跑步运动员、跳跃运动员、滑翔运动员、游泳运动员 射手 有狙击手、霰弹枪手、“喷雾和祈祷”、露营者 开放世界游戏 可能有探险家、战士、司机、收藏家 策略游戏 可能有冲刺者、海龟者、扩张者 所有游戏都有完成者、快跑者、传说猎人、主播、新手等。 （待办事项：图像） 然而，通过强烈的提示，您可以在短期内改变玩家的行为，理想情况下，这会影响他们的整体长期角色。一些例子： 鼓励未充分利用的机制： 玩家不使用重力枪吗？让玩家的其他武器弹药不足，到处放置物理道具，并使用大量移动缓慢的敌人。 （《半条命 2》（ Steam ）中的拉文霍尔姆） 限制被过度使用的机制： 玩家攀爬太多，把每一次穿越遭遇战都视为攀爬问题？可以增加持续降雨来限制攀爬。 （荒野之息中佐拉的领地） 每个项目都需要定义自己的玩家画像。 然后，对于每次遭遇战，决定你要支持哪些玩家画像/策略，以及具体如何支持。 示例：在科幻角色扮演游戏《赛博朋克 2077》中，玩家可以专攻黑客技能。因此，每次遭遇战都必须支持在每个竞技场中拥有多个可破解对象的“黑客”。有些遭遇战可能会利用可破解的机器人敌人，而另一些遭遇战可能会依赖可破解的摄像机和炮塔。但通常总有一些东西可供黑客使用。 竞技场设计 todo：分解 sock 的图表并单独讨论它们 西蒙·奥卡拉汉 (Simon O\u0027Callaghan) 为遭遇战而设计的不同楼层设计图 Simon O\u0027Callaghan 的不同 fps 遭遇战元素 示例：《战神》(2018) 中的战斗 Boss 在第三人称动作游戏《战神》（ Steam ）（2018）中，玩家可以尝试击败 9 个名为“瓦尔基里”的可选 Boss。所有女武神都具有相似的角色艺术、动画和动作设置，但在不同的条件下以不同的顺序使用这些动作，从而在构建战斗变化的同时有效地重复使用相同的资源。 玩家通过游戏进度和解锁区域来解锁头目，这意味着命令，但不强迫玩家按顺序与他们战斗。前三个是专门为玩家提供松散的教程来识别信号和电报的，尽管有时设计者会通过混合先前的模式来利用这个建议的顺序，迫使玩家重新学习新的计时。 前索尼战斗设计师 Jason de Heras 在 Twitter 上详细介绍了战斗设计 : Gunnr 有 2 种独立攻击，其作用是鼓励招架（黄色 FX）；他们的预期窗口/攻击速度相似，以允许一致的招架时机。 [它]鼓励玩家招架，但并不要求这样做。 Gunnr 的所有攻击都可以向左/右/后躲避或格挡[除了]在一系列初始攻击后执行的 1 次不可格挡（红色）攻击[...]，因此玩家有充足的时间进行准备。不可阻挡的攻击几乎为零跟踪，因此玩家可以以最小的精度向右躲避。 Gunnr 通常会躲避并发起独立攻击。这为玩家提供了明显的视觉效果，同时也为玩家提供了大量的分层预期时间（约 2-3 秒）来准备并对后续攻击做出反应。 [...] Gunnr 在躲避然后攻击后几乎没有停机时间，这可以说使战斗变得更容易。这减少了玩家必须制定策略的一个变量。设计者将强度保持在较高水平，但实际上却使敌人处于弱势地位。 动画 GIF 显示 Gunnr 的攻击，带有长期预期和黄色 FX 鼓励招架/躲避 (https://twitter.com/jasondeheras/status/1376005121830658049) 与 Gunnr 不同，卡拉有 2 种攻击，强烈迫使玩家躲避/格挡。由于这些攻击具有相似的启动姿势，因此玩家必须识别红色 FX 来选择躲避或格挡。 [...]卡拉分享了冈纳尔的冲刺，但[如果]玩家错误地招架/采取防御，他们将很容易受到附近的尸鬼的攻击，[增加紧张感。]卡拉的翅膀猛击是一种独立的攻击，在躲避和重置战斗时给她带来了另一种混乱。 [...] 卡拉之翼挥击的范围导致其故意错过。这可以让玩家入睡，并在他们不注意或变得贪婪时诱使他们进行攻击。最后的小突发前向翻译使这种攻击具有欺骗性。 Geirdriful 分享了 Gunnr 和 Kara 的一些动作，但为强大/全面的动作组添加了 2 种独特的攻击 [...] 与 Gunn/Kara 可以招架的冲刺攻击相比，她唯一的接近攻击是无法招架的，并且给了她高风险/高回报的攻击。 [...] Geirdriful 的侧翼猛击组合与 Gunnr 的相同，但用作独立攻击（而不是 Gunnr 的反击），这是另一种混合，使战斗变得更难以预测。 Geirdriful 与 Gunnr 机翼推力一样不可阻挡，但作为独立攻击，平移/速度有所增加。如果玩家首先与 Gunnr 战斗，那么在机翼推力不可阻挡之前移除机翼滑动将迫使他们重新学习这次攻击的节奏。 ——贾森·德·赫拉斯 (@JasonDeHeras) 显示《战神》(2018) 中瓦尔基里 Boss 的移动矩阵的电子表格细分， 作者：杰森·德·赫拉斯（Jason de Heras）（来自 Twitter） 示例：《耻辱》中的隐形 Boss 在潜行第一人称游戏《耻辱》的任务 7“淹没区”中，玩家面对的是 Boss NPC。他们可以在不被发现的情况下溜过老板或尝试与老板战斗。 Arkane Studios 关卡设计师 Dana Nightingale 评论了她这次遭遇战的设计文档： 通常我讨厌boss战，所以设计一个boss战来避免所有我不喜欢的东西是一件很兴奋的事。 [...] 设计与 Daud 的相遇仍然是我最自豪的事情之一。我喜欢看人们玩它。 大块的文本对于“开发评论”来说是很好的，但是如果你有一百个文档需要保持最新或者你是必须阅读它们的人，那么它就不会很好地工作。更简单，但传达更多信息始终是我们的目标。这真的很难。 ——达纳·南丁格尔 (@Dan"
                  },
                  {
                      "href":  "process__combat__enemy.html",
                      "title":  "敌人设计",
                      "description":  "制作具有特定行为、优点和缺点的不同类型 NPC 的原型",
                      "originalUrl":  "https://book.leveldesignbook.com/process/combat/enemy",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🔫 战斗"
                                      ],
                      "searchText":  "敌人设计 制作具有特定行为、优点和缺点的不同类型 NPC 的原型 什么是敌人设计？ 敌人设计 是关于原型设计 不同类型的敌对 NPC 具有特定的行为、优点和缺点。 敌人设计通常是人工智能设计师、程序员、角色艺术家、动画师、声音设计师等之间复杂的协作，这远远超出了这本The Level Design Book 中文版的范围。尽管如此，关卡设计师必须能够对敌人的设计进行概念化和理论化，即使他们不是负责实现敌人的开发人员。 有关一些敌人设计示例，请参阅 《毁灭战士》 尺度 和 《雷神之锤》 尺度 . 敌人名单可能极其复杂且多样； 《毁灭战士 2》（ Steam ）(1994) 中的怪物精灵，作者：id Software 敌人名册 想象一下我们正在制作一款动作游戏。以下是我们需要填补的一些基本角色 敌人名册 ，敌人类型的集合以及他们所扮演的战斗角色。 角色 行为 咕噜声 近距离近战攻击玩家直接，轻松拉 小队 中距离/远距离攻击，最好集体轮流攻击 领导者 高生存能力，以某种方式增强附近的盟友 坦克 生存能力高，但速度较慢且体型较大（容易被击中或躲避） 蜂群 小型快速攻击者，生命值低，但近距离伤害高 狙击手 远程攻击者速度慢弱，没有其他人的情况下非常脆弱 Valve Software 的《半条命 2》（ Steam ）(2004) 和《半条命：Alyx》(2020) 中不同的联合士兵设计 完成工作的敌方 NPC 通常需要设计师、美术师和程序员进行协作。这可能需要大量工作，而且远远超出了这本The Level Design Book 中文版的范围。 在这里，我们将重点关注战斗设计师/关卡设计师倡导游戏功能和可读性的责任： 独特 剪影 因此玩家可以在中距离（约 10 米以上）辨别敌人类型。 设计细节和动画 电报 敌人的状态、意图和优势/劣势。 例如：在《上古卷轴5：天际》中，巨人感觉又大又慢，你必须智取它并消耗它 “阅读层次结构”幻灯片强调人物轮廓和胸部高度对比，来自 “Valve 如何将艺术指导与玩法联系起来”（Gamefest 2008），作者：Moby Francke 和 Randy Lundeen 平衡名册 使用电子表格/矩阵来组织敌人名册可能会很有用： 角色 速度 健康 范围 输出功率 咕噜声 中等 弱 关闭 中等 小队 中等 平均 中 低 领导者 中等 平均 中 中等 坦克 慢 强 关闭 高 蜂群 快 弱 关闭 低 狙击手 慢 弱 长 高 这可以帮助平衡名单或指出差距，但不要让电子表格让您陷入一种思维方式。例如，在上面的矩阵中： 只有 1 个快速敌人？也许队长也应该很快，这样与小队相比感觉更有不同？ 没有高 DPS 中距离敌人。应该有吗？这会有趣或有用吗？ 这个矩阵设计是不是太简单了？我们需要“大小”列、“行为”列吗？等等 要分析现有游戏中的敌人名单：玩很多关卡，然后用自己的列制作自己的电子表格。 什么样的地形/位置最适合每种敌人类型？ 哪些敌人类型可以很好地协同工作？为什么？ 哪些敌人组合出现在哪些关卡中？ 步兵、精英、豺狼和猎人是 Bungie 制作的光环 1 (2001) 中独特的星盟派系敌人 敌人设计建议 关于设计敌人类型和名册的一些一般行业共识/建议： 多样性。 每种类型的战斗感觉都不同，避免类似的敌人。 层次结构。 有些类型较弱，有些类型较强。把这个排名搞清楚。 长寿。 类型不应该过时。游戏早期较弱的敌人在后期应该仍然很有趣，或者中期 Boss 应该转变为常规类型，等等。 出现。 敌人类型的不同组合应该会产生不同的情况。单独针对每种类型使用相同的策略，效果应该会较差。 情报。 给予智力和不同情绪状态（害怕、愤怒等）的错觉 “聪明”的敌人应该具有高生存能力/健康状况，否则他们会在炫耀自己有多聪明之前就死掉。 一致性。 感觉可预测，有清晰的模式供玩家识别和利用。 《毁灭战士 2》怪物的“正交单位微分”矩阵图，其中横轴是“后退 vs 冲锋”行为，纵轴是“射弹 vs Hitscan”攻击...幻灯片来自 “游戏和关卡设计中的有意义的选择”作者：Matthias Worch 2014 年游戏开发者大会 （幻灯片 PDF） 如何设计敌人 1. 定义核心敌人设计 对于大多数 3D 动作游戏来说，每个敌人的设计都需要回答这些问题，至少： 健康状况： 这个敌人有多强，一般能存活多久？ 速度： 这个敌人的移动速度有多快？比玩家慢还是快？ 伤害： 敌人的攻击有多危险？ 范围/行为： 敌人是近距离攻击还是中距离/远距离攻击？ 对于初始设计，具体数字不太重要，因为这些数字可能会发生巨大变化。估计“10%/50%/100%”或“低/中/高”就足够了，并在稍后实际开始原型设计和试玩测试时调整具体数字。 健康 玩家必须花费多少资源才能消灭这个敌人？ 健康变化：护甲/护盾，眩晕/交错 幻灯片摘自 2002 年 Bungie 设计讨论中关于《光环》（ Steam ）中敌人设计的内容，暗示与“更强=更聪明”的相关性 范围/行为 对于 3D 动作游戏《Skylanders: Spyro\u0027s Adventure》，动视暴雪设计师 Mike Stout 讲述了设计团队如何概念化 4 个主要原型（“近、远、群、重”）及其行为。他认为近战敌人本身通常很无聊，而远程敌人对于关卡设计很重要： “远方的敌人非常简单，他们只是向你射击的家伙。但他们非常有趣，因为环境很重要[在这里]。当你有近处的敌人时，因为他们无法从远处攻击你，所以你的环境根本不重要：你把他们放在一个壁架上，在掩体后面——这与在平面上战斗是一样的。因此，将远方的敌人添加到设置中，并将它们与其他类型混合，意味着突然间你的关卡设计将开始事。” - 迈克·斯托特， GDC 2012：“深入玩具箱：《Skylanders：小龙斯派罗历险记》的设计一探究竟” “远方敌人”幻灯片，列出了远程敌方 NPC 的核心 AI 行为，从 GDC 2012：迈克·斯托特（Mike Stout）的“深入玩具箱：《Skylanders Spyro 的冒险设计》一探究竟”（来自 GDC Vault） 范围变化： 弹丸设计（速度、运动模式） 大小（与远处的大物体相比，远处的小物体更难被注意到和攻击） 2. 白盒测试场地 一间大包厢房通常就足够了，不要花超过几分钟的时间 对于远程敌人，还可以构建凸起的壁架/间隙/掩体变化 用于侧翼和掩护的简单基本通用模式：冰世界 3 通路 3.原型敌人 创建占位符对象 彩色形状，如可滑动的块和胶囊 预制资产，重复使用现有的角色艺术，但具有不同的颜色 编写行为脚本 如果游戏引擎或工具具有强大的脚本系统或AI系统，您也许可以在不直接编辑游戏代码的情况下对敌人进行原型设计 但通常，你需要做一些游戏编程 常见的 AI 脚本模式：状态机、行为树或一堆 if() 块 对敌人原型进行试玩测试 如果可能，获取控制台命令/调试菜单，以便在运行时在游戏中生成更多敌人 4.调整敌人 一旦敌人在游戏中发挥作用，你的工作才刚刚开始。您现在必须调整敌人的统计数据和行为来实现您的体验目标。 对于早期的调整过程，仅进行较大的更改。 不要进行小的调整，因为在早期阶段您将无法注意到如此小的调整。 示例：假设您正在调整敌人的生命值...... 它有 100 点生命值，但感觉太弱，需要更强。不要尝试 115 生命值，这是一个很小的变化，您甚至可能在试玩测试中感觉不到任何差异。尝试改为 200 生命值。 如果 200 感觉太强了，恭喜！您现在已经建立了 100-200 之间的调整范围。现在尝试 150。 但如果 200 仍然感觉太弱，您应该尝试 300 甚至 400。继续前进，直到建立一个范围，然后反向。 5.让它休息一下，稍后再回来 在整个项目过程中，完整的敌人设计过程可能需要很多年的时间，因为你会逐渐添加新的敌人、武器、玩家进度、关卡等。 你的项目团队可能会突然削减一个半成品的敌人类型，以赶上重要的最后期限。或者，您可能需要将 boss 设计降级为较弱的可重用“midboss”类型。一个完美调整的敌人可能会突然感到过时或破碎。这就是创造力和游戏设计的本质：项目会改变和发展。 TODO：示例，HL2 斩波器 与《毁灭战士 2》中的小鬼、霰弹枪手和链炮手战斗的不同频率/节奏...幻灯片来自 “游戏和关卡设计中的有意义的选择”作者：Matthias Worch 2014 年游戏开发者大会 （幻灯片 PDF） 老板设计 （要做） 基本上与一般敌人的设计过程相同，但现在它是一个大场景 但在制作 Boss 原型时，您还应该继续迭代竞技场白盒 Boss 不一定是新的敌人类型，它可以是具有特殊脚本的现有敌人类型，甚至可以是围绕 NPC 设计的谜题。任何带有冲突和危险的高潮场景都会感觉像是一场老板之战。 要审查... 敌人设计 这是一项艰巨的工作，通常需要与美术师和程序员合作才能创建可用的游戏内敌人。 敌人名册 帮助您平衡生态系统内的敌人类型。避免没有明确目的或用例的多余敌人。 多样性 很重要。你可能需要弱与强、慢与快、小与大、近距离与远距离以及介于两者之间的一切的混合。 如何设计敌人： 定义核心统计数据，例如 健康 , 速度 , 损坏 ， 和 范围/行为 . 白盒 一个大盒子测试场地，但不要花超过几分钟的时间来制作它。 敌人的原型和 试玩测试 ，您可能需要脚本或编程知识。 反复迭代 敌人；尝试幅度更大的改动，在原型阶段避免拘泥于细小调整。 老板设计 是一种特殊情况，是与特定关卡更紧密联系的独特遭遇战。继续迭代 Boss 竞技场白盒。 现在怎么办？ 考虑其他一般 战斗设计 概念。 使用敌人 遭遇战设计 ."
                  },
                  {
                      "href":  "process__env-art.html",
                      "title":  "🏡 环境美术",
                      "description":  "细化形状并添加视觉细节，同时保持清晰度和功能性",
                      "originalUrl":  "https://book.leveldesignbook.com/process/env-art",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS"
                                      ],
                      "searchText":  "🏡 环境美术 细化形状并添加视觉细节，同时保持清晰度和功能性 什么是环境美术？ 环境美术 （或“环境美术”） 是关卡或游戏世界的装饰，同时保留其核心功能和玩法。 这项工作涉及建立一个模块、道具、纹理、材料和其他艺术资产的库，然后 美术处理 通过绘画/放置装饰来补充底层设计的水平。 比较关卡设计、关卡设计与环境美术的图表，使用来自 Dust 514 的“盖伦特研究设施”的过程图像 由 CCP Games 提供 在 2000 年代之前，关卡设计师也经常制作自己的环境美术。但如今，关卡设计师通常应该尽可能少地制作视觉艺术，而环境美术家通常应该等待成熟的设计师 白盒 在开始美术处理之前。然而，当在小团队中工作时，关卡设计师可能必须寻找或制作自己的环境美术，反之亦然。 这里 我们将重点关注一般环境美术原则 和高层次的关注点，以便关卡设计师可以更好地了解艺术流程并与环境美术家合作。 这不是一本环境美术书。 有关免费纹理、材质和模型的链接，请参阅 资源 . 有关专门的环境美术社区、网站和书籍的链接，请参阅 社区 . 动画 GIF 显示《狙击精英 4》（2017 年）中“死亡风暴”的迭代遮挡和美术处理流程（ 通过推特 ) 如何规划环境美术 在开始美术处理之前，您应该能够回答以下问题： 主题。 该关卡的时间、气候和位置是什么？ 玩法。 哪些部分需要重点强调？什么应该简单，什么应该详细？ 风格。 写实还是程式化？什么类型的现实主义，什么类型的风格？ 调色板。 整体色调如何，气氛如何？有哪些形状？ 生产。 哪些部分需要首先完成，哪些部分应该最后完成（或永远不完成）？ 有关规划的更多信息，请参阅 前期制作 和 调研 . 《最后生还者 第 2 部分》(2020) 的内部概念艺术、照片参考和剪影研究，板 作者：约翰·斯威尼 概念艺术 概念艺术 通常是用于规划游戏但不用于游戏本身的任何视觉艺术。 有时，概念艺术的目标是传达所需的主题或整体情绪，而有时，它必须传达艺术资产的技术规格和细节。问问自己，这个概念艺术是为了激发灵感，还是试图解决特定的视觉设计问题？ 鼓舞人心的情绪艺术在前期设计（尤其是向出版商推销商业项目时）或早期制作过程中最有用，但详细的技术艺术在后期制作中更有用。 如果您使用某人的概念艺术，请注明出处 ——或者甚至在开始之前联系艺术家并征求许可。如果您正在找工作，归因非常重要；每个人都认识每个人，不相信某人会看起来像是一个危险信号。 《传送门 2》（ Steam ）（2011 年）“地下金库”环境概念的第一人称概念艺术（涂装？） 覆绘分析 一个 覆绘分析 是一种概念艺术，从 3D 屏幕截图开始，然后艺术家逐字地“绘制”底层屏幕截图以可视化下一个版本。 覆绘分析是很常见的 白盒 用于计划美术处理的屏幕截图。此工作流程节省了大量时间，因为艺术家不必手动起草基本形状的透视计算。因此，即使是 2D 艺术家也应该至少具备一些 3D 艺术工具的基本知识，这样他们就可以构建自己的绘画模板。 有时，艺术家会完全渲染一些看起来已完成的概念艺术（见上图）……但通常覆绘分析是为了在艺术家之间提供直接反馈：建议的编辑、更正和注释（见下图）。 带有亚当·登克尔 (Adam Dencker) 为“采石场”所作笔记的涂装注释 （来自 Artstation.com） 模型表 一个 模型表 是针对单个艺术资产的更具体类型的概念艺术，其中包括供制作艺术家使用的正交视图，以及用于展示如何在游戏中使用该资产的上下文模型。 在下图的概念艺术/模型表中，请注意我们如何很好地了解这个八角形冰晶平台模型如何融入整个环境主题。此外，正交顶视图和底视图回答了道具艺术家有关结构和颜色的问题，并且可以轻松导入 3D 建模工具作为参考。正字法强调了每个平台的金色边角装饰，而右下角的插图显示了边角装饰如何平铺在一起以产生连锁的视觉效果 - 它可以帮助环境美术家了解哪些细节对于保留和延续到游戏内资产很重要。 组合概念艺术、模型表和油漆 通过莎拉·莫里斯 小龙斯派罗：重燃 艺术资产 经过一番策划后，艺术家创作出艺术品 资产 -- 直接插入关卡的视觉对象。与概念艺术不同，这是游戏引擎必须读取的内容以及玩家将在游戏中看到的内容。 制作艺术资产时，请记住： 简介。 任务是什么？这个资产需要做什么？ 批准。 谁对此资产提供反馈？我们如何知道它是否有效？ 范围。 制作这项资产需要多少时间？罕见的小细节值得花更少的时间。 工作流程。 制作这个资产需要多少步骤？在哪些工具中？ 管道。 如何将艺术作品导出为引擎可以读取的格式？ 具有较大团队（6 人以上？）的长期项目（6 个月以上）应该规范这种艺术制作流程，以避免成本高昂的重做、工作浪费和沟通不畅。维护电子表格或看板来跟踪任务，并使每项资产通过不同的测试和团队审查阶段。虽然所有这些任务跟踪一开始可能会感觉很慢，但从长远来看，沟通和清晰度会更快。 有关组织工作任务和团队沟通的更多信息，请参阅 生产 . 具有三个审查阶段的艺术制作流程图，来自 Hannah Mackintosh 为 Play By Play 2021 撰写的“通过批评同事所做的一切，成为最好的自己” 大多数关卡的艺术资源都是 2D 纹理或 3D 模型，但在本节中，我们稍后还将简要讨论着色器和特殊 FX。 资产清单 在制作环境美术之前，您可能需要制作一个 资产清单， 特定场景或关卡所需的所有艺术资源的列表。资产列表通常采用某种电子表格格式，列出每个资产的优先级和预计生产时间。 在下图中，艺术家制作了一个按月/周分组的资产列表电子表格。他们估计每周大约有 30 个小时的工作时间，并优先考虑场景遮挡/最重要的关卡几何资源。材质和细节道具只会在基础建立之后才会发生。 Vincent Dérozier 的 3D 场景“大浴场”的资产列表/日历/“区块计划”， 通过艺术站 材质和纹理 纹理 是覆盖地图 3D 表面的 2D 图像。自 2000 年代以来，我们经常将多个纹理组合在一起 材料 ，带有粗糙度、光泽度、发光等附加数据的纹理束。 对于环境美术来说，肌理设计和布局非常重要。与角色皮肤不同，我们经常在整个关卡中大量重复使用世界纹理。理想的环境纹理需要能够在许多不同的情况下正常工作：它应该很好地平铺在整个表面上，但也可以轻松地分成可重复使用的部分。 有关纹理和定义材质的更多信息，请参阅 材质 . 中世纪房屋的纹理映射，来自《骑马与砍杀》 模块化套件 一个 模块化套件 是一个 3D 瓷砖集，由 模块 ，环境网格设计为以多种方式组合在一起。模块对于经常沿网格重复使用的建筑物和结构最有效，但对于有机或自然形状则效果不佳。 有关如何规划、测量和构建套件的更多信息，请参阅 模块化套件设计 . 重复使用模块化墙段（左）来建造圆形房间（右）； 莉亚·克罗嫩伯格 (Lea Kronenberger) 的示例 在许多情况下，模块化网格无法完全连接，尤其是在离网或以非 90 度角构建时。尽管如此，您可能仍然想保留某些角度或奇数长度，例如 标准尺度规范 原因或唤起一种坚韧肮脏的非制造的自然感觉。在这些情况下，只需让模块自由相交，然后用另一个对象覆盖杂乱的相交即可。 例如，假设您有两个以奇怪角度相交的矩形地板网格 - 将它们尽可能地无缝连接，然后用墙壁、柱子、岩石、板条箱、汽车等覆盖交叉点。问题解决了！ 如何以奇怪的角度连接两个模块？只是掩盖混乱！ 乔·温特格林摄 英雄道具/地标 英雄道具/英雄建筑应该在关卡中占据重要地位 不要把英雄资产放在不好的地方...不要在垃圾箱里吉他独奏，它就是垃圾箱，继续你的生活 对于多人游戏地图，独特的地标赋予一个区域以身份，并有助于促进 标注 ，简短易记的昵称，玩家可以用来快速谈论地图的不同部分。 下面是 Lydia Zanotti 在《Valorant》地图 Breeze 上为站点 B 制作的英雄资源。这座大塔看起来很重要并且正在积极使用，其独特的深色金属机械与米色的石头废墟形成鲜明对比。该设计支持“辐射石”（发光的青色物质）是一种重要的控制资源的游戏传说，以及游戏功能，使其底部没有分散注意力的形状或轮廓。最重要的是，它在整个地图中只使用一次，使该区域感觉特别和独特。 《Valorant》的涂装概念艺术、首次通过模型和最终美术处理 通过莉迪亚·萨诺蒂 细节（道具、树叶、杂物、布景） 树木 一般植物技巧教程图片 作者：玛丽·拉扎尔 (pixelbutterfly.com) 对于高大的森林树木，不要在每个树干上都盖上树冠，并确保底部有细节 https://www.gamasutra.com/blogs/DannyWeinbaum/20170216/291658/Art_Tips_for_Building_Forests.php 可读性 可读性 是关于玩家是否可以在你的关卡中行走并“阅读”他们所看到的内容。简化玩家必须看到的内容。使其清晰易读。 目标是让玩家将关卡理解为一个整体，而不是一堆随机的地板和墙段。 玩家是否有足够的信息来了解当前的游戏状态？ 他们可以轻松地从远处看到敌人/游戏对象吗？ 他们能了解敌人是闲置、仇恨还是受伤吗？ 玩家能否理解他们可以去哪里、不能去哪里、应该去哪里、不应该去哪里？ 当一个关卡从抽象开始时 白盒 形式，非常简单易读。然而，当我们向世界添加额外的视觉细节时，关卡几何形状变得不那么清晰并且更加嘈杂。通过“繁忙”关卡的艺术将会“难以辨认”且难以阅读。 动画 GIF，展示了《反恐精英（ Steam ）：全球攻势》中 de_cache 的视觉开发和可读性，由 Shawn Snelling 创作，来自 GDC 2015：竞技 CS:GO 的社区级设计 在上面的动画 GIF 中，请注意 CS 地图 de_cache 如何从具有阴影繁忙细节的黑暗高对比度关卡变为具有较少视觉对比度的更明亮、更均匀的阴影关卡 - 这种对可读性的让步对于游戏和观众来说是有意义的。 有些游戏，如密室逃脱、隐藏物品游戏和道具狩猎，都是关于解析繁忙杂乱空间的乐趣。然而，像《反恐精英》或《Valorant》这样的快节奏多人射击游戏在很大程度上依赖于瞬间反射瞄准和快速判断，这些玩家可能会将失败归咎于难以理解的关卡。 当你通过关卡并应用布景时，这些细节的积累会影响玩家对空间的理解。 《The Last Of Us Part 2》（2020）中 ivy 可读性的内部风格指南 作者：约翰·斯威尼 例如，在对《最后生还者 第 II 部分》中的环境做美术处理时，顽皮狗艺术家使用常春藤覆盖（见上图）来表示被忽视的封闭建筑物，同时清除常春藤以表示玩家应该进入的开放建筑物。还要注意常春藤如何使立面结构变平。玩家不再需要检查每一扇窗户来判断它是否可以通航或相关——一座完全被常春藤消耗的建筑意味着它是关闭的，并分解成一个绿色的斑点。因此，ivy 的作用是简化视觉环境并充当玩家的导航辅助工具。只要所有设计师和艺术家在使用常春藤方面保持一致，这种装饰性树叶效果就具有超越视频游戏看起来多么华丽和昂贵的新含义。 但这是秘密：一切都是常春藤， 环境美术中的一切都具有可读性功能。 当你通过关卡的任何部分时，你正在完善视觉模式，帮助玩家推理空间逻辑。 可读性也很大程度上取决于 体块 , 标准尺度规范 ， 和 构图 . 聚类 为了帮助玩家更轻松地解析和理解游戏世界，请尝试将布景组合成相关细节。邻近性、相似性和隐含的关联性有助于我们将物体视为群体和模式。这对应于一个 格式塔理论 的感知。 要制作岩石露头，请放置一块岩石，然后复制、缩小、旋转并稍微偏移......然后重复。要制作森林，请放置一棵树，然后复制、缩小、旋转并稍微偏移......然后重复。您可以对任何类型的自然布景，甚至您的风景构图重复此工作流程。尝试以不对称的分形结构构建这些构图，以赋予道具放置重复的逻辑感和一致性。 岩石、树木、地形甚至水桶的“分形”簇，来自 Allods Online 艺术圣经 安东·拉夫鲁什金 颜色和价值 避免深度饱和的颜色，为照明留出空间......如果您制作非常红色"
                  },
                  {
                      "href":  "process__env-art__optimization.html",
                      "title":  "优化",
                      "description":  "诊断关卡的性能问题并对其进行调整以使其运行更顺畅",
                      "originalUrl":  "https://book.leveldesignbook.com/process/env-art/optimization",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏡 环境美术"
                                      ],
                      "searchText":  "优化 诊断关卡的性能问题并对其进行调整以使其运行更顺畅 当您尝试玩自己的关卡时，游戏运行是否非常缓慢？您的玩家或试玩测试人员是否抱怨延迟、帧速率低或加载时间长？如果是这样，那么也许是时候优化你的关卡以使其运行更高​​效了。 什么是优化？ 优化 是诊断问题并简化游戏或关卡性能的过程。它往往非常复杂和具体，远远超出了这本The Level Design Book 中文版的范围。就像映射一样，更好地优化的唯一真正方法是优化大量游戏，并从您的经验中学习。 谁的工作？ 在团队中工作时，许多性能考虑因素将远远超出关卡设计师的职责范围。 例如，如果寻找两个 NPC 使游戏帧率降至 5 FPS，那么优化就是引擎/AI 程序员的工作。然而，如果关卡设计师试图创造一场与数十个 NPC 的大规模战斗，而游戏本来就不应该支持这种类型的遭遇战，那么显然关卡设计师的错误可能更大。 大型商业工作室会聘请技术美术和技术关卡设计师，他们的主要职责可能涉及优化美术资产和关卡。但在较小的开发团队中，优化基本上是每个人的责任。 何时优化 “不算太早，也不算太晚。” 过早优化是 “过早优化” 这是浪费时间，因为你的项目将会发生巨大的变化。为什么要优化玩家可能永远不会看到的东西？ 但你怎么知道最终版本中是否会有某些内容呢？可能只有当它运行良好时......有时你只有在尝试优化它之后才能做出判断。 规划优化 理想情况下，优化是您从一开始就计划好的事情。早在 前期设计 ，您应该能够回答有关项目技术范围的以下问题： 目标平台是什么？ 例如，为手机制作开放世界游戏比为桌面游戏设备制作复杂得多。 关卡有多大？ 大型开放世界城市或 RPG 大陆需要以较小的块建造，并在游戏过程中小心地加载/卸载，并且 白盒 因此。 关卡有多密集？ 现实的户外世界可能需要大量昂贵的重叠细节，而风格化的手绘世界可能更加稀疏和简化。 开放程度如何？ 具有频繁门的狭窄室内关卡可以更好地利用遮挡剔除，而大型开放的室外景观则难以划分为多个部分。 什么是摄像头系统？ 例如，第一人称相机可以看到长视线，因此密集的关卡可能需要某种遮挡剔除。第三人称固定摄像机角度意味着您可以对视锥体剔除进行强大的控制，如果特定摄像机角度滞后，那么您可以简单地重新定位摄像机或将摄像机转开。 绩效预算 视频游戏在资源有限的计算机上运行。当您的项目过度使用其时，就会出现滞后的低帧率 预算 对于以下一种或多种资源类型： 游戏由加载到的文件组成 记忆 。当您启动游戏时，它将核心文件移动到称为 RAM 的更快类型的短期内存中。如果有太多文件需要加载到 RAM 中，那么加载时间将会很长。 如果您的关卡使用大量不同的详细模型、纹理、声音或动画，那么它可能会超出其范围 内存预算。 这 中央处理器 是计算机的主要部分，运行文件系统、控件、游戏逻辑、人工智能和音频。如果你有太多的 NPC 在一座复杂的大城市中航行，那么 CPU 可能必须努力工作才能模拟他们所有的 AI。或者想象一下，虚拟城市中有数千只昆虫，并且您每秒都在不断地创建/删除昆虫。 如果您的关卡具有许多不同的模拟对象，那么它可能是 CPU 限制。 这 图形处理器 （图形处理单元）负责在屏幕上渲染图像。它必须收集所有可见的 2D 精灵和 3D 模型，并使用称为着色器的特殊 GPU 程序对其进行处理。当需要绘制的对象太多或着色器非常复杂时，GPU 会花费更长的时间来渲染相机视图。 如果您的关卡具有视觉密集的对象，甚至数千个简单对象，那么它可能是 GPU 限制。 在谈论预算时，游戏开发者扩展了这个财务比喻： 贵 = 消耗大量内存或处理时间 例如：“哇，那个着色器让我们的游戏以 10 FPS 运行，太贵了！” 便宜 = 使用很少的内存或处理时间 示例：“当玩家距离 10 米时，我们更换为廉价的水着色器。” 分析 游戏运行缓慢的原因有多种：内存、CPU、GPU 等。要找出游戏的哪个部分导致速度缓慢，我们必须测量游戏引擎正在执行的操作 - 这称为 剖析 . 永远不要尝试根据信念或直觉进行优化，因为您可能错误地认为导致游戏运行缓慢的原因是错误的。 分析应该是任何优化过程的第一步！ 幸运的是，现代游戏引擎具有一套强大且易于使用的分析工具。 如何在 Unity 中分析关卡 试玩测试与 游戏选项卡中的统计面板 寻找基本方向 如果您受 CPU 限制，请使用 分析器 并查找哪些代码函数运行频率很高或似乎很耗时；如果您不是程序员，您应该与程序员交谈 如果您受 GPU 限制，请打开 GPU 分析器 甚至是 帧调试器 ，并尝试找出是否在错误的时间或地点渲染了太多内容，或者剔除/批处理/实例化是否在某个地方发生了破坏 这 Unity 中的 GPU 分析器 ;注意两个主要统计数据：绘制调用和毫秒 如何在虚幻中分析关卡 在 Unreal 中，转到项目设置 → 常规设置 → 帧速率和 禁用平滑帧速率， 它将帧速率调整为一定的增量并会误导您 在试玩测试时，在控制台中输入 统计单位图 显示基本 CPU 和 GPU 时间 如果您受 CPU 限制，您可能需要使用 虚幻见解 ，也许你有太多的演员或者你的一些蓝图调用很昂贵 如果您受 GPU 限制，请在控制台中输入 统计场景渲染 并查看您的绘制调用和帧率的走向 看到 下面的虚幻优化资源 （TODO：虚幻图像） 优化图形 绘制调用 除非有很多复杂的游戏系统或脚本发生，否则大多数游戏关卡通常都是 GPU 限制： 显卡有太多工作要做。 在分析 GPU 性能时，需要关注的主要统计数据是 绘制调用， 发送到 GPU 的渲染命令。更多的绘制调用通常会更糟。你希望这个数字更小。 设备类别 大约抽奖电话预算 旧手机、移动 VR (Oculus Quest) 50-100 现代手机 100-400 低规格桌面、VR桌面 500-1000 PS4 / XB1 / Switch ~1000 中规格台式机 ~2000 PS5 / Xbox 系列 X ~3000 高规格游戏玩家台式机 ~5000 你现在需要优化 ~10000+ 为了减少绘制调用，引擎实现了某种形式的（a） 批处理 或 (b) 实例化。 配料 是指 CPU 将多个绘制调用合并为一个绘制调用。 想象一个关卡有 10 棵不同的树；我们可以将它们全部组合成一棵巨型树，并将其作为一次绘制调用发送到 GPU。这种方法通常需要一些预先计算和精心构建，但它适用于多个不同的网格和对象。 参见统一： 静态配料 ，虚幻： 层次结构的详细程度 ，戈多： 配料 实例化 是指 GPU 多次重复相同的绘制调用。 想象一个关卡有 10 棵相同的树；我们可以告诉 GPU 对每棵树重复相同的渲染工作。此方法几乎不需要关卡设计工作或准备工作，但它仅适用于同一网格的精确副本。非常适合 模块化 工作流程，它使用相同模块化套件图块的许多副本。 参见统一： GPU实例化 ，虚幻： 分层实例静态网格体 在游戏开发中，“实例”也意味着任何游戏对象或数据的“复制”或“克隆”。不要混淆实例与实例的一般用法。 GPU 实例化。 如何优化绘图调用 灯光，关闭阴影...为什么阴影如此昂贵/额外的绘制调用 批处理共享材料： 纹理图集 是由许多较小的纹理组成的大型复合纹理，通常排列成方形网格。就像由许多部分组成的 2D spritesheet 一样，将许多纹理“打包”到一个更大的纹理中是一种有用的方法。 优化 减少绘制调用并有效地使用内存。缺点是生成的资源使用起来不太灵活（UV 对应的区域很小，纹理无法轻松平铺），或者如果手动优化，甚至可能会降低性能 距离剔除、视锥体剔除、LOD...但是如果您有很多对象，那么 LOD 的开销就不值得（顽皮狗） 遮挡剔除 可见门户，手动剔除 着色器优化： 不透明着色器几乎总是比 alpha 透明度更好...建模出复杂的形状比 alpha 遮罩透明度更好，无论如何，额外的多边形计数对于绘制调用或批处理来说可以忽略不计 什么是大多数硬件上的 alpha 测试 +，alpha 测试比 alpha 混合快得多...平滑的锯齿状边缘与 alpha 覆盖 在某些移动设备上，alpha 混合比 alpha 测试更快 对于树叶，将地理调整到不透明 alpha + 合并多个网格 + 最小化重叠 + 使用不透明核心 + 避免使用通用对象数据结构（不要手动放置每个草丛） 产生更少的AI 填充率 TODO：粒子和透明度 灯光 前向渲染 表示显卡（GPU）直接处理每个对象 前进 方式，分别渲染和照明每个 3D 对象。这里通常应该避免重叠的灯光，并使用尽可能少的光源。 延迟渲染器 延迟照明计算，直到将所有对象收集在一起，然后立即照亮所有可见像素。在这里，您可以使用许多重叠的灯光和光源，但透明物体可能看起来很糟糕。 引擎通常同时使用这两种技术，或者混合搭配不同的部件。 （图片：前进与延迟） 《守望先锋 2》（ 官网 ）中“纽约市”的球谐 (SH) 光探头的开发视图，图片由 Bruce Wilkie 提供 （来自 Play《守望先锋》.com） 要审查... 优化游戏是一个复杂的过程，涉及各个学科和开发人员。这远远超出了本书的范围。尽管如此，我们还是尝试给出在 Unity 和 Unreal 等常见引擎中优化 3D 关卡的基本思路： 看性能 统计/分析器 看看什么是慢的， 不要只是猜测 如果是 CPU 限制， 也许有太多活动对象或 NPC，或者关卡脚本行为不当，或者关卡太大 减少活动物体或 NPC 的数量； 重新设计遭遇战 调试你的关卡脚本； 向别人寻求帮助 这也可能是一般游戏代码问题，与您无关 如果是 GPU 限制， 也许有太多的灯光或环境美术对象，或者材质/着色器太复杂，或者关卡太大 减少灯光 ，使用更简单的照明模式，关闭阴影投射 使用相同的材质组合多个对象 批处理 使用相同的材质和网格组合多个对象 GPU实例化 考虑使用某种 遮挡剔除 / 可视性系统 简化材料， 使用更少的纹理采样器和渲染命令 这也可能是一般游戏代码问题，与您无关 延伸阅读：Unity 优化 延伸阅读：虚幻优化 “使用虚幻引擎 4 优化和分析游戏” Vincent Loignon 的 (2016) 是一篇旧文章，但仍然是对一般优化过程的有用介绍。 “UE4 - 静态网格体优化选项概述” Bob Cober 的 (2017) 也有点旧，但对于环境美术家和关卡设计师来说非常有用。 《虚幻艺术优化：衡量性能》 是专为虚幻开发人员编写的技术艺术家书籍的一部分。 “UE4 图形分析：测量性能”(YouTube) 由 Tech Art Aid 制作的可能是有关虚幻分析的最有用的介绍视频教程。 GDC 2019：“将您的作品移植到 Oculus Quest”(YouTube) 作者：Alex Silkin 看起来像是 VR 开发者演讲，但实际上更像是 Unreal 性能优化演讲。 Silkin 讨论了适用于任何虚幻游戏的具体工作流程和瓶颈。 《地平线：零之曙光》使用了各种巧妙的技巧，让画面看起来非常漂亮 - Kotaku 小宅 为什么视频游戏图形（仍然）是一个挑战？产品化渲染算法 巴特·朗斯基 《光环》 Infinite - 可扩展性，Mikael Nellfors 艺术站"
                  },
                  {
                      "href":  "process__env-art__psychology.html",
                      "title":  "形状与色彩心理学",
                      "description":  "将抽象视觉现象与普遍人类行为联系起来的狗屎设计理论",
                      "originalUrl":  "https://book.leveldesignbook.com/process/env-art/psychology",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏡 环境美术"
                                      ],
                      "searchText":  "形状与色彩心理学 将抽象视觉现象与普遍人类行为联系起来的狗屎设计理论 形状心理学 和 色彩心理学 认为，形状或颜色能够传达普遍观念，并影响人的行为。 据说，圆形象征着无限，水平线让你感觉更稳定，正方形象征着平衡（但三角形象征着稳定！），显然，画一片叶子会让你感觉温暖。或者什么。 听着，这就像占星术。想想就很有趣。如果它能让你更快乐，那就去做吧。 但别把它太当真，也不要试图把它抬高成一门科学。因为一旦你把形状与色彩心理学当成一套自洽的设计理论来推，它很快就经不起推敲。 哇，那张叶子的照片让我感觉很舒服，是的，这太棒了 意义并不具有普遍性 抽象的几何形状和颜色本身并不能让所有人感受到相同的事物或传达相同的想法。 例如，让我们评估一个常见的色彩心理学主张： “红色在潜意识中会引发危险” 也许是因为血液是红色的，当你的健康状况不佳时，红色信号和红色停车标志以及电子游戏会闪烁红色。听起来很有说服力……但在中国，这个很可能是世界上最大的电子游戏消费市场，红色常常象征着好运、财富、繁荣和欢乐的中国，情况是否仍然如此？红色到底向 8% 患有红绿色盲的欧洲男性传达了什么信息？当农民把谷仓漆成红色时，他们是想传达危险还是强度？ 形状和颜色是抽象现象，对世界各地的每个人来说并不具有普遍意义。相反，形状和颜色在不同情况下意味着许多不同的事物，而这种含义在很大程度上取决于个人背景和受众。 哇，看看所有红色的东西！极其危险！如果你看到这些，最好逃跑！ 意义取决于语境 “水平线传达稳定性”... 直到我们看到一条湍急的河流，上面布满了残骸。 “S型曲线感觉很和谐”... 除非你开着车超速行驶，并且必须踩刹车以避免从意外的 S 曲线道路上倾斜。 很容易想象在许多情况下，关于形状或颜色的笼统陈述是行不通的。最坏的情况是，所有这些笼统的陈述都感觉完全错误。充其量，它极大地简化了艺术创造意义的方式。 意义来自文化，也来自学习 想象一下，你正在玩《堡垒之夜》（Fortnite）（ Epic ），看到一个绿色物品，系统告诉你它属于“罕见（Uncommon）”品质。绿色本身真的会让你立刻想到“罕见”吗？那紫色的“史诗（Epic）”物品呢？设计师使用紫色，是因为紫色天然就代表稀有或史诗感吗？可“传奇（Legendary）”品质的物品又是橙色的。难道橙色在全世界都天然比紫色更“高级”吗？ 答案是：我们其实不需要纠结具体颜色本身的联想，因为真正起作用的不是颜色的所谓“天生含义”。 这些颜色编码，是随着《命运》《暗黑破坏神》这类刷宝游戏建立自己的装备品质系统逐渐演化出来的。 游戏里的颜色之所以有意义，是因为类型惯例。 如果这些颜色含义让你觉得一致、自然，那更多是因为你已经熟悉某一类玩家文化，而不是因为颜色在人类世界里有某种普遍的内在含义。 游戏有自己的心理机制 即使形状与色彩心理学不是胡扯，它也不一定能直接迁移到电子游戏语境里。 人在现实世界里可能会这样行动，但到了游戏里，行为方式往往完全不同。玩家行为更多取决于游戏模式、机制、可用信息、文化框架，以及玩家当下代入的角色身份，而不是某个形状到底是圆的还是方的。 “尖锐的东西很危险！”…… 直到游戏要求你收集尖晶体，用它来制作珍贵道具。 “圆形让人感觉安全！”…… 直到你的游戏里出现了一个圆滚滚但很危险的敌人。 游戏系统，以及玩家对系统的理解，会压过来自现实世界的那些所谓“自然”或“潜意识”含义。 没有它反而更好 因此，我们认为 形状 / 色彩心理学并不能真正解释玩家是如何玩游戏的。 也许我们应该多信任人类一点？没有人会只是看见一个圆形，就想：“哇，我好喜欢这个圆，我现在要朝它走过去。” 有些美术可能会说，色彩心理学 / 形状心理学本来就不该按字面理解；或者说，这些理论作为一套极简化的入门提示也有价值，至少能把初学者“骗”进 构图 思考里。我们的回应是：那不如制定一些更好的准则。 所以，还是让形状与色彩心理学待在它原本的位置吧：一种方便靠搜索流量包装出来的低质营销博客和顾问兜售观点的万能药式话术。 另请参阅 色彩理论 研究的是色彩组合和调色板的规律。它和色彩心理学不是一回事，因为（1）色彩理论是真实存在的知识体系，并且（2）它对“颜色如何起作用”的主张要小得多。 符号学 是研究符号和意义的学问，而且复杂得多。"
                  },
                  {
                      "href":  "process__env-art__storytelling.html",
                      "title":  "叙事",
                      "description":  "如何通过关卡设计承载叙事",
                      "originalUrl":  "https://book.leveldesignbook.com/process/env-art/storytelling",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏡 环境美术"
                                      ],
                      "searchText":  "叙事 如何通过关卡设计承载叙事 为什么要用关卡设计来讲故事？ 许多玩家都喜欢电子游戏中的叙事体验。探索虚拟空间、遇见虚拟世界中的居民，并看到自己的行动以大大小小的方式影响这个虚构的游戏世界，本身就很有吸引力。商业动作游戏和角色扮演游戏，往往会把世界设计当作装饰关卡的主题“外皮”；而步行模拟类游戏则会把这些叙事体验提升到非常核心的位置。每个项目都会根据自身的核心支柱和设计目标，以不同程度强调环境叙事。 叙事设计显然是一个庞大而复杂的话题，完全值得单独写一本书。因此，这里我们只关注关卡设计师、环境美术师和脚本设计师参与的叙事工作： 节奏 ：关卡中事件的整体剧情走向和先后顺序。 世界观构建 ：对关卡所处场景、背景和设定的概念设计。 环境叙事 编排演出 环境叙事 在关卡设计中， 环境叙事 指的是通过关卡本身，传达或暗示某个已经发生过的事件。 世界观构建关注的是整个虚构游戏世界，视角更宏观；而环境叙事则会把镜头拉近，关注更具体的单个房间、单个场景：这里发生过什么？在这个特定房间里，这些特定角色之间发生了什么？ 示例：《到家》（Gone Home（ Steam ））、《万众狂欢》（Everybody\u0027s Gone to the Rapture） 编排演出 环境叙事很适合表现过去发生的事件，或静态的背景故事；但它无法直接表现“此时此刻正在发生”的事件。为此，我们需要另一种工具： 编排演出 。编排演出是一种游戏叙事形式，指游戏中的角色、物体或事件在玩家镜头前移动、变化和发生。比如角色一边走一边说话、汽车撞破墙面、怪物从阴影中低吼现身，这些都属于脚本序列，通常会用独立于主关卡编辑器的工具来编排。 示例：《半条命》的脚本序列实体、《半条命 2》（ Steam ）的 FacePoser 工具、Telltale 的编排工具、《巫师 3：狂猎》（The Witcher 3: Wild Hunt）的编排工具，以及 Unity 和 Unreal 中基于关卡片段的设计流程。 情节型关卡设计 从更广泛的意义上来说，游戏中的一切都应该充当叙事。玩法和谜题也是叙事的一部分。为了讲述有效的游戏故事，叙事设计师 艾米丽·肖特推荐 将故事紧紧地绑在 主动线 : 你的工作是让玩家在不理解你的故事的情况下尽可能难以完成你的游戏。 [...] 这意味着玩家必须遇到并且最好利用故事中的每一个关键信息。 “遭遇战”可能意味着“在屏幕上阅读”或“在对话中听到”或“在过场动画中看到”，但在交互式环境中接触信息的价值远不如使用信息的价值。因此，如果玩家需要对每个关键叙事节点采取行动，那就最好了。 为此进行设计，首先要确定关键叙事节点。为了理解这个故事，读者必须了解哪些事实？ 这是读者可能知道的所有事实的一个子集，可能是一个非常小的子集。许多世界构建细节和次要角色动机可能可以被省略，而不会破坏体验。但如果你的故事的影响取决于玩家了解主角的秘密动机，那么这些信息就至关重要。 [...] 找出哪些信息至关重要。列一个清单。对自己诚实并让清单尽可能简短。 [...] 获得重要数据列表后，找出依赖关系。哪些事实依赖于其他事实才有意义？如果哪些事实出现在其他事实之后，那么它们会产生最大的影响？如果在我们看到主角犯罪后了解他们的秘密动机会更有效，这就提供了下订单的动机。将您的列表变成依赖关系图。 ——艾米丽·肖特， 《情节型关卡设计》 , 2016 年 5 月 18 日 审查 接下来怎么做？ 理想情况下，关卡的叙事设计始于 前期设计 ，在概念化项目核心时 体验目标 。在 生产 ，讲故事依赖于以下因素的组合 脚本编写 , 美术处理 ， 和 灯光 . 尝试讲环境叙事练习。"
                  },
                  {
                      "href":  "process__env-art__texturing.html",
                      "title":  "材质",
                      "description":  "用 2D 图像覆盖 3D 表面",
                      "originalUrl":  "https://book.leveldesignbook.com/process/env-art/texturing",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🏡 环境美术"
                                      ],
                      "searchText":  "材质 用 2D 图像覆盖 3D 表面 什么是纹理/材质？ 一个 纹理 是环绕 3D 对象的 2D 图像，例如动物皮肤或壁纸。 对于关卡，我们通常应用 环境纹理 覆盖游戏世界中的地板和墙壁。 早期 3D 游戏为每个对象使用一个纹理。 Photoshop中绘制的颜色往往与游戏中看到的颜色相同，非常直接和直接。但今天我们经常一起使用多种纹理，而不是只使用一种。 一个 材料 是一组纹理贴图+表面设置。每个纹理贴图代表不同的方面或质量，而不是在屏幕上渲染的实际颜色。虽然打包纹理和材质的方法有很多种，但大多数 3D 游戏引擎中的大多数材质都使用以下四种主要纹理类型： 漫射 或 反照率 （发音为/AL-bee-doe/）是表面的基色 对于透明材料，还包一个 透明蒙版 进入反照率的 Alpha 通道 法线贴图 或 凹凸贴图 对表面的微观细节、划痕、压痕进行编码 高光贴图 , 光泽度 , 粗糙度 , 光滑度、金属感 影响光泽/反射率 环境遮挡 （“AO”）使阻挡（遮挡）光线的接缝、裂缝和缝隙变暗 （材料图） 纹理类型 世界纹理 世界纹理 是可以重复平铺使用的贴图，用来覆盖关卡几何体的基础表面。它们通常是关卡中最主要的地面和墙面纹理。 好的世界纹理通常需要做到： 在远、中、近不同观察距离下都能读得清楚 从短距离、中距离或长距离看，材质本身都能被清楚辨认 看起来很有趣，但又不会太有趣而分散注意力 帮助寻路（或阻碍寻路，如果这是您的设计目标） 能够自然平铺，不出现明显穿帮的接缝，也不要有刺眼的重复图案 例如重复的木板边缘轮廓是可以的，但明显复制粘贴的木纹或污垢图案可能会感觉不自然和奇怪 与底层关卡几何体的 体块 关系相匹配 例如不要对 2 厘米厚的墙使用砖纹理 与关卡 / 游戏整体的 世界观构建 和虚构背景保持一致 不同地形纹理的“渐变” 作者：Marie Lazar（来自 80 级） 岩石纹理 岩石纹理需要专门的规划和设计。地壳构造力会把悬崖和山体塑造成独特的形状与层理；如果希望一张悬崖纹理看起来像真实可信的悬崖，那么纹理结构就应该体现这种地质特征，并强化悬崖几何体本身的形体。 对于低多边形的悬崖几何体来说，如果岩石纹理本身有很强的结构和裂缝走向，它会在视觉上打散岩体外形，让这块岩石看起来比实际模型复杂得多。可以把岩石纹理划分成层理或块面。毕竟，现实中的岩石本来就是这样形成的。 Philip Klevestav 通过偏移修复接缝（左）对岩石纹理进行拍照并强调裂缝结构（右）（来自 http://www.philipk.net/tutorials/modular_rocks/modular_rocks.html） 生成的岩石材质反照率、法线和镜面贴图，作者：Philip Klevestav（来自 http://www.philipk.net/tutorials/modular_rocks/modular_rocks.html） 墙壁纹理 模块化思考 许多墙面纹理会设计成可以横向平铺，但不一定需要纵向平铺。纹理顶部和底部的边缘细节，可以强调墙面与天花板、地面相接的位置，同时模拟环境遮蔽，以及现实中灰尘和污垢在边角处堆积的效果。 如果想进一步增强分段感，可以让墙面纹理的中段保持相对简洁。遇到更矮或更高的墙体时，就可以基于这段可重复的中段，增加或删减分段。分段式 / 模块化的纹理用起来会更灵活。 对于低多边形美术风格来说，把细节和结构直接画进墙面纹理里会非常有用；这样就不需要手动建模，或者再把这些细节烘焙出来。 墙壁纹理示例分为三部分，中间部分可重复，作者：Ben Mathis（来自 http://www.poopinmymouth.com/tutorials/thirding-textures-tip.html） 面板 在制作由面板拼成的模块化建筑时，可以把所有面板分段整合到同一张纹理里。为每块面板单独绘制边缘细节，比如灰尘、污垢和阴影，可以强化每块面板的轮廓，让它们看起来更独特，也更不容易显得重复。面板布局本身应该能够适配不同尺寸和形状，这样在搭建时会更灵活。 这座中世纪房屋的所有不同面板共享同一个纹理，由《骑马与砍杀》的“gutekfiutek”设计 (http://wiki.polycount.com/wiki/ModularMountAndBlade) Trim Sheet（饰条纹理集） Trim Sheet（饰条纹理集）是把多组相关的子纹理集中到同一张贴图中，并设计成可以配合使用的一类纹理资源。 不过，Trim Sheet 并不是什么魔法工具。事实上，它反而会让纹理的使用方式变得更难。严格来说，很多东西都可以承担“饰条”的功能，关键在于你如何规划这些子纹理，并把它们应用到模型上。 使用 Lea Kronenberger 的 Trim Sheet（饰条纹理集）制作精致的地毯，来自 https://www.beyondextent.com/articles/balancing-modularity-and-uniqueness-in-environment-art 热点 UV 最近的一个新趋势 《半条命 Alyx》热点 UV (DreamUV) 如何制作纹理 游戏的纹理艺术显然是一个大话题，值得单独写一本书。我们无法真正教您如何成为一名纹理艺术家，这是一项人们需要花费数年时间学习和练习的技能。 在这里，我们只讨论为关卡创建纹理的一般工作流程。 有关免费纹理或推荐的游戏艺术书籍和网站的链接，请参阅 资源 . 手绘 摄影采购 烘焙雕塑 程序化纹理合成 如今，Substance Designer 已经是行业中最主流的环境纹理制作工具。美术可以把各种采样器和操作节点连接成一张节点图，用可视化编程的方式搭建纹理合成流程，从而一次性程序化生成多张纹理贴图和不同变体。如果你以前主要使用 Photoshop，可以把 Substance 理解成“加强版的 Photoshop 自动化动作（Actions）和滤镜”。 相比传统手绘纹理流程，这种工作流主要有两个优势：第一，你可以随时用更高分辨率重新采样纹理；第二，模块化的节点流程意味着这些节点图可以被反复复用。 举个例子：如果你在 Photoshop 里手绘了一张 512x512 的石墙纹理，那么之后想把它提升到更高分辨率，或者基于这面石墙做出相似的变体，都会很麻烦。但如果你是用一张 Substance 节点图来生成这面石墙，那么只需要把导出设置改成 2048x2048，或者输入不同的高度图，就能很快生成大量变体。 Graven 的 Substance 节点图和砖块生成器迭代（左），以及不同的高度图输入（右），作者：Ben \"Makkon\" Hale (https://3drealms.com/devblog/graven-dev-blog-4-making-procedural-pixel-textures/) 如何应用纹理 整理纹理调色板 三平面投影 纹理对齐 其实这件事没有那么复杂。 进一步阅读 Polycount Wiki：纹理类型 。以艺术家为中心的不同纹理贴图类型的入门读本。 饰条与 Trim Sheet（饰条纹理集） GDC 2015：《终极饰条：〈日落过载〉的纹理技术》 作者：Morten Olsen（Insomniac Games）讲述了一个相对较小的环境美术团队如何为大型开放世界游戏创造多种外观。这是理解 Trim Sheet（饰条纹理集）结构和纹理变体的优秀入门材料。不过放到今天，你可能会更倾向于直接建模做出倒角，而不是用法线贴图来表现倒角。 Trim Sheet 详细拆解 ，作者 Shubham Kumar，覆盖了完整流程。Kumar 会先收集材质参考，然后测量 Trim Sheet 的尺度规范 / 网格，再在 Substance 中合成材质，并把 Trim Sheet 应用到模型上。"
                  },
                  {
                      "href":  "process__layout.html",
                      "title":  "🛠️ 布局",
                      "description":  "如何绘制具有流程和类型的自上而下的楼层平面图",
                      "originalUrl":  "https://book.leveldesignbook.com/process/layout",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS"
                                      ],
                      "searchText":  "🛠️ 布局 如何绘制具有流程和类型的自上而下的楼层平面图 为什么要设计布局？ 布局 在关卡设计中有两个相似的含义： 关卡的整体结构 ; “布局太混乱了，我不知道该去哪里” 用于规划的概览图 ，有时称为“自上而下”，因为它是从自上而下的角度绘制的； “布局图画完了吗？我们要尽快打草稿” 布局图可以是简单的或复杂的、象征性的或代表性的、抽象的或具体的。它可以是餐巾纸上的涂鸦，也可以是详细的平面图，这一切都取决于！ “好的布局图”是任何能够有效传达核心设计的图像。 这些布局草图风格中哪一种对您最有效？你必须决定 但请记住： 计划并不神奇。 布局图无法告诉您关卡是否有效 ，只有一个 白盒 和 试玩测试 可以开始回答这个问题了。 布局不是关卡 ，玩家永远不会播放你的图画。 开发人员正在咨询 DMA Design 设计的侠盗猎车手 1 (1996) 的纸质世界地图布局，照片来自 Steve Hammond （通过推特） 布局概念 设计布局时，请利用以下设计概念： 动线 就是在关卡中移动的感觉。 玩家的移动是快还是慢、平滑还是突然？ 所需流量取决于 体验目标 。突然的流动并不是坏事。 主动线 是完成一个关卡的理想路径。 空间流线 这就是现实世界建筑师对流程的看法。 纵向/垂直空间 是关于支持纵向动线。 设计概念草图 是布局的核心结构/主要思想。 将整个布局结合在一起的整体概念是什么？ 清晰的部分可以帮助您专注于设计中最重要的部分。 类型学 是关于常见的布局模式和功能。 简化您对布局的思考方式 共享设计词汇可以帮助您学习其他关卡并进行交流。 如何设计布局 设计布局没有单一的最佳方法。每个人（和项目）都可以以不同的方式进行布局。但如果你感到迷失，请尝试做一切： 前期制作 ：定义设计目标 设计概念草图 ：发散核心形状与设计概念 气泡图 ：可视化区域之间的大小/流量 平面图 ：更详细地起草特定的房间形状 玩法标注 ：添加标签和设计说明 对于小型独奏即兴演奏项目，可以根据需要进行尽可能多（或尽可能少）的布局规划。 对于大型团队项目，请尝试在共享白板上一起执行所有这些步骤。 Francis Ching 的《建筑图形》中从抽象网格（左）到平面图（右）的迭代绘制 1. 前期制作计划 设计没有任何目的的东西是很困难的。在一个 前期设计 阶段，我们尝试定义和计划我们想要做什么 前 我们尝试去做。 所以在绘制布局之前，至少定义一个玩家 体验目标 . 在这个关卡中，玩家应该学习、感受或做什么？ 您可以写下具体的体验目标 （“教玩家如何在科幻下水道中二段跳 5 分钟”） 或者更抽象 （“感受与自然合一”）。 但更具体=更容易设计。 为顽皮狗策划的《最后生还者》（2012）击败委员会；选自伦敦维多利亚和阿尔伯特博物馆的“电子游戏” 一旦你有了一些目标，你就可以计划 节奏 , 有助于实现体验目标的特定事件和活动的顺序。 例如，如果您的体验目标是 “逃离可怕的怪物” 那么你需要将经验分解为更小的具体经验 节拍 ——像 “（1）听到门后婴儿的哭声，（2）发现僵尸熊发出婴儿哭声，（3）跳出窗户逃离怪物。” （这个简单的计划已经很有帮助，现在我们知道我们需要一扇门、一扇窗户、一只熊......） 有关规划体验目标的更多信息，请参阅 前期制作 . 有关规划活动和节拍的更多信息，请参阅 节奏 . 2. 设计概念草图 在建筑学中， parti（设计概念草图） 是整个建筑的基本形状/理念。 a.画一张 简单的小图 （ 设计概念缩略草图 ） b.用简短的短语标注它 什么类型的基本形状适合您的体验目标/节奏计划？ 该部分可以是象征性的（“颠倒的船”）或抽象的（“减去盒子”），也可以关注人们如何使用建筑物（“核心隔离公共和私人”）或与周围环境的关系（“手指戳进树林”）。 或者你也可以先凭感觉画出一些形状，稍后再整理。重点是在没有压力的情况下开始视觉思考。如果您不喜欢某个部分，没问题，您可以随意涂写另一部分。 Matthew Frederic 的《我在建筑学校学到的 101 件事》中的零件图 设计概念草图的建议 绘制至少 5-10 个设计概念草图 ，尝试生成多种方案。如果你画出 100 个方案，那么至少其中一个 会 不错，因为设计 100 栋全都糟糕的建筑也并不容易。你画得越多，找到好方向的可能性就越大。 不要在每一项上花费太长时间。 有时你只需要30秒，潦草写下几行字，就足以表达核心思想了。 如果你叫不出它的名字，那么它可能太原始了 。尝试以不同的方式再次绘制它，或者尝试将纸张旋转 180 度以从另一个角度想象它。 3. 气泡图 将最有潜力的方案扩展为 气泡图： 用一组不同的椭圆形表示不同的房间或空间。 a.为方案中的每个主要空间画一个 气泡 b.给每个气泡贴上标签 c.绘制箭头，强调特定连接关系或方向 气泡图的目标，是在你的关卡中建立 比例 和 关系 。什么需要很大？相互之间需要什么连接？ 暂时不用担心细节。这是关于你的空间的逻辑。 请看下面的气泡图示例。哪些空间与客厅相连？为什么？为什么浴室会在那里？卧室在哪里？如果有人不能使用楼梯，他们怎么住在这所房子里呢？ 芝加哥 F10 住宅的气泡图示例，摘自 Masengarb 等人的《建筑手册：了解建筑的学生指南》。 关于气泡图的建议 您的前几个气泡图将会出现问题并提出新问题。有些气泡可能太大或太小，或者可能接触到错误的气泡。也许您忘记添加一些气泡？或者可能是气泡太多。 糟糕的气泡图是好的。 这意味着你很早就发现了设计问题，你可以再画一张来尝试另一种安排。 绘制至少 3 个气泡图 想象多种排列和尺寸。 你可以偏离党派。 该部分的目的是帮助您开始绘制气泡。如果它不再对您有帮助，那就不要使用它。 4. 平面图 在建筑学中，自上而下的布局图称为 平面图 . a.想象一条 平面剖切面 ，也就是穿过建筑物的假想水平切片 b.绘制位于这个剖切面 下方 的结构形体，例如墙段、门口、窗户以及重要的家具或灯具 c.用虚线或点线绘制位于平面剖切面 上方 的相关对象 在下图中，请注意 Ching 如何使用各种线型、线宽、阴影和色调模式来区分平面图的各个部分。 Ching 使墙壁变厚和变暗，但使用较细的线条来标记楼梯或表示房屋的区域，并使用较淡的线条来表示旋转门的弧线。 Francis D.K. Ching 所著的《建筑制图》（第 6 版）中的各种平面图绘制技术 绘制平面图的建议 从大处开始 。使用整个页面。从大的主要形状开始，逐渐缩小到门窗等较小的特征。不要绘制 100% 的细节。 方方正正 。矩形比奇怪的角度或弯曲的墙壁更容易建造。大约 90% 以上的角应为 90 度并与网格对齐。 使用 2+ 线宽 。对于不同类型的墙壁使用不同的线宽。 笔更强大。 要快速布局，请使用钢笔或铅笔。 我们不是建筑师。 绘制想象玩家体验所需的最低限度。 5. 玩法标注 玩法标注 是对布局图中的重要部分进行说明和标记。 动线 . 对于单人游戏关卡，绘制或标记 主动线 。对于多人游戏地图，轻轻阴影或突出显示队伍重生区域和主要区域 循环 . 领域。 标记主要区域和地标。对于竞争性多人游戏地图，开始考虑可能的情况 “标注” . 游戏对象。 标记对于理解玩家体验至关重要的重要目标、NPC、物品、陷阱等。 但不要用太多东西使绘图变得混乱。 请注意 Eric Kirchmer 为《半条命 2》（ Steam ）中的“Nova Prospekt”绘制的等距布局图中有大量玩法标注，出自艺术书《半条命 2：提高标准》 请注意这张《传送门 2》（ Steam ）中谜题的等距布局图中的玩家动线箭头，来自 Game Informer，2010 年 3 月 实际的 Valve 白板，带有等距布局图 + 节奏轮廓，用于规划《半条命 2：第二集》……但是，请注意，该图与最终游戏略有不同；菲尔·科摄（ 通过 Interlopers.net ) 布局图示例 《半条命 2》的“Nova Prospekt”（Valve），作者：Eric Kirchmer 和 David Sawyer 在单人 FPS 游戏《半条命 2》(2004) 的大约 2/3 中，玩家必须穿过一个名为 Nova Prospekt 的破败监狱建筑群。这是一个很长的章节，充满了许多针对快速移动的小队敌人的多层近距离战斗，旨在大量使用玩家的“诱饵”武器，该武器可以命令飞行的“蚁狮”怪物攻击敌方士兵。 调研 ：深受加利福尼亚州旧金山恶魔岛州立监狱的启发 类型学 ：地面竞技场两侧是狭窄的过道和监狱牢房，经常有门禁 遭遇战 ：逐个街区、逐个房间设计，每个部分都提供了一个中心概念，为整个章节中的 Antlion 与 Combine 遭遇战空间增添了新的转折 恶魔岛地图（左）和 Nova Prospekt 细胞块气泡图（右）来自艺术书《半条命 2：提高标准》 请注意 Nova Prospekt 计划（上右）是一个相对简单的布局图，标记了区域以及玩家如何在这些区域中前进。它省略了每栋建筑内的单独房间和走廊。这是一组关卡（而不仅仅是一个关卡）的布局图像。它基本上是一个气泡图，重点关注每个区域的足迹及其连通性。 对于各个单元块和遭遇战，Valve 概念艺术家 Eric Kirchmer 将关卡设计和玩法标注直接融入到概念艺术草图中，这很可能是协作小组白板设计会议的结果。这些战斗遭遇战具有理想化的主动线“解决方案”的预期流程，将每场战斗视为需要解决的难题。这些草图为关卡设计师 David Sawyer 提供了宝贵的设计文档，以供其绘制草图和原型。 在所有等距布局图中，请注意大量的玩法标注：玩家开始位置、主动线箭头以及大量使用文本标签来帮助我们想象玩家体验。 Nova Prospekt 各种遭遇战的等距布局图，来自艺术书《半条命 2：提高标准》 《雷神之锤 1》的“无题”，作者：Andrew Yoder 对于他的单人《雷神之锤》（ Steam ）关卡，设计师安德鲁·约德（Andrew Yoder）迭代了一场涉及房间中央悬挂笼子的固定遭遇战。在这里，Yoder 在布局和布局之间流畅地切换 白盒 反复进行，有时会丢弃整个房间并用布局草图重新审视设计。这是 他的一些笔记 : 带有透视图的关卡布局草图（纸上墨水），由 Andrew Yoder 提供 “我的流程是关于迭代的，这有时意味着退回到规划阶段。[...]有时我会花一个小时迭代一个区域，它 突然就对了。 其他时候我也会花同样的时间，呃，也许最好把它放在一边尝试别的东西。 [...] 我怎么知道？从过去构建类似关卡的经验中可以得到一种直觉。还有很多启发式方法和模式需要检查。玩家知道目标吗？他们能预测解决方案并制定计划吗？” 注意编号，大量使用注释，标记草图的不同部分，以及偶尔使用透视小草图来阐明整体结构。当关卡布局涉及高度变化（很难从自上而下的角度绘制）时，透视小草图特别有用。 各种各样的草图和丰富的标记有助于约德传达他的设计意图。布局过程帮助 Yoder 用语言表达和阐明设计问题。 《雷神之锤》1 中悬浮笼区域白盒的屏幕截图，由 Andrew Yoder 提供 《看门狗 2》（育碧）的《机械纪元 - 电视台》，作者：Iuliu-Cosmin Oniscu 对于开放世界黑客游戏《看门狗 2》（ Steam ），设计师 Iuliu-Cosmin Oniscu 构建了一个具有多个目标、入口和主动线的任务。 在他的帖子中 “看门狗 2 — 自动机 — 关卡设计回顾” ，他包括带有大量玩法标注和最小架构的布局图： 《看门狗 2》《机械纪元》中 WKZ 站的布局，由设计师 Iuliu-Cosmin Oniscu 绘制 设计师的一些笔记和意图： 在这个特殊的场景中，技巧是玩家可以穿过激光并触发警报，但他也可以： 当警卫巡逻远离他们时禁用激光，然后进入红色区域并默默地打倒人工智能。 使用安装在墙上的相机从一个相机角度移动到另一个相机角度来侦察位置。在游戏的这一点上，这是一种已经成熟的侦察内部位置的方法。 使用无人机探索走廊并使守"
                  },
                  {
                      "href":  "process__layout__criticalpath.html",
                      "title":  "主动线",
                      "description":  "完成单人关卡所需经过的最小/主要玩家路径",
                      "originalUrl":  "https://book.leveldesignbook.com/process/layout/criticalpath",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🛠️ 布局"
                                      ],
                      "searchText":  "主动线 完成单人关卡所需经过的最小/主要玩家路径 这 主动线 （或 黄金之路 ）是玩家完成关卡和进度的主要路径/程序。 通常用于具有脚本化进程的单人关卡，而不是多人关卡 突出显示关卡中最重要（“关键”）的部分。 代表一个 理想的玩家动线 忽略可选的侧面区域 最后一点很重要。主动线代表您的 理想的 设计目标和需求，但它不是现实中玩家的真实行为。大多数玩家会徘徊、探索、徘徊，甚至只是感到困惑。 如何规划主动线 在布局图中，主动线标注能帮助其他设计师和协作者理解关卡的 节奏 。发生了什么以及在哪里发生？ 画一个首字母 布局 . 标出并标注玩家的起点和终点。 对任何专业进行标记、标签和编号 节拍 . 如果看起来不会太混乱，那就用箭头画出玩家的路线。 有关绘制平面图的更多信息，请参见 布局 . 示例关卡布局，其中标出了主动线并编号了玩法节拍 作为范围界定工具的主动线 在工程中，项目经理使用 主动线法（CPM） 找出哪些任务必须首先发生以及为什么。绘制主动线有助于他们理解项目的逻辑和流程。 我们也可以用类似方式将主动线用于关卡设计，帮助管理项目 范围 . 该关卡的每个部分有多重要？ 如果某个区域不在主动线上，就只有部分玩家会看到它。值得制作吗？ 可以在不影响主动线的情况下删除黄色阴影区域 主动线帮助我们想象“最小可行”布局是什么样的。 例如，在上面的布局图中，黄色斜线区域不在主动线上。那么它还值得制作吗？如果我们削减这个领域，那么我们要做的工作就会减少。 也许这个关卡仍然太大，制作量仍然太高。也许我们需要删除更多。 如果我们删除所有侧面区域会怎么样？ 它还能满足我们的体验设计目标吗？ 也许我们需要完全重新设计主动线…… 如果我们删除所有“不必要”的区域会怎样？现在构建工作量减少了，但它仍然能实现我们的体验目标吗？ 反对主动线？ 围绕主动线进行设计，可能会让我们以过于简化的方式思考空间。 主动线通过资源、大门和目标来工具化世界，这是关卡设计师强加给玩家的活动清单。游戏和关卡能否不仅仅是供用户消费的“内容”？如果您的项目需要高度的真实性、合理性或地方感怎么办？围绕主动线构建通常会产生“电子游戏”的感觉空间。 相反，有些设计师更倾向于在 之后 一个已经完成的 布局 和 白盒 ，围绕现有的关卡几何体流动。 任天堂64 的 《007黄金眼》 007 (1997) 制作人 Martin Hollis 解释了他们的关卡设计过程： “关卡创建者或建筑师在没有太多关卡设计的情况下进行工作，我的意思是，他们通常没有考虑到玩家的起点或出口。当然，他们没有考虑敌人的位置或物体的位置。他们的工作只是创造一个有趣的空间。关卡制作完成后，戴夫或有时邓肯将面临着在其中填充目标、敌人和东西。这种草率的计划外方法的好处是，游戏中的许多关卡都具有现实和非线性的感觉。有些房间坦率地说，关卡中有多种路线，这种设计方法效率很低，因为大部分关卡对于玩法来说是不必要的，但它有助于增强游戏的自由感，而这种自由感和真实感反过来又对游戏的成功做出了巨大贡献。” ——Martin Hollis，《黄金眼 007》（任天堂64）的制片人，引述于 “《黄金眼 007》中的反设计/向后游戏设计”作者：Chris DeLeon Chris DeLeon 拍摄的《黄金眼 007》(1997) 中“Surface”的关卡几何形状 https://imgur.com/a/MY59R 主动线示例：死亡循环 (2021) 在第一人称角色扮演游戏死亡循环 (2021) 的“复杂”关卡下图中，关卡设计师 Sylvain Menguy 强调了非线性单人游戏地图的主动线。他们记录了下午的配置和晚上的配置，以及玩家到达区域 Boss的可能路径。 游戏有4张主地图，可以在一天中的4个时间段（早上、中午、下午和晚上）进行游戏，玩家可以在其中自由探索关卡、进行战斗、发现谜题，甚至解决构成游戏主要冒险的“谋杀谜题”…… 这个近似的布局图省略了不必要的细节，有利于大局观，这对于沟通很有用 节奏 。请注意，下面显示的白色箭头与地图地形并不完全匹配，但仍然传达了有关预期路线的大量信息。尽管玩家一开始有 3 条通路，但这些通路始终会汇聚到地图另一侧 Boss 竞技场的两个入口。 《死亡循环》（2021）中地图“复杂”的布局流程图 作者：Sylvain Menguy，来自 SylvainMenguy.com 该地图从一开始就是为了允许多人游戏而制作的，另一个玩家会在下午或晚上入侵。因此，这两个时期对布局的解读有所不同，与前来追赶柯尔特并让他过得更艰难的对手朱莉安娜的遭遇战也有所不同。 这种时间段之间的共享布局总是给出了多种导航选择，禁止出现死胡同和长廊，让你的体验更加流畅，让你在区域之间快速轮换……” - 西尔万·孟盖 “旋转”是指玩家必须将焦点（“旋转”）转移到另一个地图区域，通常是在《反恐精英（ Steam ）：全球攻势》等基于团队的多人射击游戏中。有趣的是，Menguy 在单人关卡中采用了多人关卡设计思维。 有关多人游戏设计中旋转的更多信息，请参阅 地图平衡 . 要审查... 这 主动线 是通过单人关卡的理想玩家路线。 它主要是一个规划和范围界定工具。它有助于沟通 节奏 在一个 布局 绘图。如果您需要缩小项目范围，它可以帮助您决定要削减关卡的哪些部分。 然而，优先考虑主动线可能会导致更多人为的感觉空间。有些关卡设计师先设计一个空间，然后再找出主动线。 现在怎么办？ 阅读更多关于 布局 和 动线 . 空间流线 思考起来也很有帮助。"
                  },
                  {
                      "href":  "process__layout__flow.html",
                      "title":  "动线",
                      "description":  "通过关卡的感觉如何",
                      "originalUrl":  "https://book.leveldesignbook.com/process/layout/flow",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🛠️ 布局"
                                      ],
                      "searchText":  "动线 通过关卡的感觉如何 在关卡设计中， 动线 是沿着不同路径/在关卡的不同部分之间移动的通常感觉。 路径是简单还是复杂？直的还是弯的？慢还是快？所有这些因素都会影响玩家在空间中的移动。简而言之，设计动线就是 设计运动。 您应该在初始阶段开始规划动线 布局 计划，但你将无法验证它的实际感觉，直到你 白盒 和 试玩测试 . 不要将流程（关卡设计）与 流程（游戏设计） 该理论认为，当技能和挑战达到平衡时，玩家会进入高度投入的“心流状态”。 带有编号转弯的斯帕 (F1) 与代托纳 (NASCAR) 赛道地图，作者：Will Pittenger（根据 CC-BY-SA 许可） 如何感受流动 比较上图所示的两条现实世界赛道。 这 斯帕-弗朗科尔尚赛道 （上、左） 是一条具有多种转弯的一级方程式 (F1) 赛车场， 视线 ，以及需要完美技术驾驶的斜坡。相比之下， 代托纳赛道 （上、右） 是一条 NASCAR 赛道，是一个平坦宽阔的椭圆形，可容纳大量汽车相互推挤。 这两个“关卡”都服务于相同的赛车核心机制，但强调截然不同的驾驶风格和策略。 斯帕著名的“Eau Rouge（欧鲁日弯）（欧鲁日弯）（欧鲁日弯）”在 1965 年比利时大奖赛上亮相；照片版权 LAT Photographic 下面一位职业赛车手描述了斯帕著名弯道 Eau Rouge（欧鲁日弯）（欧鲁日弯）（欧鲁日弯） 的流程： “......当你越过山顶时，你不知道你会在哪里着陆。[...]之后你会有一段很长的上坡路，如果你犯了错误，你可能会损失很多时间。但这也是一个对车手感觉很重要的弯道。每一圈都会给人留下特别的印象，因为当你通过弯道底部时，你的身体也会受到压缩。这很奇怪——但也很有趣。” ——F1 冠军费尔南多·阿隆索描述 Eau Rouge（欧鲁日弯）（欧鲁日弯）（欧鲁日弯）（ 通过 Formula1.com ) 这样，关卡设计就有点像赛车了。我们要求玩家做出什么类型的动作？感觉安全还是危险，简单还是复杂？ 在 Dave Johnston 的多人游戏地图 de_dust2 上，标志性的Dust2 中门（Dust doors） （下） 将玩家引入狭窄危险的之字形转弯。对方的对手甚至可以射穿薄薄的中门。就像 Eau Rouge（欧鲁日弯）（欧鲁日弯）（欧鲁日弯） 一样，你永远无法 100% 知道另一边是什么。这比一条笔直、清晰的开放道路更令人兴奋。 反恐精英 1.6（ Steam ） 中 de_dust2 地图上一些著名的Dust2 中门（Dust doors）；戴夫·约翰斯顿绘制的地图 最好的动线？ Dust2 中门可以被认为是“糟糕动线：门打断了移动路线，迫使人们突然急转弯。但在这里，所谓的糟糕动线实际上是好的，它在《反恐精英》的快节奏战斗背景下增加了戏剧性和策略性。 有时快是好的，有时慢且复杂更好。这一切都取决于游戏系统和关卡的目的。 快节奏的街机风格游戏可能更喜欢流畅的动线、宽阔的转弯和最少的干扰。与此同时，恐怖步行模拟器可能会更好地处理急转弯、盲路交叉口、S 形弯道和迷宫般的死胡同。 最后， 最好的动线是支持预期目标的任何流程 体验设计目标 . 这个关卡/区域/遭遇战/经验是关于什么的？快速刺激的动作、冷静的观察和导航？第一次看到大城市？一场可怕的追逐？聚会场所？ 对于竞技性多人游戏地图，动线会严重影响整体效果 地图平衡 . 要验证动线按预期工作，您必须 白盒 和 试玩测试 . 纵向/垂直空间 纵向/垂直空间 是纵向动线，向上和向下移动的感觉。 在地图中，这通常意味着楼梯、坡道、斜坡、电梯、梯子、悬崖、高架平台、跳台等。 这里的传统观点是纵向空间越丰富越好，因为它为地图结构增加了更多的视觉兴趣并打破了地板平面。但今天，我们不建议过多随意垂直，而是敦促克制。纵向空间是否合适很大程度上取决于游戏的核心设计；许多游戏机制需要的空间只是大而平坦的地板，有时这是可以的。您不需要到处放置随机的步骤和平台。 有关纵向动线的更多信息，请参见 纵向/垂直空间 . Brandon James 为 《雷神之锤 3：竞技场》（ Steam ） (1999) 制作的 Q3DM17“The Longest Yard”中的跳台和传送器轨迹图 如何设计动线 动线本质上是在 设计运动。 许多因素会影响运动的感觉： 速度。 沿着一条路径移动时感觉慢还是快？ 方向。 路径是否平滑/连续，还是脱节/突然且有急转弯？ 寻路与引导 . 路径是否明显？哪些信息可以帮助玩家规划路线？ 尺度规范 . 玩家的移动机制是什么？距离如何调整？ 为了同时考虑这些因素，我们提供了三种设计动线的设计技巧： 玩家直觉动线： 比较单个房间/区域的理想路径 主动线： 可视化单人游戏 节奏 贯穿整个关卡 空间流线： 可视化整个地图上的多人游戏路线 玩家直觉动线 在城市规划中， 玩家直觉动线 （或 玩家直觉路径 ）是用户制作的路径，以人流和侵蚀为标志。 在下面的照片中，“非官方”土路偏离了“官方”混凝土路径。非官方的道路是玩家直觉路径。这是玩家真正想要的/也是他们感觉最自然和直观的。 渴望偏离人行道/穿过草坪的路径，摄影：Duncan Rawlinson 有时是现实生活中的建筑师 将玩家直觉路径铺平成官方道路 。在关卡设计中，我们通过观察做出类似的反应 试玩测试 并进行相应调整。 这种类型的思维对于设计单个房间/区域内的小规模流程很有用： 想象一下从玩家到目的地的高效“玩家直觉动线”。 将玩家直觉上想走的动线与玩家实际可走的路径进行比较。 在下面的示例图中，玩家必须爬楼梯才能到达出口...... 比较不同流量的之字形楼梯（左）与转角楼梯（右）的图表；安德鲁·约德 (Andrew Yoder) 的水平几何 玩家直觉上想走的动线 （黄色） 直通二楼出口，但实际动线 （红色） 迫使玩家走上楼梯。 之字形楼梯 （左） 感觉不如单转角楼梯那么直截了当 （右） ，因为之字形转弯需要玩家多转一圈。 虽然之字形的效率较低，但请记住 动线效率较低并不一定是坏事。 折返可能有用： 放慢玩家速度，首先鼓励房间探索 提供跑酷式的捷径，直接爬上中间平台 将一个远程敌人放置在中间平台上；玩家攻击它有多容易？ 主动线 这 主动线 （或“黄金动线”）是完成单人关卡的最小/主要路径。 更一般地说，它代表一个 理想化的玩家动线 突出显示关卡中最重要（“关键”）的部分以及您希望每个玩家体验的强制性游戏内容。 单人游戏 布局 绘图通常需要某种标记的主动线。在绘图中绘制、突出显示或标记主动线 - 或者如果绘图太复杂，至少标记玩家的开始、退出和标记的兴趣点。 有关设计单人关卡主要路线的更多信息，请参阅 主动线 . 示例关卡布局图，带有标记的主动线和编号的游戏节拍 空间流线 空间流线 （或“连通性”） 指区域如何相互连接。 空间流线设计有助于支持关卡的故事讲述和寻路。具有合理的空间流线的关卡可能类似于现实世界建筑的运作方式，从而允许玩家根据游戏外部的常识来阅读和预测模式。 空间流线分析对于多人游戏地图设计特别有帮助，因为多人游戏地图设计通常更加非线性并且不遵循单一主动线。相反，我们将关卡布局组织成一个系统 通路。 有关讲故事、寻路和多人游戏路线的更多信息，请参阅 空间流线 . 二十七建筑工作室为成就预备学院中学设计的动线图 要审查... 动线 是关于玩家如何在关卡中移动的。 纵向/垂直空间 是纵向动线。 当 设计运动 ，思考速度、方向， 寻路 ， 和 标准尺度规范 。是的，很多。 思考动线的三种方法： 玩家直觉动线： 比较房间/区域内的理想路径与实际路径 主动线 : 完成单人关卡的理想玩家路径 空间流线 : 关卡的连接区域/“通路” 动线是一种工具。 低效的“坏”动线并不一定是坏的，因为它可以在正确的环境中发挥作用。同样，过于高效的“良好”流程也会让人感到无聊。这完全取决于您的设计目标。 进一步阅读 马修·“卢纳兰”·布赖特 写了一些 最早的动线关卡设计理论 ，以及 关于连通性的帖子 时间回到 1999 年。今天， 布莱特对自己过于规范的语气感到遗憾 （“……错误地断言死胡同、强制间接路线或其他拖慢玩家速度的事情本质上是非法的……”） 这是他对雷神之锤狂热的产物，但无论如何我们仍然爱他。"
                  },
                  {
                      "href":  "process__layout__flow__circulation.html",
                      "title":  "空间流线",
                      "description":  "区域如何链接到其他区域，即地图的“连通性”",
                      "originalUrl":  "https://book.leveldesignbook.com/process/layout/flow/circulation",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🛠️ 布局",
                                          "动线"
                                      ],
                      "searchText":  "空间流线 区域如何链接到其他区域，即地图的“连通性” 在建筑学中， 循环 通常指连接其他区域的“中间”区域，例如走廊、过道和楼梯。 一些关卡设计师称之为 连通性 。但对于这本书，我们认为 循环 是一个更好的词和概念，更多的关卡设计师应该采用。 流通类型 现实世界的建筑师区分几种类型的流通： 小学 与 中学 循环 （通往主电梯的路径与通往储藏室的路径） 公共 与 私人的 循环 （一楼大堂与卧室走廊） 卧式 与 垂直 循环 （走廊与楼梯） 其中许多问题通常并不直接适用于关卡设计。与现实世界中不幸的建筑师不同，我们可以设计虚拟建筑，而无需考虑建筑规范、条例或热力学。然而，这些词语和概念仍然有用。 二十七建筑工作室为成就预备学院中学设计的动线图 在关卡设计中，至少还有两种不同类型的动线： 饮食循环： 流通的外观和感觉，空间的游戏虚构。 与相交 环境美术 和 叙事 对于单人游戏关卡至关重要，尤其是在写实风格中 正式流通： 尽管游戏中有任何虚构内容，但循环的系统功能。 更多关于 战斗设计 , 掩体 模式，以及 地图平衡 对于多人游戏地图很重要，尤其是竞技战斗 消化循环 消化循环 指游戏中虚构角色如何使用该空间。 在电影研究中， 饮食 是屏幕上描绘的虚构世界。问问你自己， 玩家将如何在关卡中角色扮演他们的动作？这个空间的主题是什么？这种动线模式背后有何故事？ 对于单人游戏关卡来说，输送循环至关重要 叙述性的 。如果你希望你的关卡感觉像一个可信的现实世界空间，那么你还必须像一个可信的现实世界建筑师一样思考，并拥有可信的现实世界循环。 在设计探索游戏《Gone Home》（ Steam ）（2013）时，Fullbright Company 选择使用古老的豪宅主题，因为现代郊区的房屋围绕一个具有平坦密集连接的中央房间运行，但豪宅深深地分支成不同的翼楼。这种豪宅比喻支持中心辐射式 类型学 他们想要的，这有助于他们讲述他们想要的故事。 Gone Home (2013) 带有主动线覆盖的布局（绿色）；摘自 Steve Gaynor 和 Kate Craig 的“The Level Design of Gone Home”，GDC 2015 《Gone Home》主动线的前半部分从“前廊”（底部中心）开始，到地下室（左上）结束，同时经常自行回溯，从而产生一种自由形式的探索感觉，支持《Gone Home》调查空宅的体验目标。 如果每条线索都指向一个新区域，那么感觉就不像一次调查（也不像一座豪宅）。相反，我们学会居住在这个空间中并变得更加熟悉它。这样，建筑研究对于注重故事的关卡至关重要，否则叙事循环可能无法支持所需的主动线。 饮食循环作为寻路 玩家根据当前目标遵循循环。如果他们必须找到出口，那么玩家将遵循主要循环。如果他们需要到达屋顶，玩家会寻找垂直循环。如果玩家需要潜行或探索资源，他们会使用二次循环。 一般来说，更宽更大的通道 感觉 就像一级公共流通，而较窄的区域感觉更像二级流通。但想象一下，在一个关卡中行走，看到一扇又大又宽的门和一扇更小、更窄的门。哪扇门通向出口？大门可能通向主要流通和出口。但如果较大的门看起来像车辆的车库门，那么它可能被锁了，我们应该选择较小的门……所以现在较小的门更有可能感觉像是主要流通…… 有关玩家导航的更多信息，请参阅 寻路与引导 . 正式流通 正式流通 重点关注布局的物理功能（“形式”）和运动的可供性。 这里我们忽略了主题、背景和文化。从抽象层次几何形状的角度思考层次。问问你自己， 职业玩家或速通玩家如何理解这张地图？ 通路 通路 是多人游戏地图中的正式主要流通。 通路帮助玩家预测和协调运动。通路太多或通路层次不清晰的大地图会像迷宫一样；玩家们会不知道该把精力集中在哪里，迷失方向，错过彼此。 因此，大多数地图仅使用 1-3 条通路。 一通路 《军团要塞 2》（ Steam ）和《守望先锋》（ 官网 ）等基于团队的多人游戏的有效载荷地图将玩法和冲突集中在一条蜿蜒环绕整个地图的单条通路上。进攻方必须站在有效载荷车附近“推动”有效载荷车向前，而防守方必须白盒有效载荷车到达通路末端。有效载荷路线有显着标记，以便玩家可以轻松协调工作（或准备伏击）。有时，还会有额外的半通路和后巷来帮助进攻者突破防守。 《军团要塞 2》有效载荷地图“Badwater Basin”中的单通路类型 三通路 通路在有关领土控制的竞争性多人游戏中也很常见，例如《英雄联盟》等 MOBA 游戏或《使命召唤》和《反恐精英（ Steam ）》等军事射击游戏。这些游戏的地图经常使用 三通路 格式，三个双向主动线，偶尔通过较小的通路分支和交叉。 （在 MOBA 中，较小的间隙通路/二级循环的纠缠统称为 丛林。） Summoner\u0027s Rift（英雄联盟）和 de_dust2（反恐精英：全球攻势）中的三路类型 如果对手在一条通路上阻挡了前进，那么其他玩家可以尝试通过在另一条通路上前进来包围他们。或者，如果玩家想完全避免冲突，那么他们可以避开主线并尝试在丛林中耕种。 通路不对称很重要，每条通路应该感觉不同。在《英雄联盟》召唤师峡谷中，上下路比中路长，上路有强力的boss，下路有较弱的中boss。在de_dust2 (CS:GO)中，队伍必须决定是集中在A点还是B点，以及如何接近或侧翼；或者如果队伍选择不当，他们可能需要穿过中路移动到地图的另一边。 旋转 旋转 （主要在《反恐精英》中）是指玩家必须从一条通路移动到另一条通路的情况。它通常需要团队合作和协调，而轮换与不轮换之间的紧张关系是团队竞技多人游戏的核心要素。"
                  },
                  {
                      "href":  "process__layout__flow__verticality.html",
                      "title":  "纵向/垂直空间",
                      "description":  "纵向动线，在水平面上向上和向下移动的感觉",
                      "originalUrl":  "https://book.leveldesignbook.com/process/layout/flow/verticality",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🛠️ 布局",
                                          "动线"
                                      ],
                      "searchText":  "纵向/垂直空间 纵向动线，在水平面上向上和向下移动的感觉 纵向/垂直空间 是纵向动线，向上和向下移动的感觉。 想象一下稳步爬上悬崖或深入到黑暗的地牢。这些高度变化体现了玩家的进步，并帮助玩家朝着他们的目标前进。任务可能会告诉玩家向北旅行，但如果他们无法分辨北方在哪里，那么这个目标就不可能实现。相反，如果任务要求玩家爬到山顶，或者下降到谷底，那么上下就更加明显和明确无误。 纵向/垂直空间力学 在讨论纵向/垂直空间时，我们假设我们正在为具有两个常见物理约束的典型 3D 动作游戏进行设计： 重力将玩家向下拉 玩家视角很少“滚动”，天空和地平线始终是直立的 如果改变其中任何一个假设，那么“向上”就不再是向上，因此玩家的垂直感就会不同。例如，《超级马里奥银河》中的纵向/垂直空间与《黑暗之魂》（ Steam ）中的纵向/垂直空间有很大不同。 （TODO：《超级马里奥银河》与其他游戏的图像纵向/垂直空间比较） 纵向/垂直空间太高？ 许多竞技性多人射击游戏和基于竞技场的游戏需要仔细限制纵向/垂直空间的使用。 （TODO：溜冰场推文） 例如，在《反恐精英（ Steam ）》中，竞技玩家将鼠标灵敏度调得很低，因为精度比反应更重要。随后，不断的高度变化会阻碍他们的瞄准，因此大多数 CS 关卡都相对平坦。 也就是说，CS 具有堆叠/提升机制，队友可以跳到彼此之上以越过障碍物或到达其他无法到达的地方，从而奖励团队计划和协调。纵向动线可以是情境性的，也可以是战略性的。 反恐精英 1.5 中玩家相互堆叠和提升的荒谬示例，摘自 GDC 2015：Competitive CS:GO 的社区关卡设计 楼层平面 当规划关卡的纵向/垂直空间时，尝试将其组合成 楼层平面 并将较小的高度变化合并到一个楼层中。不要试图在脑海中记住 10 个不同的、不同的、重叠的平面图，因为玩家可能也无法处理那么复杂的情况。 对于任何给定区域，大多数地图往往会在三个不同的楼层平面上达到最大值。为什么是三个？就像三通路类型一样， 三平面格式由底层、中层和顶层组成。相比之下，第四条（p）通路不会添加新的动态，因为它只会添加另一个中间层或路径。 一些较老的关卡设计师将这些称为“Z 轴层级”，因为在 3DS Max、《毁灭战士》（ Steam ）、《雷神之锤》（ Steam ） 和 Unreal 中，Z 轴向上。但如今，许多引擎和工具都使用 Y 轴向上，更不用说图形程序员使用 Z 轴来表示相机深度，所以......我们不要这样做。 （展示楼层平面的图像） 向下流动 在重力作用下，下降比爬上来容易。向下的流动比向上的流动重。 关卡设计中向下流动最常见的用途是单向下落点。当玩家从壁架上掉下来时，他们无法后退，只能继续前进。 解谜探索游戏使用这种技术来限制玩家一次必须考虑的空间，这是一种表达“这次掉落之前的所有内容与下一个挑战无关”的方式。射手严重依赖这种模式来迫使玩家进入战斗 遭遇战 ，否则玩家可以简单地原路返回，将敌人拉过阻塞点。 （单向下落点示意图） 向上流动 为了对抗重力并创造更多的向上流动，你必须努力创造更多向上的机会。楼梯、坡道和梯子都是促进垂直的常用工具，但需要您预留足够的空间来容纳它们。 （电梯不太常见，因为 脚本编写 复杂性，尤其是多层电梯。） 《雷神之锤》 3 Arena》（1999 年）多人太空漂浮地图 Q3DM17“最长的码”著名地使用了十几个跳板和传送器来创造强大的向上流动。由于掩体很少且占地面积有限，玩家必须在空中飞行来躲避枪火，同时要小心不要摔死。设计师布兰登·詹姆斯 平衡的 与右下图所示的远平台的纵向/垂直空间；在这里，狙击手可以轻松躲避来袭的火箭弹，同时狙击所有采取可预测飞行弧线的玩家。 Brandon James 为 《雷神之锤》 3 Arena (1999) 制作的 Q3DM17“The Longest Yard”中的跳板和传送器轨迹图 主机射击游戏中的纵向/垂直空间 游戏机上的射击游戏面临着与输入相关的独特关卡设计挑战。由于游戏机玩家使用带有模拟摇杆的游戏手柄，因此模拟摇杆的固定转动速率使得快速转动和跟踪目标变得更加困难。相比之下，鼠标提供更高的加速度和精度。但我们并不是要就哪种输入更好的问题与玩家争论——我们只是想说，如果您预计您的关卡将有使用游戏手柄的受众，那么您必须进行相应的设计。 对于单人游戏关卡，这意味着在玩家身后刷怪（backspawning）会感觉更加不公平，因为玩家无法快速旋转 180 度，而且飞行的敌人 AI 必须保持适度的距离并保持稳定的高度。 对于像《光环》（ Steam ）或《使命召唤》这样的多人游戏机射击游戏，玩家通常将相机的垂直旋转瞄准大致头部/胸部的高度，并将瞄准运动限制在水平轴上。这些游戏的关卡很少包含非常高的高度变化（如果有的话），因为迫使玩家看起来很高或很低非常费力且不利。 这种类型的射击游戏手柄输入只有在关卡设计支持的情况下才会感觉良好：许多带有浅坡度的开阔景观，以及保持相对平坦的离散楼层平面。下面的左侧示例具有高频高度变化，这会让游戏手柄用户感到沮丧，而右侧示例则使用更平滑的斜坡和更平坦的楼层平面。 （待办事项：图像）"
                  },
                  {
                      "href":  "process__layout__parti.html",
                      "title":  "设计概念草图",
                      "description":  "布局的核心思想/概念",
                      "originalUrl":  "https://book.leveldesignbook.com/process/layout/设计概念草图",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🛠️ 布局"
                                      ],
                      "searchText":  "设计概念草图 布局的核心思想/概念 在建筑学中， parti（设计概念草图） 是一个项目的中心思想/概念。您能用一句话将建筑物简化为最重要的结构方面吗？ 同样，关卡设计也很适合先定义一个核心概念，用它来锚定后续设计。如果你能用清晰的设计概念陈述或草图来展示你的关卡，合作者，甚至玩家，都会更容易理解你的设计意图。 建筑学中的 parti（设计概念草图） 由 弗兰克·劳埃德·赖特（弗兰克·劳埃德·赖特（弗兰克·劳埃德·赖特（Frank Lloyd Wright））） 设计的 普莱斯大厦（普莱斯大厦（普莱斯大厦（Price Tower））） 平面图、剖面图和照片（图片来自 https://es.wikiarquitectura.com/edificio/torre-price/） 普莱斯大厦（普莱斯大厦（普莱斯大厦（Price Tower））），：“逃离拥挤森林的树” parti：中央“主干”核心（电梯），为每个楼层“分支” 平面图：一个正方形，中间有一个十字"
                  },
                  {
                      "href":  "process__layout__typology.html",
                      "title":  "类型学",
                      "description":  "关卡设计的对布局进行抽象模式，并附有具体示例",
                      "originalUrl":  "https://book.leveldesignbook.com/process/layout/typology",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🛠️ 布局"
                                      ],
                      "searchText":  "类型学 关卡设计的对布局进行抽象模式，并附有具体示例 什么是类型学？ 一个 类型学 是一种布局设计模式，一种帮助我们思考布局的类系统。它 摘要 布局——它简化并概括了结构。 为什么说“类型学”而不是“类型”？ 这不仅仅是学者自命不凡。添加“-ology”部分提醒我们，它是一个很大的研究领域，是一个与其他思想相关的思想体系。 “类型”太笼统了。 建筑图“密集住宅建筑的形式类型”， 作者：Maja Baldea（来自密度建筑博客） 在上面的现实世界建筑图中，Maja Baldea 思考了组织公寓楼的不同方式。她 摘要 （简化、概括）这些建筑物是无窗的街区，因为她对小细节不感兴趣，她考虑的是整体形状， 体块 ， 和 构图 , 至 分类不同类型 的住宅楼。 类型学可用于： 对不同类型的关卡设计进行分类 关于地图的推理 平衡 和 遭遇战 设计 开放世界/大逃杀类型的项目，因为不同的类型通常会导致不同的游戏内容 共享设计语言，有助于协作和团队合作 元素 除了墙壁、地板和天花板之外，还有一些常见的 游戏元素 常见于大多数关卡： 掩体 。半掩体与全掩体，硬掩体与软掩体。 门与关口 。硬门与软门、锁和钥匙、前向门控与后向门控。 房间类型 房间类型 是关卡单个区域/“块”的通用模式。 我们使用“房间”作为“空间”的通用术语。房间可以是花园、洞穴等。这可以追溯到 90 年代的游戏引擎，当时室外空间是带有天空天花板的房间。 走廊 直线穿过空间，就像走廊、河流或峡谷。任何通过可预测的空间序列具有单向轨迹的物体都可以被视为走廊。 高度的作者身份、控制力和确定性。您知道玩家必须去哪里以及可能需要多长时间。 为了加快速度，请添加向下的斜坡、单向下降和明亮的照明 要减慢速度，请添加侧面区域、壁龛和斑点照明 走廊示例：P.T 的房屋 第一人称恐怖游戏 P.T. （2014）让玩家一遍又一遍地走在同一个走廊上，循环机制会在玩家打开最后的门时将其传送回起点。这是对走廊的有力利用，如果采用更开放的布局，则会受到影响。 P.T. 的平面图和主动线(2014) 小岛制作所；要完成游戏，玩家必须解决隐藏的谜题并循环穿过同一组走廊至少 12 次 请注意对视线的强烈控制，迫使玩家凝视角落的窗户，或者绕道进入浴室注意镜子和水槽。恐怖母题和不祥的壁龛会阻止玩家移动得太快，而线性和熟悉感最终会带来一种不祥、恐​​惧和厄运的感觉。我们能做的就是越陷越深，无处可逃。 之字形/发夹形 一条死胡同走廊，当你原路返回时，有一个可见的出口。 与走廊类似，提供大量控制和作者身份 遮挡出口会鼓励玩家首先探索死胡同 短暂的困惑，轻微的探索感和导航感 之字形示例：《亲爱的以斯帖》中的洞穴 围绕罗西/战斗碗 小型开放区域 掩体 在中间，通常像柱子或圆柱一样完全覆盖，导致旋转/旋转流。在快节奏的战斗游戏中尤其常见，玩家可以围绕中央掩体“跳舞”/绕圈扫射，同时阻挡敌人的攻击。 添加单向下降以强制特定的流动，和/或引入一些纵向/垂直空间 竞技场/兴趣点 (POI) 安 竞技场 是一个有几条通路的开放区域 循环 还有一些 掩体 在中间。 开放世界和大逃杀设计师使用 兴趣点 (POI) ，由具有多个入口和出口的大型地标锚定的大型竞技场 在单人游戏中，竞技场通常需要 门控 ;阻止玩家提前离开竞技场，同时也关闭入口以防止玩家将所有敌人拉入阻塞点 示例：《毁灭战士 2》中的极其简单 （TODO：绘制简单的平面图和主动线） 关卡类型 关卡类型 是多个房间/整个楼层的通用布局模式。 轮辐式 较大的多区域图案，具有中心区域（中心）和从其延伸的几个较小区域/通道（辐条）。要探索不同的辐条，玩家必须返回中心。 为不同的辐条提供统一的标识，向结构传达逻辑 每次访问都需要大量工作来更新中心，否则感觉就像是在原路返回 可以是一个有用的节奏工具，返回中心感觉像是一种放松的奖励 门控集线器一开始就挡住了大多数辐条，玩家逐渐解锁快捷方式 示例：《生化奇兵 1》中的医疗馆 《生化奇兵 1》具有多个轴辐式结构。最初的医馆第一章 环回 （待办事项：图表） 一种自我循环的线性进程，在开放世界地下城中最常见。 类似于走廊：大量的控制和确定性，减少玩家的犹豫不决 帮助一个区域在结构上感觉非线性且合理，即使进展最初是线性的 微妙的环回感觉就像关闭自然不可避免的循环 过于方便的环回会让人感觉像是为了恳求玩家的感激而做作的捷径，因此感觉不自然或难以置信 示例：《上古卷轴5：天际》中的（某些地下城） （示例：天际布局和屏幕截图） 开放世界奇幻角色扮演游戏《上古卷轴5：天际》拥有许多地下城，玩家在完成地下城后必须返回主世界。然而，在一个区域被清除后，回溯通常会让人感到单调或死记硬背……（TODO：完成） 分支阻塞点/珍珠串 直通 时间洞穴 多人游戏类型 多人游戏布局往往更加非线性、迂回和双向，强调可重用区域的高重玩价值。许多基于团队的游戏都设有基地/重生室，玩家可以安全地加入游戏，以及团队进攻和防守的占领点。 基地/产卵室 无人之地 狙击手巢穴/狙击手巷 图8 最常见于经典CTF地图、血峡谷等 连接器/枢轴 在具有基地和通往占领点的路线的多人团队游戏中 示例：反恐精英（ Steam ）：全球攻势 三通路 例如：英雄联盟、DOTA、使命召唤：现代战争...在 CS:GO 中也很常见（每个炸弹点 1 条通路，中间连接器通路） 反对类型学？ 一旦你对某些东西进行了分类，你就有可能陷入这些分类的限制之中。有时，忽略类型和拒绝分类可能会更有帮助。 要审查... 一个 类型学 是一种对不同类别的关卡布局进行分类的方法。这些单词和标签帮助我们讨论和思考布局。 房间类型 是用于设计单个区域的模式，例如走廊、之字形、玫瑰花环/战斗碗和竞技场/兴趣点。 关卡类型 是按顺序排列多个房间的模式，如环回、直通、分支和瓶颈、轴辐式和时间洞穴。 进一步阅读/来源 《一种模式语言》 (1977) 由建筑师克里斯托弗·亚历山大等人设计。是当今现代建筑和城市规划的经典类型学手册，开创了新城市主义运动。 《论‘三种类型’》 (2017) 建筑师卢克·琼斯 (Luke Jones) 是一篇精彩的文章，讲述了建筑师仍然不太确定如何对建筑进行分类。"
                  },
                  {
                      "href":  "process__layout__typology__gates.html",
                      "title":  "门与关口",
                      "description":  "在关卡设计中， 门 是什么阻碍了玩家 动线 ，通常沿着 主动线 .",
                      "originalUrl":  "https://book.leveldesignbook.com/process/layout/typology/gates",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🛠️ 布局",
                                          "类型学"
                                      ],
                      "searchText":  "门与关口 在关卡设计中， 门 是什么阻碍了玩家 动线 ，通常沿着 主动线 . 这里的“关口”是一个抽象概念，它不一定是字面上的门或门。它可能是一个魔法屏障，一个 NPC 挡住门口直到你完成他们的任务，或者是落在玩家身后的雪崩。任何阻挡玩家移动的设计，都可以起到关口的作用。 “门控”也可以作为动词使用： “我们必须将玩家限制在竞技场内，直到他们完成 Boss 战……” 闸门类型 严格性 硬关口： 玩家必须始终不走捷径地完成战斗 （例如，等到计时器结束，击败所有敌人，从被击败的Boss那里抢走一把钥匙） 软关口： 可以提前退出，但通常必须完成遭遇战 （例如，退出机制需要处于弱势位置，因此大多数玩家首先清理竞技场） 隐藏出口： 玩家必须探索竞技场才能找到出口 （例如，隐藏在角落里的出口，大多数玩家在清理竞技场后才会注意到） 方向 前向门控： 玩家的前进进度被白盒。 后向门控、单向入口 ：玩家无法后退。 锁钥关口 一个 锁钥关口 是一扇硬关口，阻止玩家通过，直到他们在关卡中的其他地方找到“钥匙”。这个键是抽象的——它可以是玩家拿起的一个字面上的键项目，也可以是一个按钮。 实施锁钥关口控的一些最佳实践： 在钥匙之前先显示锁。 当玩家最终找到钥匙时，他们可能会记得之前遇到的锁着的门。如果你反其道而行之，玩家就会感觉不太像是解决了问题，而更像是他们不小心用钥匙绊到了锁。 当玩家拿到钥匙时提醒他们有关锁的信息。 也许钥匙位于俯瞰锁的阳台上，或者按钮与面向锁的窗户对齐。不切实际的项目可以编写一个简短的过场动画来显示解锁内容。 如果锁需要多把钥匙，锁的视觉设计应暗示钥匙的数量。 例如，需要三把钥匙的锁着的门应该有三个钥匙孔。 快捷方式 一个 捷径 是一扇硬关口，玩家可以从另一侧解锁，从而可以更轻松地回溯和/或在区域之间更好地流动。探索游戏通常具有单向门、可攀爬的可下降梯子或可打开的电梯。"
                  },
                  {
                      "href":  "process__lighting.html",
                      "title":  "☀️ 灯光",
                      "description":  "如何使用功能性照明策略照亮游戏关卡",
                      "originalUrl":  "https://book.leveldesignbook.com/process/lighting",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS"
                                      ],
                      "searchText":  "☀️ 灯光 如何使用功能性照明策略照亮游戏关卡 灯光设计 是在游戏世界中放置灯光来创造视觉深度、唤起情绪并提供信息来帮助玩家玩游戏。光线不足的空间常常让人感觉陈旧、单调、未完工或混乱。 由于照明对于可读性非常重要，因此我们建议在建立核心玩法期间或之后不久进行灯光迭代 白盒 或 脚本编写 阶段。 业界通常将照明归类为 环境美术 ，但在这里我们将较少关注图形，而更多关注 设计 和 功能 照明。 灯说什么、做什么？ 照明书房遮挡 哈雷·威尔逊 (Harley Wilson) 创作（来自 Artstation） 在哈雷·威尔逊的上述研究中， 灯光告诉我们很多关于游戏世界的信息并帮助我们玩游戏： 世界构建 。沿着墙壁的嵌入式筒灯让人想起一个别致的现代画廊。 体块 。较冷的灰色照亮了画廊的墙壁，较温暖的灯光照亮了克制关系，昏暗的筒灯标志着阴暗的角落。灯光将这个区域分为三个子区域。 空间流线 。远处的墙很黑，也许通向后门或壁橱。它可能不是主要出口，它的照明会更明显。 什么是视频游戏照明？ 在现实生活中， 光 是与表面相互作用的可见能量。这是一个优雅的系统；利用能量和光子的核心物理原理，您可以导出所有其他复杂的光效。 相比之下， 视频游戏灯光并不优雅。 这是一个假得一塌糊涂的烂摊子，由游戏引擎中的许多不同子系统秘密组成： 光源： 直接照明的基础层，基于光角度和位置 阴影： 对象遮挡（阻挡）光线并将阴影贴图投射到其他对象上 材料： 3D 表面的颜色、纹理、不透明度和反射率 后处理： 屏幕空间效果，例如色彩校正、光晕和 HDR 眼睛适应 反射 ：真正的反射率需要重新渲染场景；大多数游戏都使用近似值 烘焙： 开发人员预渲染光照贴图和反射数据 “什么是光 vs 游戏如何模拟它”幻灯片来自 Robert Yang 为 GDC 2018 设计的“Invisible Intuition: How To Light A Level” 想象一下用棱镜制作彩虹。在现实生活中，您通过棱镜照射一束光线，彩虹“自动”出现，因为这就是光子和物理的工作原理。 但在视频游戏中，棱镜效果将是一团乱麻： 折射玻璃材质+屏幕空间反射棱镜形状 Ray FX、白色光束和彩虹在 Photoshop 中分别绘制 光束与棱镜相交处的发光贴片 附近表面的焦散投影/半半半半透明 AO 这不是一个光子与表面相互作用的优雅宇宙。在上面的列表中，请注意我们甚至没有使用任何光源！都是“假”的！ 聚光灯在虚幻引擎 4 中投射阴影， 作者：Oskar Świerad（来自 UnrealArtOptimization.com） 点亮视频游戏就是只挑选你需要的东西。 在大多数游戏引擎中，您可以设置一盏灯来关闭阴影，或设置另一盏灯来禁用反射率。这对于 优化 . 这足以让现实生活中的物理学家呕吐。 “但是没有阴影或反射率的光没有任何意义，”物理学家喊道。哈哈，愚蠢的物理学家！这是电子游戏之地！ 图形程序员和物理学家一样暗自烦恼。光线追踪等技术旨在让游戏照明更加优雅。也许10年后就会这样。 （左） 阴影体积图 作者：Rainwarrior，CC BY-SA 3.0； （右）滑自 玩具总动员 3：视频游戏渲染技术 ;都来自 Pekka Väänänen 的“经典 3D 视频游戏影子技术” 光的简史 太阳和月亮（反射太阳光）是最常见的 自然光源 . 还有 人造光源 例如受控火、煤气灯、白炽灯泡……而在 21 世纪，出现了节能荧光灯和 LED 照明。 然而，这不仅仅是一个技术和进步的故事。灯泡并没有让太阳变得过时，LED 也没有让火变得过时。我们仍然喜欢阳光明媚的日子和浪漫的烛光晚餐。 火并没有从世界上消失。相反，火的含义和用途发生了变化。照明设计就是要了解光如何传达这些想法、情绪和情感。 历史上的各种光源：阳光、火、煤气灯、白炽灯、荧光灯、LED 什么是灯光设计？ 现实生活中的灯光设计 是一门根据环境和功能放置光源的艺术/科学，无论是办公室还是喜怒无常的餐厅。 现实生活中的专业照明设计师评估建筑规划并与建筑师协调。他们购买灯具制造商发布的目录，其中包含详细的技术规格和经过实验室测试的光衰减图表/标准化 IES 光度文件，他们可以在 3D 模拟中进行测试。他们还必须平衡有关最低光照水平、预算、维护计划、能源使用和可持续性的当地法律和建筑规范。 来自 Daeyang Electric 目录的灯具目录，包含标准坎德拉 (cd) 的分布曲线/衰减图 由于眼睛会适应附近的光线水平，因此很难猜测房间的实际亮度，因此照明设计师通常会使用 流明法 / 区域空腔法 。为了更准确地现场读数，他们还使用手持式 测光表 测量科学单位，例如 勒克斯 / 流明 / 坎德拉 . 一些游戏引擎越来越多地采用这种技术/科学照明方法。然而，我们必须保持警惕： 现实生活中的照明设计与视频游戏照明设计有着根本不同的目标。 现实生活与视频游戏灯光设计 现实生活中的灯光 游戏灯光 靠电力运行 也靠电力运行 必须遵守物理定律 挑选法律；无神论者 遵守当地法规 没有规则，只有玩家规范 无限光源，无限渲染 针对最少的光源进行优化 长久以来，你都生活在其中 短期，你访问它 眩光确实让人看着很痛苦 Glare 让您的游戏价值 60 美元 舒适性、安全性、可用性、可靠性 戏剧性、细节、清晰度、合理性 IESNA 照明手册第 9 版中推荐的现实教室反射率和亮度比 光源 由于游戏光照非常复杂，我们将主要关注关卡设计师的光照设计基础知识： 放置光源。 核心光源类型 静态光源与动态光源 灯具与光源 核心光源类型 几乎每个游戏引擎都使用这四种核心光源类型： 环境光 是世界上默认的最小光量。不太现实。 定向光 从一个方向投射持续的光，就像从天空向下投射的阳光一样。 点光源 （全向/“全向”光）就像灯泡一样，向各个方向投射光。 聚光灯 从某个位置向某个方向投射一束光锥。 （TODO：光源图） 这些光源共同构成了基本照明工具的完整领域： 全球性，影响一切 本地的，影响附近的事物 向四面八方闪耀 环境光 点光源 向一个方向发光 定向光 聚光灯 其他光形状只是这些核心类型的变体。 区域灯为宽扁矩形聚光灯 管灯是长点灯 发射材料/“纹理照明”使用像点光源一样的自发光像素 静态与动态 一个 静态光 根本没有改变，而 动态光 可以改变颜色、强度、方向或位置。 静态光照对于帧率来说几乎总是更好，因为引擎可以“烘焙”光照贴图和反射等光照数据，但重新烘焙不断变得烦人，而且光照数据会消耗大量内存。 相比之下，动态光意味着关卡可以改变并做出反应，从而实现可切换的移动灯和昼夜循环——但如果光源太多，则可能会使玩家的机器过载，帧率也会受到影响。 《守望先锋 2》（ 官网 ）中“纽约市”地图的光照贴图 UV 图表，图片由 Bruce Wilkie 提供 （来自 Play《守望先锋》.com） 灯具与光源 一个 灯具 是一种可见的、合理的光源，如灯泡或壁炉。但有阳光照进来的窗户，也可以看作一种灯具。在游戏关卡中，这通常类似于建筑特征或装饰灯道具。 这与引擎内光源不同，后者实际上是一种没有明显原因的不可见光源。它通常看起来有点奇怪，并且在现实生活中根本不会发生。 所谓 “有来源依据的光” ，指的是有合理可见灯具支撑的光源。 请注意，一个 单个灯具实际上可以激发多个不可见的引擎内光源。 在哈雷·威尔逊拍摄的下图中，只有两个可见的灯具：橙色的壁炉和蓝灰色的窗户。 但看似两盏灯，实际上是11+个光源！ 中世纪照明研究与光实体 哈雷·威尔逊 (Harley Wilson) 创作（来自 Artstation.com） 照明理论 以下是实现照明设计的两种方法： 三点照明： 电影和摄影等 2D 媒体的通用理论 D6照明： 对于建筑师和室内设计师来说更抽象但更 3D 三点布光 三点布光 是一种具有三种类型灯光的照明理论： 主灯： 主光源 补光： 更柔和的辅助光源来提亮阴影 边缘光： 强调突出物体和边缘 虽然这些核心概念很有用，但它对于关卡设计有局限性。这项技术来自摄影和电影，因此它假设线性固定 2D 屏幕构图，而不是观看者自由导航的交互式 3D 空间。 有关 2D 照明理论的更多信息，请参阅 三点布光 . 三点照明在工作室摄影和肖像摄影中很常见 D6 灯光法 D6 灯光法 是一种专注于覆盖范围和空间的照明理论，受到六面模具的启发。每面代表一种照明策略，总共有六种策略： 焦点⚀ 焦框⚁ 路径 ⚂ 面积 ⚃ 有焦点的区域 ⚄ 有路径的区域 ⚅ 该理论在建筑和关卡设计方面有更多应用，但它比三点理论晦涩难懂且鲜为人知。 有关 3D 照明理论的更多信息，请参阅 D6 灯光法 . 照明研究白盒细目 哈雷·威尔逊 (Harley Wilson) 创作（来自 Artstation.com） 如何点亮关卡 照明可能非常耗时，因此不要尝试一次完成最终照明。相反，应在工作流程中建立灵活性并迭代工作。 我们建议分四遍进行照明： 全局灯光 寻路/主动线灯 玩法/战斗遭遇战灯 细节和情绪照明 1. 全局灯 从任何全局关键光和补光的初始通道开始：天光、环境光和任何天空盒/大气。 如果您使用任何发射材料作为主灯，例如一条发光的熔岩河，然后也配置这个光源。 如果您想要的外观涉及烘焙间接光，请立即运行初始低质量光烘焙。一些奇特的全局照明解决方案（例如 UE5 Lumen）可能能够仅用一盏类似日光的定向光照亮整个游戏世界。 2. 寻路/主动线灯 接下来，确保沿线的所有重要入口/出口 主动线 从所需的进近处照明良好。您可能需要使用本地光源，例如在门口旁边放置一个灯具。 建立一个层次结构。重要的大型出口应该有更重要的照明，而次要空间应该有较暗的、不太集中的灯光。 明亮的门口可以帮助玩家了解 动线 房间的；来自 Magnar Jenssen 的“功能性照明” 3.游戏灯 预示遭遇战的照明（敌人逼近、战线、可能的策略和侧翼） 照明以突出谜题元素并建议探索区域 强烈的聚光灯将注意力吸引到敌人的轮廓上；来自 Magnar Jenssen 的“功能性照明” 4. 细节和气氛照明 微调和调整一切，但不要花太长时间，它可能看起来足够好，如果你调整太多，你可能会破坏前一个通道的效果。 （TODO：图像和示例？） 常见的照明设计问题 光烘焙后阴影太暗？ 您的反照率纹理可能太暗。如果纹理太暗，那么无论您的灯光有多亮，任何产生的光反射都会很微弱。除非您有特定的风格或技术原因需要这样做，否则您的主要漫反射纹理通常应在 50-100% 的亮度范围内。看 “环境纹理价值” 作者：Rogelio Olguin，以及旧的 Epic Games UDK 文档 《Epic Games 纹理指南》 . 深色反照率纹理（上）与中色调反照率纹理直方图（下），来自 《Epic Games 纹理指南》 比较具有深色反照率纹理（左）和中色调反照率纹理（右）的场景，来自 《Epic Games 纹理指南》 照明示例 TODO：展示不同的环境（工业与住宅）和情绪（可怕、舒适） Simon“Sock”O\u0027Callaghan 的关卡设计照明变化图 照明示例：《瑞奇与叮当：时空跳转》 《瑞奇与叮当：时空跳转》（Ratchet and Clank: Rift Apart）（ Steam ） 的照明工作流程概述，来自 GDC 2022：重新校准我们的极限：《瑞奇与叮当：时空跳转》的灯光（来自 YouTube） 要审查... 灯光 赋予场景视觉深度，让玩家能够测量距离并区分形状。因为它具有非常重要的游戏功能，所以您应该这样做 灯光迭代 在关卡设计过程的早期，在适当的艺术通关之前。 视频游戏照明技术是一种近似现实生活中光线的粗糙幻觉。许多游戏灯光效果实际上并不使用任何照明系统。 有4种核心光源类型： 环境光、定向光、点光和聚光灯。 这些灯可以是 静态的 或 动态， 和 有来源依据的 由可见的 灯具 或 没有来源依据的 没有任何可见的来源。 最常见的照明理论是三点照明，它定义了 主光 , 补光 ， 和 轮廓光 基于光线对相机"
                  },
                  {
                      "href":  "process__lighting__d6-lighting.html",
                      "title":  "D6 灯光法",
                      "description":  "空间室内设计照明理论与六种照明策略",
                      "originalUrl":  "https://book.leveldesignbook.com/process/lighting/d6-lighting",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "☀️ 灯光"
                                      ],
                      "searchText":  "D6 灯光法 空间室内设计照明理论与六种照明策略 D6 灯光法 使用普通六面骰（1d6） (1d6) (⚀ ⚁ ⚂ ⚃ ⚄ ⚅) 的六个面来帮助您记住不同的照明策略。 该策略是关于照明 动线 ，而不仅仅是从特定视图或相机角度进行照明。它代表了一种更具建筑性和空间性的照明方法，在大多数情况下，我们鼓励您优先考虑这种类型的照明理论而不是三点照明。 ⚀ 1. 焦点 放置一个单独的光源来强调特定的点或地点，以建议玩家接近这个确切的位置。 点光源平等地对待所有角度，而聚光灯的方向性更多地表明了接近或意图的特定角度。想象一扇孤独的窗户、篝火、汽车前灯、泛光灯、戏剧性的、向下倾斜的孤独舞台灯。 ⚁ 2. 焦框 将两个相似的光源并排放置，以在之间的空间中框出一些东西。它将建议一种垂直于框架的方法。 框架入口或出口。火把、壁灯。 ⚂ 3.路径边界 将聚光灯朝向墙壁倾斜以均匀地“清洗”表面 ⚃ 4. 空间 ⚄ 5. 有焦点的空间 ⚅ 6. 有框架路径的空间"
                  },
                  {
                      "href":  "process__lighting__darkness.html",
                      "title":  "黑暗场景灯光",
                      "description":  "如何在保持可读性的同时照亮夜间/傍晚场景以营造黑暗气氛",
                      "originalUrl":  "https://book.leveldesignbook.com/process/lighting/darkness",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "☀️ 灯光"
                                      ],
                      "searchText":  "黑暗场景灯光 如何在保持可读性的同时照亮夜间/傍晚场景以营造黑暗气氛 当为夜间或阴暗的低光条件照明场景时，游戏开发人员通常遵循电影行业惯例（ 《好莱坞式黑暗》 ): 成功 感觉 黑暗，但实际上并不让它变暗。 早期的电影制片人采用“日拍夜交替”的技术拍摄夜景：在清晨拍摄，并用蓝色滤镜人为地使图像变暗。如今，人工照明和更好的相机意味着当代电影制作人也可以拍摄“夜对夜”的场景。一些电影摄影师（例如 史蒂夫·耶德林 利刃出鞘 (2019) ）甚至将这两种技术结合起来，将日间和夜间的照片合成在一起，创造出印象派的外观。 如果我们用伸手不见五指的漆黑“准确地”照亮我们的关卡，那么玩家将看不到要去哪里并感到沮丧。 本页面建立在主要术语和概念的基础上 灯光 页。 一般夜间设置 在现实生活中，月光是白色的（来自太阳的反射光）......在电影和游戏中，月光是蓝色的。满月将投射出鲜明的投影阴影，阴天的夜晚将投射出很少的阴影 填充灯 = 昏暗、微妙的蓝色点光源，没有阴影和柔和的衰减 不要对所有阴影应用一刀切的环境光；您希望某些阴影终止为 0% 黑色，否则您将无法使用完整的动态范围。使用带方向性的环境光 请记住：不要依赖深色反照率纹理来使场景变暗！让灯光营造出黑暗的感觉。如果将阴影刻录到纹理中，纹理的可重用性会降低，并且难以重新照明，并且会强制照明进入过亮范围以进行补偿。 轮廓光可强调轮廓，同时使大部分拍摄对象处于阴影中 由于对蓝色的依赖如此之多，蓝橙色很常见，但请尝试通过引入第三种颜色或调整色调范围来避免普通的蓝橙 《守望先锋 2》（ 官网 ）中“Numbani”不同灯光场景的情绪板，由 Fabien Christin 拍摄 （来自 Play《守望先锋》.com） 在《守望先锋 2》的上图中，请注意夜间照明场景中的亮度、对比度和调色板（右下）。是什么让夜景看起来像夜景？ 它实际上很亮；增加对比度和镜面反射使其感觉较暗 人物轮廓较暗，地平线较亮 这不仅仅是普通的蓝橙配色（blorange）；有很多紫色和黄色混合在一起 阴影设计 James Gurney 的阴影图，来自 https://gurneyjourney.blogspot.com/2010/02/light-and-form-part-1_15.html 对抗游戏中的“好莱坞式黑暗” 以“好莱坞式黑暗”风格照亮您的游戏会带来更精致的商业感觉，与流行的主流视觉文化相匹配。 就像在电影中一样，一些艺术家有意避免这种风格及其含义。如果这种情绪不适合您项目的体验目标（即您想要制作一些令人不安、混乱、刺耳、视觉实验性的东西），那么您可能希望忽略本页上的大部分建议。 灯光作为机制 大量使用动态光照和手电筒的游戏，尤其是恐怖游戏，可能需要有选择地让高度紧张的场景进入伸手不见五指的漆黑。 来源/进一步阅读 《如何为黑暗打光 | 5 种摄影技巧》 是由电影摄影师 Valentina Vee 撰写的 15 分钟精彩的夜景灯光和制作设计介绍。尽管她专注于电影行业技术，但她的大部分视觉思维也适用于游戏。 \" 在 Source 2 的 Hammer 中照亮夜间场景 \" 是一个由 4 部分组成的 3.5 小时视频系列，其中环境美术家 赫尔德·平托 （《孤岛危机》、《守望先锋》）通过大量解说照亮了葡萄牙夜晚的街景。他的大部分工作流程特定于 Source 2 的 Hammer 工具，但一般思想适用于任何工具或引擎。"
                  },
                  {
                      "href":  "process__lighting__three-point.html",
                      "title":  "三点布光",
                      "description":  "三种光类型的摄影/电影照明理论",
                      "originalUrl":  "https://book.leveldesignbook.com/process/lighting/three-point",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "☀️ 灯光"
                                      ],
                      "searchText":  "三点布光 三种光类型的摄影/电影照明理论 三点布光 是电影、戏剧和摄影中使用的照明设计理论，具有三种不同类型的灯光： (1) 主光 是照亮大部分主体或区域的主要光源。在大多数关卡中，这通常是定向光（阳光）或具有高衰减常数的明亮强大的聚光灯（如泛光灯）。功能光。 (2) 补光 提亮较暗的区域以避免所有东西都陷入阴影。为了填充游戏关卡，我们通常使用环境光和（许多）漂浮在房间中央的不可见的柔和昏暗点灯，但是当您想要引导填充时，例如避免任何填充溅到天花板上，广角昏暗聚光灯也很有用。环境光，洗。 (3) 边缘光 突出显示边缘以从背景中突出前景。强调光。 （在肖像摄影中，有时第四个 背景光 使背景变亮，以消除键和填充中的尴尬阴影。） 请注意此示例中的主光和辅助光大致相互垂直，而边缘/背光位于主体后面。特别注意灯光的位置和方向！ 光源相对于其他灯的位置决定了它们的功能。 然而，在游戏中使用三点的最大问题是它假设你对相机有完全的控制权。如果玩家控制摄像机怎么办？ 三种点光类型取决于灯光相对于相机的方向 - 边缘光是边缘光，因为它掠过拍摄对象，但如果您从不同的角度接近，现在就不再有边缘动作 - 现在边缘光是关键光！如果它从前面看起来像一个昏暗的阴影轮廓，那么从后面看它就会像头灯下的鹿一样发光。灯光的位置很重要，但相机的位置也很重要。 因此，为了在具有自由移动和自由镜头的游戏中有效地使用三点理论，您需要预测玩家将如何利用这两者。 在第一人称游戏中，这意味着大致了解玩家将行走和观察的位置。幸运的是，我们已经有了一个工具来限制玩家的移动和旋转：这就是你的关卡布局！如果您以某种方式构建一个主题，或者限制某个方向的接近，那么您可以为该视角放置灯光。 你的 布局 是一种照明工具。 电影式灯光 三点布光在游戏中最常见的用途是 过场动画中的角色照明。 因为你在过场动画中有更多的摄像机控制，所以你应该利用更多的电影照明技术——因为你基本上是在制作一部电影。 TODO：总结来自 Double Fine 的 《脑航员 2》（《脑航员 2》（《脑航员 2》（Psychonauts 2）（ Steam ））） 高级概念艺术家 Derek L. Brand 的电影灯光备忘单中的文本 https://twitter.com/DerekLBrand/status/1440089196467609608 使用主光照明角色，Derek L. Brand 用于 《脑航员 2》（《脑航员 2》（《脑航员 2》（Psychonauts 2））） 的内部文档 https://twitter.com/DerekLBrand/status/1440089196467609608 使用补光照亮角色，Derek L. Brand 用于 《脑航员 2》（《脑航员 2》（《脑航员 2》（Psychonauts 2））） 的内部文档 https://twitter.com/DerekLBrand/status/1440089196467609608 通过曝光和明度分析进行照明，Derek L. Brand 用于 《脑航员 2》（《脑航员 2》（《脑航员 2》（Psychonauts 2））） 的内部文档 https://twitter.com/DerekLBrand/status/1440089196467609608"
                  },
                  {
                      "href":  "process__overview.html",
                      "title":  "🗺️ 如何制作关卡",
                      "description":  "视频游戏关卡设计的一般工作流程和概念概述",
                      "originalUrl":  "https://book.leveldesignbook.com/process/overview",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS"
                                      ],
                      "searchText":  "🗺️ 如何制作关卡 视频游戏关卡设计的一般工作流程和概念概述 大多数 3D 关卡设计项目都涉及此过程： 前期制作 ：规划出大创意和整体体验设计。 战斗 （选修的） ：对于战斗游戏，定义玩家和敌人类型如何交互。 布局 : 绘制一个关卡的自上而下的可视化 2D 计划。 白盒 : 构建基本的游戏内 3D 草稿并对其进行试玩测试。 脚本编写 ：整合事件和行为（任务、任务、门、按钮、AI） 灯光 : 安排光源以提高深度和可读性 环境美术 ：“美术处理”带有道具和布景的关卡 发布 ：记录、宣传和发布项目。 如果您不知道从哪里开始，请尝试做所有事情。随着经验的积累，您将了解何时跳过或扩展某个阶段。 Dave “DaveJ” Johnston 为《反恐精英 1.6》（ Steam ） 设计的 de_dust（《反恐精英》系列经典地图）地下通道 定制流程 每个关卡/项目都有不同的需求。没有一种万无一失的制作关卡的方法。 团体项目 需要更多 前期设计 和规划，比如 节奏 轮廓和 布局 图纸。如果没有足够的沟通和文档，协作者就无法协作。 战斗 游戏/多人游戏地图 需要更多 白盒 调整时间 遭遇战 和 地图平衡 重点关注 试玩测试 . 单人游戏关卡 叙事 重点 从较长的白盒期中获益较少。这听起来可能很吸引人，但实际上这是一个零确定性的特殊地狱。什么时候一个故事“足够好”？你需要大量的迭代 脚本编写 和 环境美术 。如果你的故事发生了变化，你就必须重做所有事情，而且很难保持所有事情同步。曾经玩过故事毫无意义的游戏吗？这可能也会成为你的游戏。 流程概览 1. 前期制作 前期制作 是关于规划项目的基本形状和范围。该项目是关于什么的？设计目标和限制是什么？ 初学者常常完全忽视项目规划，而经验丰富的设计师有时会过度规划。大型商业工作室经常花费数月甚至数年的时间进行前期制作。在团队中协作时，此阶段非常重要，因为这是大家一致期望的时候。作为业余爱好者单独工作时，您可能不需要太多计划。 前期设计计划通常是文本文档、带有可移动卡片的看板和电子表格。 有关概念规划的更多信息，请参阅 前期制作 《最后生还者》（顽皮狗）内部规划板的照片，来自维多利亚和阿尔伯特博物馆的“电子游戏” 2. 战斗设计 （选修的） 如果您的项目是关于战斗的，那么典型的战斗是什么样的，战斗是由什么组成的？玩家们如何准备？如何让战斗感觉多样化且新鲜？ 战斗就像任何其他游戏系统或机制一样。您应该定义这些体验设计目标 前 你为他们制作关卡。 如果您从头开始制作一款格斗游戏，那么只有程序员和美工使其具有功能性和可读性后，战斗才会“感觉良好”。基本上你必须先玩完整个游戏才能知道战斗的感觉！由于工作量太大，我们建议对战斗游戏进行改装，以便您可以在预先构建的经过战斗测试的系统上进行练习。 有关设计战斗、武器和敌人的更多信息，请参阅 战斗 . 有关推荐修改的战斗游戏列表，请参阅 工具 . 电子表格细分显示了《战神》（ Steam ）（2018）中瓦尔基里 Boss 的移动矩阵，​ 作者：杰森·德·赫拉斯（Jason de Heras）（来自 Twitter） 3. 布局 这 布局 是关卡的基本结构，通常是核心区域和元素的平面 2D 绘图。 对于一个小型的个人爱好项目，一个简单的布局草图，甚至是涂鸦就足够了。 对于团体/大型项目，详细的布局图是重要的沟通工具。没有人能读懂你的心思；如果你不想象它并谈论它，那么没有人会知道你想要什么。 布局图通常是自上而下的二维平面图，但等轴测图/透视图也很常见。请记住，这并不是要成为一名伟大的艺术家；而是要成为一名伟大的艺术家。这是关于沟通的！绘图是玩家可以去哪里以及可以做什么的视觉计划。 有关视觉空间规划的更多信息，请参见 布局 《军团要塞经典》多人游戏地图“Warpath”的布局图，作者：Robin Walker 4. 白盒 一个 白盒 是一个可玩的关卡草稿，由简单的块状 3D 形状构建而成，细节较少。 我们对关卡的基本结构进行原型设计，以便我们可以在游戏引擎中对其进行测试。试玩测试帮助我们决定关卡是否太小或太大、令人困惑或有趣、平衡或破碎等。 这种试玩测试对于任何战斗游戏或任何重新布置房间可能导致玩家行为发生重大变化的游戏都很重要。如果您意识到房间设计不起作用，那么当它由简单的形状组成时，您可以更轻松地对其进行修改。 白盒文件是加载到游戏引擎中的可玩游戏关卡 / 场景文件。 有关游戏内 3D 原型设计的更多信息，请参阅 白盒 《神秘海域 4》（顽皮狗）中的悬崖关卡截图，作者：Em Schatz 5. 脚本编写 脚本编写 是将行为、事件和游戏逻辑集成到关卡中。 门脚本 是游戏开发中最困难的问题之一。火车和移动平台更加复杂。最好从纽扣和收藏品开始。 任务目标、任务、过场动画、编排——以及任何人工智能控制/战斗/ 遭遇战设计 ——经常依赖脚本。如果您害怕编码，请不要害怕，许多游戏引擎和工具集都有特殊的脚本语言和工具来简化编程过程。 关卡设计文化往往会低估脚本编写者，但脚本编写可以让关卡感觉“生动”，并且对于将地图转变为体验至关重要。 有关使关卡发挥作用的更多信息，请参阅 脚本编写 在《Gone Home》（ Steam ）的早期版本中，门无法正常工作......摘自博客文章 约翰内曼·诺德哈根的《柔道代码》 6. 灯光 灯光 为区块添加阴影和深度，帮助玩家理解关卡的核心形状。 如果没有光，3D 游戏世界会感觉更像是平面 2D 图像，并且很难测量距离或理解完整布局。光和影也可以作为战斗游戏中必不可少的掩体/信息层。 虽然游戏行业通常将照明更多地视为环境美术的装饰性方面，但我们认为照明具有至关重要的游戏功能，并且必须与关卡设计师深入协商来设计。 有关游戏照明设计的更多信息，请参阅 灯光 . 中世纪照明研究与光实体 哈雷·威尔逊 (Harley Wilson) 创作（来自 Artstation.com） 7. 环境美术 一旦您对关卡的整体形状和流程有足够的确定性，您就可以开始添加更多内容 环境美术, 或视觉细节。 安 美术处理 就是添加这些细节的过程。大多数项目都需要多张美术处理。 许多人认为美术处理是“有趣的部分”。初学者常常在没有充分规划、布局或草稿工作的情况下过快地进行美术处理。过早的美术处理会锁定早期的设计错误，因为改变关卡并重做所有艺术作品变得“昂贵”。所以，一定要克制住这种冲动！不要急于获得美术处理！ 有关使关卡变得漂亮的更多信息，请参阅 环境美术 狙击精英中雪地军事码头关卡开发过程的 GIF 动画 8. 发布 当项目完成时，是时候 发布 并确保它到达您的受众。 对于商业项目来说，游戏发布只是噩梦的开始——您必须继续营销和宣传项目、评估用户反馈、修复错误，甚至构建额外的发布后内容。 对于个人作品集项目，您必须正确记录关卡设计，否则没有人会理解您所做的事情。没有有效的文档，该项目基本上不存在。 初学者通常不会在发布阶段投入足够的时间，并假设项目会不言而喻—— 但如果没有人知道这一点，那么你的作品就没有人可以说话。 有关发布关卡/构建作品集的更多信息，请参阅 发布 . 审查 关卡设计通常涉及多个步骤，按照以下一般顺序：（1）前期设计，（2）战斗设计（除非它不是战斗游戏），（3）布局，（4）草图，（5）脚本，（6）灯光，（7）环境美术，以及（8）发布。 但每个项目都是不同的。有时您可能想跳过布局阶段，或扩展脚本阶段，或在脚本编写之前进行环境美术等。 如果您处于项目早期或关卡设计职业生涯早期，您可能应该尝试做所有事情，直到找出最适合您的流程。 现在怎么办？ 从头开始——了解 前期设计 用于关卡设计。即使只是一点点计划也会有很大帮助。它将帮助你弄清楚你到底在做什么。 日常中，大多数关卡设计师倾向于关注 布局 和 白盒 ."
                  },
                  {
                      "href":  "process__preproduction.html",
                      "title":  "🧠 前期制作",
                      "description":  "如何利用机制、体验目标和支柱来规划游戏关卡",
                      "originalUrl":  "https://book.leveldesignbook.com/process/preproduction",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS"
                                      ],
                      "searchText":  "🧠 前期制作 如何利用机制、体验目标和支柱来规划游戏关卡 什么是前期设计？ “计划并不重要，但计划至关重要。” ——某个人 前期制作 是项目的早期阶段，您在此阶段产生想法并尝试弄清楚项目的内容。这是关于回答重大设计问题： 什么 你在做吗？ 玩家能够做什么？ （机制、体验目标、节奏） 哪些部分最重要？ （支柱） 如何 你要做这个吗？ 其他人是如何解决类似问题的？ （研究） 你需要多少时间？这可行吗？ （范围） 您对这些问题的答案将在整个项目中发生变化，但这没关系。 计划很有用，但它并不是魔法。 在你真正做到之前，你不会知道自己在做什么。 项目策划 关卡规划可以采取多种形式。就像一个小型的个人爱好项目一样，计划并不那么重要，您可以编写或绘制一个简单的基本计划，然后享受即兴创作和发现的快感。但对于较大的团队项目，规划可以帮助每个人知道该做什么/每个人需要从彼此那里得到什么。 最小清单 非常基本的问题，对于快速独奏即兴项目来说足够了： 电梯间距 。描述核心概念以及它的有趣之处。 1-2句话。 工具 . 您将使用什么引擎和工具？他们会为这个项目工作吗？你怎么知道？ 范围控制 （基本） 。需要多长时间？多少级？大关卡还是小关卡？ “大关卡”是什么意思？这些是关于的基本问题 范围 ，项目的规模和工作量。 推荐清单 但实际上，您也应该能够回答以下其他基本问题： 支柱 。该项目最重要的 2-3 个主题/功能是什么？ 体验目标。 玩家在每个关卡中应该如何反应？一种情绪，一种行为？ 力学。 玩家会使用哪些频繁的活动/互动/技能？ 资产清单（基本）。 每个关卡需要什么模型、纹理和声音？你已经拥有什么，需要找到或制作什么？ 完整清单 对于 3 人以上或 3 个月以上的项目，更多的规划将有所帮助： 节奏 . 每个关卡会发生什么？为什么？这些关卡如何组合在一起？ 调研 . 这些关卡的灵感/参考点是什么？小组是否有共同的理解和解释？ 世界构建 . 该关卡的背景故事/小说是什么？这些地方是谁建造的？什么逻辑/情绪指导着构建和使用？ 范围控制 （详细） 。每周，你会做什么，什么时候做？哪些功能/关卡是“可有可无”，必要时可以删除？ 在下面的视频中，工业关卡设计师 Steve Lee 讲述了他的流程 - 在绘制任何布局或打开编辑器工具之前，他首先打开一个文本窗口并为关卡中应该发生的情况编写大纲。这是规划的核心： 思考主要想法并进行讨论。 “我如何首先在文本中设计关卡，以及原因”（22 分钟） 视频由 Steve Lee 上传，2022 年 6 月 21 日 力学 一场游戏 机制 是游戏中重复的任何活动、系统或策略，基本上是玩家日常执行或使用的任何动作。 核心机制 是游戏中最基本的频繁和基本的动作/系统，而不太频繁的活动可以称为 二级力学。 人们对“机制”的确切定义争论不休。本书采用了广泛的包容性定义，因为我们不在乎。但如果你在乎的话 阅读更多相关内容 . 我们如何谈论游戏机制的一些例子： 《超级马里奥 64》的核心机制是奔跑和跳跃以到达出口。一些《马里奥 64》关卡支持辅助机制，例如踢墙等秘密捷径。 《毁灭战士》（ Steam ）的核心机制涉及奔跑和射击，很少或没有跳跃。有时，玩家会欺骗怪物互相射击，这是一种称为内斗的次要机制。 《神偷：黑暗计划》是一款关于躲避敌人的潜行游戏，其核心机制是响亮的快速脚步声吸引守卫。与《马里奥》和《毁灭战士》不同，《神偷》不鼓励快速移动，而奔跑是次要机制。 《马里奥 64》、《毁灭战士》和《神偷》都是类似的 3D 动作游戏，内容都是在不死的情况下到达出口。然而，这些游戏需要非常不同的关卡设计方法。马里奥平台游戏将创造一个不可能的《末日》关卡，而《末日》风格的怪物群将创造一个极其不公平的盗贼关卡。 不要针对流派进行设计，不要稀里糊涂地陷入熟悉的模式。相反，应该针对实际存在的游戏进行设计！如果您正在修改游戏，请至少玩几个小时，包括其他修改者的工作。观看 YouTube 游戏片段，注意其他玩家如何使用机制和系统。 《超级马里奥 64》游戏手册中的一页，详细介绍了各种动作和机制 还没有最终确定机制吗？ 如果不了解机制，就很难构建关卡。机制和关卡相互依赖，缺一不可。如果没有在关卡中进行测试，你就无法评估机制，但如果没有最终的机制，你也无法完全评估关卡。 如果你改变你的机制，那么你最终会得到大量浪费的工作和依赖于废弃机制的过时关卡。但如果你没有建立足够的测试关卡来衡量机制的潜力，那么你最终可能会得到一个除了第一个关卡之外就不够有趣的无用机制。 您可能必须丢弃或重做关卡，甚至可能多次！没关系。不要认为这是浪费时间或工作。相反，将每个废弃的版本视为有价值的研究。这就是为什么我们称其为游戏 发展 ——发展是一个需要时间的过程。弄清楚是什么造就了一个好的关卡和一个好的游戏需要时间。 《大金刚》(1981) 的早期设计文档显示了机制、控制和流程；宫本茂 ( 通过推特 ) 构建游乐场测试地图 作为规划过程的一部分，构建 游乐场 白盒 测试地图： 四四方方的大庭院，充满了不同的楼层、房间形状和游戏物品。 这些简单的游乐场式调试关卡对于测试游戏机制和游戏的总体感觉至关重要。如果您正在制作自己的角色控制器和玩家物理原型，那么这一点尤其重要，以确保玩家可以在游戏中舒适地移动。 有关构建供内部使用的测试图的更多信息，请参阅 尺度规范 . 实际内部开发人员标准尺度规范白盒测试地图“K_Test2”和“I_TestM”来自法国版《塞尔达传说：风之杖》，截图由 Dark Linkaël 提供 （来自 tcrf.net） 名词-动词图 如今，现代游戏开发人员很少使用大型“GDD”（游戏设计文档）或大型设计圣经； 没有人会读所有这些， 随着游戏的发展，文档很快就会过时。相反，创建一个 名词-动词图 到 直观地跟踪游戏系统和机制如何交互 . “[名词-动词图]对于发现漏洞和质疑我们对玩家动机所做的假设非常有用，并且对于一目了然的投球非常方便，人们可以通过它比一堆冗长臃肿的文字说明更快地理解游戏。 [...] 这张图是 不 应该列出所有可能的事情，但你认为重要的事情。 \" ——莉娜·范·德文特， 《名词-动词图》 核心玩法名词-动词图 死静态驱动 由鲁本游戏， 来自 Leena van Deventer 的帖子“名词-动词图” 体验目标 安 体验目标 是玩家的某种想法、感觉或活动。要概念化目标，请尝试从以下短语开始： “在这个关卡中，玩家应该[学习/感觉/做]……” 在这个关卡中，玩家应该... ... 学习如何使用二段跳能力。 （教程） 在这个关卡中，玩家应该... ...感到脆弱，然后到达安全屋并感到轻松。 （情感） 在这个关卡中，玩家应该... ...躲避致命的陷阱并在最后解锁一条捷径。 （活动） 在这个关卡中，玩家应该... ...感觉他们正在逃离中世纪的监狱。 （幻想） 设定目标的建议 具体一点。 体验目标不必复杂或深刻，但清晰而具体的体验目标可以帮助您决定构建什么以及不需要构建什么。 “玩家应该玩得开心” 是一个模糊的目标，无法驱动设计决策。什么类型的乐趣？有多少乐趣？说得更具体一些。 或者如果目标是 “让玩家感到恐惧” 那么什么类型的恐惧呢？有身体恐惧、存在恐惧、对失败的恐惧、对拒绝的恐惧、中年危机等等。 从玩家的角度思考。 避免抽象的体验目标。想象一下玩家的视角。 例如， “玩家应该享受非线性” 专注于与普通玩家无关的抽象结构，因此它不是一个有用的体验目标。享受或非线性到底是什么意思？ 想象一下试玩测试后的谈话。您希望玩家对您的关卡有何评价？如果他们说：“哇，那真是……嗯……非线性……”，您会感到受到侮辱。 次要设计目标可以提供帮助。 关卡很少只有一个体验设计目标。即使是教程关卡也能从讲故事和情绪中受益。这些次要目标可以帮助指导您的设计决策。 例如， “同时对抗多个敌人” 是关卡的遭遇战设计目标。但还有很多事情尚未定义。这个关卡是在哪里设置的？什么类型的敌人？ 尝试添加节奏目标： “一开始感觉不知所措”... 所以也许战斗应该在一个小空间开始，敌人几乎包围着玩家。 添加幻想/讲故事的目标： “感觉就像保卫营地免受僵尸袭击”...... 因此，也许我们应该研究露营地的类型（军事？徒步旅行者？冬季？）来规划竞技场。露营地有篝火，也许还有火器……等等。 支柱 整个项目中最重要的体验目标是 柱子 ——从结构上支持并证明整个设计合理的最重要的想法。设计支柱帮助团队保持项目的凝聚力愿景，并抵制实际上不支持主要目标的“功能蔓延”工作任务。 支柱是一种设计规划工具，可帮助您概念化每个关卡或区域的短期体验目标。每个关卡的较小体验目标和较小的游戏节奏都应该以某种方式为你的支柱做出贡献，并最终形成整个游戏体验的更宏大的弧线。 为了帮助内化这些大的设计目标，请用简洁的短语或单词为每个支柱命名。例如，索尼圣莫尼卡的《战神》（ Steam ）（2018）内部设计支柱是战斗、父/子和探索（见下文）。 《战神》(2018) 的核心体验目标/“支柱”，由 SIE 圣莫尼卡工作室提出 由于这是一款大预算 AAA 游戏，因此他们的体验目标还涉及“高光学[动作捕捉]保真度”等生产价值目标。 您可能认为这个角色动画目标与关卡设计没有什么关系，但想象一下一个使动作捕捉角色动画看起来很糟糕的关卡 - 现在谁必须改变他们的工作，关卡设计师还是动画师？ 因为整个团队已经同意动作捕捉动画应该优先作为支柱，也许先前的共识意味着关卡设计师应该改变他们的关卡以适应现有的动画。 通过这种方式，支柱可以帮助我们定义项目的重要内容，从而在开发过程中做出更加一致和连贯的决策。 示例：《脑航员 2》（《脑航员 2》（《脑航员 2》（Psychonauts 2））） 《脑航员 2》（《脑航员 2》（《脑航员 2》（Psychonauts 2）（ Steam ））） 是一款关于探索人类大脑的 3D 平台游戏。 2016 年 11 月，Double Fine Studios 制作了一个垂直切片风格的“美术测试原型”原型的前期设计——比 2021 年 8 月游戏发行早了 5 年。 正如他们的官方开发纪录片视频系列中所描述的 《心灵奥德赛》 在第 8 集中，前期设计团队专注于在虚幻引擎 4 中构建核心动作设置、艺术风格和关卡设计。虽然大部分核心平台机制是从最初的 Psychonauts 1 中继承下来的，但该团队希望尝试新的方式，让玩家的各种心灵力量与平台玩法互动，从而产生在最终游戏中从未出现过的带有可移动钢丝的心灵遥控原型机制。 到开发周期结束时，仍然存在很多不确定性和未解答的问题。这个游戏会好吗？没有人知道。旅程才刚刚开始。 Double Fine 《《《PsychOdyssey》》》 · EP08：“几年的大量工作” （通过 YouTube） 上传于 2023 年 2 月 11 日 示例：《耻辱 2》、《发条大厦》 《耻辱》是一款关于探索复杂地点的第一人称潜行动作角色扮演游戏系列。在《耻辱 2》中，有一个“发条大厦”关卡，其中布局会动态变化。 Arkane Studios 设计师 Dana Nightingale 构建了一个概念验证前期设计原型：（ 推特话题 ) “我在 2013 年初创建了这个概念验证，早在这张地图被批准纳入游戏之前，基本上就是说“是的，这可能会很棒”和“是的，我应该致力于它。”它做到了这两点，但距离地图正式确定还需要一年多的时间。 但当然，我可以根据自己的需要制作一堆动画块。使用真实的关卡几何体可以做什么？这就是我制作这个原型的原因。不那么狂野一点吗？是的。但显然仍然可行。 该原型引入了房间像集装箱一样移动并安装到位的想法，使地图的布局完全动态，但不改变房间。我很高兴我们没有朝那个方向走。 [...] 经过近一年的其他原型工作后，是时候重新审视发条大厦并最终对其进行验证了。我制作了一个新版本，减少了曲折的房间，并更加强调“幕后”区域......” -- 达纳·南丁格尔 (@DanaENight)"
                  },
                  {
                      "href":  "process__preproduction__pacing.html",
                      "title":  "节奏",
                      "description":  "规划供玩家在关卡期间体验的各种活动和事件",
                      "originalUrl":  "https://book.leveldesignbook.com/process/preproduction/pacing",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🧠 前期设计"
                                      ],
                      "searchText":  "节奏 规划供玩家在关卡期间体验的各种活动和事件 什么是节奏？ 节奏 是关卡中活动和事件的一般顺序和节奏。 单人关卡往往需要很强的节奏。如果玩家对关卡中正在发生的事情或他们可以做什么感到困惑，那么这可能表明存在节奏问题。 有效的节奏计划应解决： 范围： 玩家在每个关卡中可以做什么？ 层次结构： 该关卡的哪些部分最重要？ 因果关系： 为什么玩家在（那个活动）之前做（这个活动）？ 信息： 我们什么时候告诉玩家什么？ 强度： 玩家什么时候应该更加集中注意力，什么时候休息和恢复？ 用于 《风之旅人》（ Steam ） (2012) 的精美节奏/绘图图表，摘自 GDC 2013 上的“Designing 《风之旅人》”演讲 节拍和变化 你的水平会发生什么？定义体验的不同时刻和地点是什么？ 一个 节奏段落 是关卡中一个独立的小片段，可以是单个区域、事件、活动或元素。 我们可以将这些节拍比作歌曲中的音乐节拍。当一起演奏时，这些节拍形成旋律和节奏。它们可以单独理解，也可以作为一个整体来理解。为了让节拍更有趣，音乐作曲家 安排 以不同的方式节拍来创造 变化： 脉搏：建立有规律的重复跳动模式，如心跳；建立一个 米 示例：每个关卡都以独特的出口结束 重音/重音：强调或强化某些节拍 有时出口很难找到/到达 休息：结合较弱的节拍或沉默的时间，让观众再次对口音敏感 有时出口很容易找到/到达 主题：短的重复节拍序列 有时玩家在到达出口之前会与老板战斗 变化：重复一系列节拍，但具有不同的旋律、节奏等。 某些楼层有多个出口门 切分音：偏离节拍；现代流行音乐的基础 Boss战进行到一半时，另一个Boss出现 有时假出口门隐藏着怪物 最终boss摧毁了出口门；现在无路可逃 玩家能够创建自己的出口门 强调音乐理论中的不同节拍（韵律、节奏、切分音、预期），摘自 Jack Perricone 的《歌曲创作中的旋律》 重点场景段落 一个 重点场景段落（set piece） 是一种经过特别精心设计的节奏段落，通常有独特的概念，或包含令人印象深刻的活动。 重点场景段落的练习 来自电影制作 ，在那里，大预算的电影项目经常委托大型昂贵的场景，需要独特的布景和复杂的规划——这是观众会记住的强烈场面。 例如，好莱坞动作大片本质上是一系列场景——精心设计的大型打斗、追逐场景或挑战死亡的特技。影片的其余部分主要是为了以半连贯的方式将这些场景连接在一起，并在这些紧张的场景之间为观众提供一些休息。大片动作游戏的运作方式大致相同。 但重点场景段落不一定是大型爆炸性动作序列。喜剧以令人捧腹的尴尬场景为特色，浪漫故事可能强调第一次约会或婚礼，戏剧可能以催人泪下的忏悔或背叛为特色，谋杀悬疑以侦探讲述真实事件结束。 电影或游戏中任何感觉重要、难忘或昂贵的场景都可能是场景。 动作片《黑客帝国》(1999) 中令人难忘的大堂枪战场景剧照 电影《低俗小说》（1994）中令人难忘的舞蹈场景剧照 在游戏中，重点场景段落通常是： 贵 ，需要许多独特的艺术和动画资产，并不断迭代。不易缩小范围或改变用途，因此生产本身就有风险。 不可跳过 ，与项目的核心支柱和主要体验目标密切相关。如果玩家可能会错过并责怪游戏，为什么要花费这么多时间和金钱来制作某些东西呢？ 大量脚本化 并且有点线性/在轨道上，以确保可靠的体验。 如果重点场景段落可以以三种不同的方式发挥，那么它现在相当于三个重点场景段落，因此制作成本是三倍。 场景的关卡设计通常包括： Boss战， 大 拼图 , 或 编舞 ——有很多的东西 关卡脚本 . 竞技场 类型学上，一个大房间来困住玩家，直到他们完成遭遇战或过场动画。 英雄道具 ，独特的环境美术资产让关卡感觉特别特别。 在任何给定的项目中，尝试设计和规划至少一个固定部分。这些序列锚定了项目的其余部分。理想情况下，这个场景应该是让你非常兴奋、迫不及待让玩家体验的东西。 如果你害怕构建重点场景段落的工作，或者更糟糕的是，你不希望任何玩家真正玩它，那么你可能不应该这样做。 如果您正在学习一套新的工具集，那么就不要计划一个巨大的史诗般的场景。如果您是游戏开发新手，那么在您拥有更多经验之前，衡量固定片段的范围可能会很困难。请记住：最好的重点场景段落是你实际上有机会完成并发布的重点场景段落。 “一堆节拍”方法 基于战斗的项目和益智游戏可以通过单独设计许多节拍并稍后将它们排列在一起而受益匪浅。工作流程如下所示： 构思、布局并勾勒出一场孤立的战斗/谜题。 对白盒进行测试和迭代，直到它被证明是有希望的或坏的主意。 重复步骤 1-2，直到您制作出数十个战斗/谜题的原型。 根据共同（或对比）元素安排最佳节拍。 第一人称益智游戏 《传送门》（2007）的原型是一系列互不相连的谜题室，只有在设计师选择了他们最喜欢的谜题后才凝结成连贯的关卡活动。每个测试室的介绍牌上显示的谜题元素图标都是这个“一堆节拍”过程留下的。 《传送门》 中测试室标志的屏幕截图，其中的图标显示了此谜题中存在的不同元素 教学、测试、变化 教学、测试、变化 是关卡设计中常见的 3 节拍模式： 教学 ：向玩家教授游戏活动 示例：在 《传送门》测试室 10 ，玩家学习一个简单的 “扔” 测试： 测试玩家是否可以重复 认出 活动，有提示 随后在传送门 1 的第 10 号房间中，玩家进行更深的投掷 变化 ：扭曲活动的框架；玩家可以通过较少的提示 回忆 它？ 在 《传送门》测试室 12 ，玩家从更高的高度抛掷 在 《传送门》测试室 15 ，玩家在半空中“双掷” 然后 《传送门》测试室 18 以“无限投掷”挑战结束 注意这些“扭曲”节拍是如何间隔的，并且不是在测试之后立即出现 《传送门》 的 Test Chamber 10 中的“teach”和“test”节拍，演练让我们播放视频 主动线 节奏设计假设我们可以影响、预测和限制玩家在游戏中可以/将要做什么。的 主动线 是每个玩家必须经历才能“完成”游戏的核心节奏，无论这意味着什么。 主动线可以采取多种形式： 对于遭遇战来说，主动线可能是击败敌人的理想策略。 对于谜题，主动线是谜题的解决方案，或者至少是最令人满意的解决方案。 对于移动来说，主动线是完成关卡的理想路线。 有关更多信息，请参阅 主动线 . 绘图和记录 有多种方法可以概述和记录关卡的节拍： 节拍表 ，简单的节拍文本列表 流程图 ，节拍如何相互连接的图表 强度图 ，根据玩家尺度规范绘制的分段节拍条形图 节拍表 在电影和电视剧本创作中， 节拍表 是概述主要场景和情节点的列表。我们可以在关卡设计中对节拍进行类似的操作：编写主要事件、场景和关卡的列表。 将节拍表写在纸上、在线文档/电子表格中，或者作为带有可排列卡片的项目板。然后将布景、场景、关卡、Boss 战等的想法写成段落/行/记事卡/便利贴，然后重新排列这些节拍以形成连贯的大纲。 在团队中，当面或通过电话大声交谈和思考很重要 一些免费的在线项目板工具： 特雷洛 , 观念 , 米罗 , 编解码器 理想情况下，使用 IRL 板/墙，这样您就无需担心浏览器选项卡 “早期规划和共享健康栏”幻灯片来自 “清算命运：诸神黄昏规模的战斗设计”作者：Rob Meyer（来自 YouTube） 根据您的设计内容和用途，节拍表可以采用多种形式。 对于动作角色扮演游戏《战神诸神黄昏》（2022 年），首席战斗设计师 Rob Meyer 编写了“Boss 流程”文档（如上图所示），其中概述了大 Boss 战斗场景的关键元素和设计原理，这帮助 Meyer 获得了对系统密集型战斗概念原型设计的批准。 对于《最后生还者》（2013），顽皮狗设计师重新安排了整个游戏的不同关卡、故事时刻和主题。这个“节拍板”（如下图所示）帮助他们规划了完成游戏的节奏，这实际上与这里详细介绍的早期计划有很大不同。 用于规划 V\u0026A Videogames 顽皮狗 (2013) 的《最后生还者》(2013) 的内部插板 (2018) 流程图 一个 流程图 是带有线条、箭头和分支的流程/程序的可视化图。它可视化了 逻辑 节拍的联系。这对于益智游戏或具有多种可能策略和事件链的非线性关卡很有用。当因果关系很重要时使用流程图。 在纸上或白板上绘制流程图，或使用在线白板/流程图工具。我们推荐 米罗 . 使流程图尽可能简单。使用很少的单词并省略小节拍。如果感觉像意大利面条，那么它就太复杂了，你应该简化它。 尝试使流程图朝一个方向“流动”，例如从上到下，从左到右。 根据节拍类型为不同颜色的阴影框着色。 不要将一个大流程图分解为几个较小的流程图。 《耻辱》中隐形 Boss 遭遇战的流程图设计文档，作者：Dana Nightingale 图 要更详细地规划节奏，请根据玩家对关卡进行排序 标准尺度规范 并将该图可视化为 图 . 为了调整《半条命 2（ Steam ）：第二集》和《求生之路 4》中的关卡节奏，Valve 设计师将节奏分为四类： 探索， 四处走动并导航空间。通常是关卡的开始和结束。 战斗， 与敌人作战。 舞蹈， 一些对话或精心设计的脚本序列。在战斗之前或之后使用，以在战斗开始或结束时发出信号。 拼图， 找到一个物品储藏室，打开一扇门。用于间隔战斗序列。 因为这些是基于动作的射击游戏，所以这些设计师专注于 强度 。在水平 X 轴上，他们绘制了以分钟为单位的时间。在垂直 Y 轴上，他们用 0-100%、0-5 或 0-10 的简单数字刻度绘制了强度。 《半衰期 2：第二集》中白森林旅馆遭遇战的强度图，GDC 中国 2014 但“5 强度中的 4 强度”是什么意思？强度分数只是通过了解游戏和观察试玩测试而产生的直觉。这不是一门硬科学。 对于每个项目，您必须设计自己的类别和标准尺度规范。你如何定义“强度”？ 在《风之旅人》中，强度不一定与游戏难度相同。 例如，心爱的角色的死亡可能是一个没有玩家输入的低难度过场动画，但它仍然会有很高的情感强度。从这个意义上说，强度可以更好地理解为 悬念 ，玩家的 利害关系 , 或 参与度 在游戏体验中。 thatgamecompany 工作室的《风之旅人》 (2012) 内部电子表格，来自 V\u0026A Videogames (2018)...注意不同体验目标的多行，以及顶部的强度条 节奏建议 缓慢而安静地开始。 《半条命》（1998 年）以普通的 6 分钟电车之旅开始。以低强度的内容开始游戏或关卡，例如介绍性过场动画或一些低风险的探索。它可以调节情绪并留出时间 世界观构建 的铺陈。 即便是《毁灭战士》（ Steam ）或《雷神之锤》（ Steam ）这类高动作强度的射击游戏，也会从安静的房间开始，让玩家先测试操作、“热身”，再进入战斗。 高点和低点交替。 玩家会适应长时间的高强度训练。任何激烈的 Boss 战在 10 多分钟后都会感觉像是一场艰苦的战斗。为了保持新鲜感，请偶尔休息一下作为对比和调剂和缓冲，否则玩家只会变得麻木。不要试图强迫玩家始终处于“开启”状态。 在高强度的 Boss 战斗之后，过场动画和低强度的区域感觉像是奖励。或者你的核心机制可以鼓励玩家休息并返回城镇，例如出售战利品、修理装备、上交任务等。 避免最大强度的最终 Boss/遭遇战。 thatgamecompany 工作室（名字看起来像一句普通英文，但这确实就是这家工作室的名字） 了解到约瑟夫·坎贝尔 (Joseph Campbell) 的作品 “英雄旅程 / 单一神话” 并非常喜欢它，于是把自己的游戏命名为《风之旅人》（Journey）。其他设计师则参考经典叙事理论，例如 三幕结构 , 古斯塔夫·弗雷塔格的五幕结构 ， 和 亚里士多德的诗学 。这些传统叙事理论的结论是： 情节回落 / “结局 / 收束段” /击败最后的反派，这必须感觉像是高潮的必然结果，否则它就会剥夺高潮的影响力。 一些游戏中的例子： 《黑暗之魂》（ Steam ）的最终boss生命值很高，但战斗风格相对简单，故事情节也很明显；感觉很有挑战性，但这还远不是游戏中最困难的遭遇战 决赛 谜题 《传送门 1》和《传送门 2》（ "
                  },
                  {
                      "href":  "process__preproduction__research.html",
                      "title":  "调研",
                      "description":  "如何研究、分析和分解其他关卡/现实世界参考",
                      "originalUrl":  "https://book.leveldesignbook.com/process/preproduction/research",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🧠 前期设计"
                                      ],
                      "searchText":  "调研 如何研究、分析和分解其他关卡/现实世界参考 为什么要做研究？ 你的关卡并不是孤立存在的。您的关卡存在于其他制作关卡的人的社区中，存在于您之前（和之后）的人们制作关卡的历史中。看看其他人如何解决设计问题，并从他们的成功和失败中学习。 研究还可以帮助您开始您的项目。您将获得一系列灵感和影响来帮助您设计关卡，而不是盯着空白页。 要更好地理解关卡设计问题，请进行一些研究。收集 参考文献 其他关卡和现实世界结构，然后 拆解分析 深入详细研究其构造的具体参考。要挑选出更通用的模式，请组装一个 情绪板 一次由许多参考图像组成。 要收集参考资料、撰写分解图和组合情绪板，您需要使用 Photoshop 等 2D 艺术工具。请参阅 2D 艺术工具列表 . 参考 画人，就要看很多人；要画风景，就要看很多风景。如果没有研究，没有人能够完美地理解解剖学、光线或形状。 关卡设计和架构没有什么不同。研究不同的地方（虚拟的和现实的）以及那些 参考文献 将带领你建造新的地方。 参考可以帮助您建立对比： 要创造新事物，请学习以前已经做过的事情，然后打破它。 要让某件事感觉怪异，首先要建立一种常态感，然后再打破它。 现实世界参考 如果现实且合理的话 地方感 对你的项目很重要，然后先做研究 布局 或 白盒 . 要研究现实世界的位置： 亲自访问该地点（当没有全球性大流行时） 通过 Google 街景“虚拟”访问该地点 对于著名的建筑物和纪念碑，可以在政府/建筑档案中搜索蓝图和计划，甚至可以在 SketchFab 从这些参考出发，你可以做一次 临摹研究 ：制作一个不会出现在正式游戏里的原型，绘制布局草图或搭建草稿白盒，重点放在准确观察，而不是玩法设计。 观察这个地方的本来面目，而不是你想象的样子。 这种类型的复现研究超出了单纯的观察范围，它迫使您回答有关结构和流程的问题，而这些问题是您以前从未问过自己的。 您不会使用此布局或白盒，但之后它将改进您的实际布局或白盒。 在《Untitled Goose Game》（捣蛋鹅）（ Steam ）中重现真实的英国村庄；来自 Jake Strasser 为 2021 年 GDC 所做的《Google 地图，而不是灰盒：〈Untitled Goose Game〉的数字化选景》（来自 YouTube） 游戏内参考 想象一下建造一个带有隧道/地下通道的关卡。研究可能涉及研究具有类似结构特征的其他游戏和关卡。什么才能使它发挥作用？ 因此，您可能想要搜索带有突出隧道和地下通道的著名地图，例如 de_dust（《反恐精英（ Steam ）》系列经典地图）。 幸运的是， de_dust 的创建者 Dave Johnston 写道 地下通道设计： 我过去的测绘经验主要是创建紧凑的内部而不是广阔的外部，所以我感到非常迷失。绝望之下，我用鞋拔出道路的一个拐弯，通向一个向下的斜坡，尽头是一个地下洞穴。 当然，这没有用。虽然 CT 重生区明亮通风，但与我已经制作的阳光明媚的外观相比，这个巨大的房间却阴暗、四四方方，感觉死气沉沉。观察到它也缺乏任何游戏潜力，我很快就把它删除了。 《尘埃》将是一张户外地图。 [...] 浅浅地下降到地下通道可能是我最喜欢的方面之一，无论是从美学角度还是作为一名花了很多时间在山顶上从对手头上弹出的斯太尔侦察兵的玩家。 Dave Johnston 为《反恐精英》1.6 设计的 de_dust 地下通道 约翰斯顿的评论提供了一些建造地下通道的技巧：避免建造阴暗、洞穴状和死气沉沉的东西。将第一次尝试与一条长长的、阳光充足的浅坡道向下通向低净空的内部隧道进行比较。这个 平衡 导致狙击手小巷具有微妙的纵向/垂直空间和长视线。 不过，重点并不是研究 de_dust 本身。注意这个研究过程： 我想了解更多关于 de_dust（《反恐精英》系列经典地图）地下通道的信息 我用谷歌搜索 \"de_dust underpass\" 我读了设计师的评论以及他为什么设计地下通道 结果，我现在开始关注以前没有注意到的新方面 研究参考文献的其他方法 玩关卡并自己分析、做笔记或画草图 搜索网站、粉丝论坛、指南和维基，看看其他人对此有何评论 在 YouTube 或 Twitch 上搜索游戏视频，观看玩家的行为 询问其他人对其设计的看法或注意到 拆解分析 要进一步研究参考，可以把它 拆解分析 ，观察它由哪些部分组成，以及这些部分如何组织在一起。环境美术家经常将他们的作品分解成更小的部分，以展示其比例和结构模式。 分解关卡的最直接方法是在关卡编辑器或某种 3D 查看器中打开它，然后在其中飞行并研究它。 有时您可以反编译地图文件或下载从游戏中提取出来的地图几何体，例如 The Models Resource（游戏模型资源网站） 或在 noclip.website（电子游戏关卡数字博物馆 / 在线关卡浏览器） 。这样做仅用于个人教育目的，请勿重新分发或重复使用此作品作为您自己的作品。 但大多数时候，你并没有地图源文件或地图几何体。这时就可以对照片或截图做一次 覆绘分析 。 将屏幕截图导入 Photoshop/您选择的 2D 艺术工具（请参阅 2D 艺术工具列表 ）并突出显示主要线条、形状和对象。用相同的颜色标记任何重复或图案，注意分层堆叠或对称性。 在下面的布鲁克林大桥覆绘图中，请注意上半部分是如何有两个尖头哥特式拱门的，用强烈的装饰沿其高度分割每个垂直分区；结构的其余部分是一些四四方方的米色砖块形式。还有明显的左右对称性，这意味着我们可以通过构建塔的一侧然后复制粘贴/复制到另一侧来节省时间。如果我们正在研究现实世界的参考，我们还可以寻找示意图和计划以更好地理解形状和比例。 布鲁克林大桥塔楼的覆绘拆解示例，用色块突出对称性和重复性 Lea Kronenberger 的概念艺术分解示例； Chong Fei Giap 的概念艺术 ( 通过超越范围 ) 情绪板 当深度分解没有帮助或者当你有很多不同的参考文献时，将它们作为一个集合一起研究会更有用。一个 情绪板 由许多参考资料和图像组成，它们都传达相似的主题、经历或感受。抓取照片、电影剧照、游戏截图、插图、概念艺术等等！当您将它们作为一个整体进行研究时，您将梳理出共同的模式或趋势。 情绪板对于精确定位原本模糊的体验目标至关重要。假设您想要制作一个令人恐惧的关卡。嗯，你说的“可怕”是什么意思？你指的是一种令人不安的恐惧，认为某些东西只是稍微“不对劲”，或者你指的是怪诞的怪物僵尸。那么，什么样的僵尸是缓慢而自信的蹒跚者，还是精神错乱的奔跑恐怖者呢？ 当您收集参考资料并进行比较时，您会发现您实际上对自己想要的体验有更具体的想法。情绪板可帮助您向自己以及任何合作者和团队成员解释您的意图，他们也可能有不同的看法或看法。 “意大利别墅”项目的示例情绪板（来自 《杀手》（ Steam ） 的屏幕截图）、白盒和美术处理 作者：Stavaas（来自 Polycount） 要审查... 调研 帮助您计划和建立你的关卡。 为了进行研究，收集了一堆 参考 材料。 要仔细分析参考文献，可以制作 临摹研究 ：也就是重建一个小型复现版本，重点放在准确性和观察力上 详细研究特定参考文献 拆解分析 , 可视化分析 覆绘分析 参考图像，添加 标签 和笔记 在由许多参考资料组成的 情绪板 中寻找模式。 现在怎么办？ 利用研究来告知 布局 和 白盒 ."
                  },
                  {
                      "href":  "process__preproduction__scope.html",
                      "title":  "范围控制",
                      "description":  "项目的一般规模和复杂性；通过原型验证",
                      "originalUrl":  "https://book.leveldesignbook.com/process/preproduction/scope",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🧠 前期设计"
                                      ],
                      "searchText":  "范围控制 项目的一般规模和复杂性；通过原型验证 范围控制 是项目的一般规模和复杂性。 在 前期设计 ，您设置初始范围和期望。 游戏开发中的传统智慧是假设每个项目一开始就范围过大。即使是小型合理的项目也隐藏着秘密问题。关卡设计也不例外；即使是一个小关卡也可能需要多次迭代和试玩测试来证明（如果有的话）。如有疑问，请缩小范围并削减不必要的非支柱游戏方面。 随着更多的工作经验（或者在一个团队中，更多的信任），你最终会成为 稍微好一点 在估计项目范围时。如果您是游戏开发新手，我们建议采用 50% 规则：想象您能想到的最小项目……然后无情地削减 -50% 的范围，以获得 +50% 的实际完成机会。 可行性 在从事大型或商业项目时，前期设计是一个重要的步骤 可行性 研究：这个项目可以用提议的时间和资源完成吗？这是一个合理的想法还是一个异想天开的梦想？这有多可行？ 游戏引擎和工具的选择极大地影响了哪些机制和系统的可行性。例如，《毁灭战士 3》（ Steam ）引擎中的开放世界驾驶游戏将非常难以制作，因为该引擎没有对大型景观或车辆的内置支持。 引擎和工具 可行性比仅仅使用您最喜欢的游戏引擎更复杂。每个项目都有不同的需求和目标。 所有权：依赖另一家公司是否明智？许多大型工作室维护自己的引擎，而不是依赖 Unity 或 Unreal，尽管制作自己的游戏引擎显然需要更多工作。 劳工：你能招聘和留住工人吗？例如，如果小型工作室无法抵制大型工作室以高得多的工资挖走员工，那么他们可能会避免使用虚幻引擎。 技术优先：你能改变设计以适应技术吗？想象一下一项需要使用 《毁灭战士》 引擎的工作；制作射击游戏比平台游戏更可行（《毁灭战士》没有跳跃按钮）。 管线 在游戏开发中， 管线 是将文件转换为更可用格式的一系列步骤。前期设计是指您弄清楚大部分流程的时候。 一个 构建管线 制作一个可播放的可执行文件分发给玩家，同时 美术管线 可能专注于将 2D 图像或 3D 模型转换为游戏引擎可用的格式。基本上，如果您看到这些词——转换、导入、导出、编译、烘焙——那么它就是管线的一部分。 关卡设计管线 可能会有很大差异。有时您可能需要单独 工具 或插件来生成景观或建造建筑物。在 2010 年之前，游戏引擎在加载游戏中的关卡文件之前需要“地图编译”优化/错误检查步骤是很常见的。 原型制作 也许评估可行性的最佳方法是制作一个 原型 ：也就是一个规模很小、目标明确、用来回答具体问题的项目。 1997 年，苹果研究人员 Stephanie Houde 和 Charles Hill 发表了一篇著名论文，名为 《原型到底在验证什么？》 。 Houde 和 Hill 定义了原型的三大类： 角色： 它如何满足用户需求，在他们的生活中扮演什么角色？ 实现： 这在技术上可行吗？我们将如何构建它？ 外观与手感： 它会是什么样子，感觉如何？ 当对这些方面中的任何一个进行原型设计时，您都会制作所谓的 概念验证原型 。它可能是纸面原型、引擎技术演示或带有玩家控制器的测试关卡。 布局 和 白盒 也是寻求回答设计问题的原型。 垂直切片 当你试图将多个方面组合成一个更大的方面时 综合性 原型，你正在制作一个 垂直切片 -- 成品游戏的一段示例“切片”，包括体验设计（角色）、一些音频/视觉打磨（外观与手感）以及功能技术基础（实现）。 进行垂直切片迫使团队证明他们的管线。如果他们能够使用当前的工具和工作流程制作出漂亮的切片，那么也许这些工具就足够好了。或者，如果垂直切片感觉不可能，那么就需要对团队的工作方式进行重大改变。 垂直切片还可以帮助我们衡量项目范围。如果需要 5 个月的时间来制作该项目的 10%，那么可能需要 45 个月的时间来制作游戏的其余 90%。 （嗯，显然它比这更复杂，但你明白了。）"
                  },
                  {
                      "href":  "process__preproduction__worldbuilding.html",
                      "title":  "世界构建",
                      "description":  "如何概念化和设计游戏世界的虚构历史",
                      "originalUrl":  "https://book.leveldesignbook.com/process/preproduction/worldbuilding",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "🧠 前期设计"
                                      ],
                      "searchText":  "世界构建 如何概念化和设计游戏世界的虚构历史 什么是世界构建？ 世界构建 是设计虚构游戏世界的背景和历史的高级概念过程。 我们从小说写作中继承了这个过程，尤其是从科幻小说和奇幻小说（SFF）作家那里继承了这个过程，他们经常构建“圣经”，以详尽的百科全书式细节详细描述背景故事、传说和人物关系。 你的世界构建文档可以描述地球的气候、游戏中事件之前的详细政治历史，甚至是平凡的细节，比如每个人早上什么时候起床，或者主角的母亲喜欢吃什么晚餐。 的地图 《顿沃》 ，Arkane Studios 的《耻辱》(2012) 中的虚构城市；深受伦敦的启发 游戏世界构建 避免过早构建世界 因为这是一本The Level Design Book 中文版，而不是一本叙事设计书，所以我们在这里采取一个可预见的立场： 避免过早构建世界。 世界构建是一项工作，如果你过早地进行太多的世界构建，那么这也是没有成效的、不必要的浪费工作。起初， worldbuild 只构建您需要的内容。 在整个前期设计过程中，游戏世界的形状和内容可能会发生巨大变化。如果你太早开始构建世界的小细节，那么它很可能是浪费的工作。如果你写了 10 页关于一座房子的历史，但房子关卡却从项目中删除了怎么办？如果您写了 20 页关于某些怪物及其文化的内容，只是为了您或您的团队稍后缩小范围并用回收的人类 NPC 替换怪物，该怎么办？避免细节可以帮助您保持灵活性并减少对项目的沮丧。 虽然世界构建可能既有趣又有用，但对于新手来说，它常常会分散人们对用角色和动作讲述引人入胜的故事的基本核心工作的注意力。请记住，您最喜欢的史诗奇幻、科幻和超级英雄世界是由数千名经验丰富的专业人士在数十年（或数百年）的时间里用大量资金经过无数次迭代建造而成的。当独自工作时，将自己的世界构建成一个洞是避免制作游戏的好方法。 拥抱功能性的世界构建 克林特·霍金创造 游戏叙事的不和谐 描述玩家的表演（“ludo”）和设计师的预期故事（“叙事”）不协调（“不和谐”）的情况。 然而，绝大多数玩家倾向于容忍游戏世界中的大量不和谐。粉丝维基评论员会争论传说的一致性，游戏评论家会指出令人尴尬的不连贯性，但普通玩家会耸耸肩并继续前进。射击游戏的墙壁完全不受核爆炸和毁灭世界的魔法能量的影响。每个角色扮演游戏都会在游戏过程中复活死去的角色，但又会任意永久地杀死角色，而没有详细阐述永久死亡的形而上学。每个动作英雄都是反社会者，他们毫无悔意地谋杀了数千人。这些不连贯的现象并没有让观众感到特别不和谐。 所以在这本书中我们拥抱 功能主义者 对游戏叙事的态度：视频游戏中的虚构故事世界具有至关重要的设计功能，可以消除交互系统固有的不连贯性。也就是说， 故事解决了游戏问题。 设计问题：玩家是“穿过重复的走廊并射击方块”，还是玩家 “逃离外星人入侵巨大的地下军事设施”？ 技术问题：怪物是“由于寻路人工智能损坏而无法在水中航行”，还是怪物本身 “怕水”？ 最小的世界构建 对于大多数关卡设计项目，我们建议从最小的心理方法开始： worldbuild 最低限度的必要条件 建立关卡设置并支持体验目标。 要规划基本关卡，您只需要构建足够的世界来回答三个基本问题： （过去）谁创造了这个地方？ （为什么？玩家怎么知道？） （现在）现在谁住在这里？ （为什么？玩家怎么知道？） （未来）玩家如何影响这个地方？ （为什么？玩家如何知道发生了什么？居民会如何反应？） 这些答案可以很简单。以下是故事最少的动作游戏关卡示例： 谁创造了这个地方？ 一个人类家庭建造了一座小木屋。 （玩家怎么知道？...它看起来像一个小木屋，按照人体尺寸建造，里面有人体家具和多张床。） 现在谁住在这里？ 有些怪物吃掉了人类。 （玩家怎么知道？……里面有怪物和老骨头，没有活人。） 玩家如何影响这个地方？ 玩家可以杀死怪物。 （玩家怎么知道？...怪物是敌对的，会攻击玩家。） 即使是这个简短的前提也已经具有未来讲故事的巨大潜力。这是什么类型的小木屋，这个家庭有多大，为什么他们定居在这个地方？怪物为何攻击人类？如果有另一种方法来解决这次遭遇战而不杀死怪物怎么办？ “家庭与怪物”的主题如何在关卡的其余部分或游戏的其余部分中产生共鸣？ 综合世界构建 对于大型长期项目（超过几个关卡/几个月），那么更充分地致力于游戏世界及其虚构是有意义的。世界建筑圣经通常由三种类型的世界建筑设计文档组成： 地图 , 时间线 ， 和 笔记。 要组织世界构建文档，请使用个人维基或笔记数据库 - 请参阅 工具 . 地图 绘制超出游戏可玩区域的虚构游戏世界的地图。该关卡与更大的世界或宇宙有什么关系？地图制作是奇幻类型小说中非常常见的世界构建比喻。对于关卡设计师来说，地图可能是最直接有用的世界构建工具。 吸引玩家的最简单方法就是合理性。如果你是世界构建的新手，你现在应该从熟悉的、类似地球的东西开始。 地形/气候图 首先，绘制一张重点关注地形和气候的大比例地图。要设计出类似地球的东西，请从一些基本的地球科学原理开始： 抽奖 各大洲 。模拟 大陆漂移 并确保它们像拼图一样拼凑在一起。 抽奖 风 系统和 纬度 . 盛行风 随纬度变化并与陆地相互作用。 抽奖 山 和 湖泊 . 山脉形态 沿着断层线或火山。 河流 通常从山顶或湖泊顶部流向海洋。 标签 气候 。越靠近赤道越热，越靠近两极越冷。山脉可以阻挡或滞留降雨。是否潮湿、多风、多雨、暴风雨？ 有关研究和设计地形/生物群落的更多信息，请参阅 景观地形 . 示例世界建筑气候地图，来自 N.K. Jemisin 的“Growing Your Iceberg”（ 通过 nkjemisin.com ) 一旦你有了一个坚实的基础世界，你就可以通过有选择地夸大某些方面来让它感觉更独特或更梦幻。 在上面的示例地图中，作者 N.K.杰米辛创造了一个位于赤道上方、有两个大陆的世界。随后杰米辛将目光聚焦于两块大陆之间的一段高能量赤道海洋，并将其放大为一条名为“泪海”的“地狱走廊”，沿岸生长着珍贵的“Furywood”树木。虽然一个经常遭受海啸袭击、影响魔法树木的地区本身就令人难以置信，但当它融入到一个更平凡的世界中时，它会让人感觉更加合理和特别。 政治地图 自然世界建立完毕后，你现在就可以开始在其中居住人类了。他们住在哪里以及为什么？什么对他们来说重要？ 在设计社会时，作者 N.K. Jemisin 强烈推荐一些基本的原则 社会学 并进行研究——并避免依赖对现有现实世界文化的几乎不加掩饰的刻板印象。 不用说，在现实世界中绘制社会和领土地图是极其复杂的。人们总是因为边界、地区名称和政治身份而发生战争。这种冲突和紧张可能会让你的世界变得有趣，所以拥抱地图制作作为混乱的政治设计过程。 定义地图制作者， 他们是谁？他们的动机是什么？它们与所绘制的区域有什么关系？ 绘制同一区域的多张地图 ，但从不同的角度来看。 100 年前或 500 年前，该地区是什么样子？不同背景的不同角色会以不同的方式绘制同一地点或使用不同的名称吗？你的世界里的暧昧和冲突在哪里？ “错误的地图”可能比准确的地图更有趣。 绘制非地理地图 ，没有边界或陆地。城市的“社交地图”会是什么样子？经济地图还是情感地图呢？ 将某些区域留空 ，因为并非世界上的每个地方都与每个人立即相关或了解。没有神秘，任何冒险或探索都是不可能的。 不确定性是自然的； 《神偷：黑暗计划》（1998 年）中“剑”任务的游戏内玩家地图，帮助不大 时间表 绘制游戏世界的历史，跨越几天、几个月、几年甚至几个世纪，并附有简短的注释和标签。 这个地区或地方的历史是什么？人们发生了怎样的变化？就像地理一样，历史也是一门深刻的政治技艺，它会根据从事这件事的人而改变。在撰写历史时，您必须考虑历史学家及其背景、他们的受众是谁，最重要的是，他们夸大了什么以及他们在叙述中遗漏了什么。 再次强调，我们的目标并不是明确回答每个问题的权威史实。想想每段历史所唤起的伟大思想或主题。 （例如天堂穹顶的时间线？） 定义历史学家， 他们在何时何地写信？他们的时间和地点会如何影响他们的感知、记忆或访问？ 设计多个重叠的时间线 ，最好具有特定的相似点和矛盾。 在每个时间线上留下被遗忘的漏洞 ，想想历史学家忘记了什么或他们记错了什么。你的游戏体验的一部分可能涉及重写历史、填补这些空白，或者识别历史中无人知道的新漏洞。 注释 虽然关卡设计师可能更喜欢视觉文档，但叙事设计师和作家往往主要依赖书面文档 笔记， 通常存储在索引卡、私人维基或其他一些组织系统中。这些注释可能包括： 人物传记、日常生活、家族史 位置描述、旅行指南、地质或生态调查 文化入门、宗教经典、当地历史 世界上的书籍、小册子、演讲 《半条命 2》（ Steam ）(2004)/第 3 集的世界构建文档/概念艺术； Marc Laidlaw 的短篇小说，Andrea Wicklund 的概念艺术 做一些鸽子屎 已被删除的 tumblr 用户 kuusamaagi 提出了一条被广泛分享的世界建设建议： ...你可以而且实际上应该拥有奇怪且不切实际的文化事物。只要你也解决现实的后果，它们本质上并不是不现实的。 假设你有一座城市，到处都有驯服的白鸽。它们不是害虫，它们被视为城市的神圣守护者，整个城市都像宠物一样照顾它们、喂养它们。它们之所以如此温顺，是因为伤害或吓唬人是一种社会禁忌。好漂亮的鸽子:) 然后有人指出，即使它们不被视为害虫，野鸽数量完全不受控制——不仅没有被扑杀，而且还被积极喂养和照顾——是否意味着到处都会有鸟粪？ 你内心的一部分想说不，因为这些是你可爱的、漂亮的鸽子。要解释为什么它们不会随地拉屎是有原因的，也许它们超级聪明，经过专门培育和训练，不会随地拉屎。确切地说，任何人如何繁殖和训练一群野鸟的后勤工作都没有得到解决。 更糟糕的解决方案是不拥有这些鸟类，将它们从世界上删除。不，它们会激发快乐，你不能把它们扔掉！ 现在，考虑一下：是的，是的，他们会的，但这座城市也有广泛的公共卫生服务，90% 的时间都在清理所有东西上的鸟粪。该地区最常见的姓氏之一实际上翻译为“刮掉鸽子粪便的人”，这是一项备受尊敬的职业。由于不断定期清洁一切的绝对必要性，这座城市的清洁标准要高得多，并且因公共卫生条件差而引起的公共卫生问题也更少。 鸽子确实保护着这座城市。到处乱搞。 -- kuusamaagi（通过现已损坏的 tumblr 链接） 瑞士树枝上鸽子的照片，作者： Tambako 捷豹（来自 Flickr） 根据 CC-BY-ND 2.0 许可 世界构建的例子 证人 (2016) 如果您有大量的时间和金钱，对您的游戏世界进行全面的生态、历史和建筑开发可能会有所回报。 Thekla Studios 在七 (7) 年时间里花费了 600 万美元打造第一人称解谜探索游戏《The Witness》（ Steam ），并聘请景观建筑设计公司 Fletcher Studio 为其主岛建立建筑历史和逻辑。 弗莱彻着手重新设计该岛 融入游戏世界的不同生态、气候、地质和建筑风格，同时使这个世界建筑与现有的白盒和谜题设计相协调。 Thekla Studios 的《见证者》（2016）最终发行版本中岛区的屏幕截图 “我们首先着手对这个岛屿进行逆向工程，因为它可能在文明出现之前就已经存在了。在寻找具有丰富的孤立文明历史的温带小岛屿的过程中，我们对数百个岛屿进行了识别和研究。亚速尔群岛被称为欧洲的秘密岛屿，提供了最多的研究材料。事实证明，从古代文明到葡萄牙君主制，再到当今的渔村，不同文化的层次是最相似的。可用的航空图像是从亚速尔群岛收集的，然后拼贴在一起创建了一个虚构的岛屿，现在有地形、海滩、水体等……” 建筑公司 Fletcher Studio 于 2011 年为 The Witness 进行的空中生态拼贴研究（ 通过弗莱彻工作室 ) Fletcher Studio 于 2011 年为《见证者》进行的地质拼贴研究（ 通过弗莱彻工作室 ) “我们还为该岛撰写了环境叙述，为后续阶段的设计奠定了基础。通过确定太"
                  },
                  {
                      "href":  "process__release.html",
                      "title":  "🌈 发布",
                      "description":  "如何记录和分发关卡",
                      "originalUrl":  "https://book.leveldesignbook.com/process/release",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS"
                                      ],
                      "searchText":  "🌈 发布 如何记录和分发关卡 一旦你制作了原型、进行了试玩测试并完善了你的关卡，你可能应该 发布 公开它。 您不必 100% 完成项目才能发布它。您可以发布 alpha/beta 版本，甚至只是一个简短的演示。不要等到某件事完全完美才去做，因为很可能没有什么看起来足够完美。许多设计师和开发人员都会发布未完成的项目 - 有些人甚至将其出售，并且他们的玩家喜欢它！ 在此页面上，我们将介绍公开展示自定义关卡、地图包、模组或独立项目的一般最佳实践和规范。 如何记录关卡 要向其他人展示您的项目，您至少需要以下内容： 3+ 游戏内截图 的 主要领域 （没有随意的走廊或壁橱） 至少 1920x1080 分辨率 高品质 .JPG（~80%+ 品质） 如果可能的话，禁用 HUD/UI 元素和敌人 AI 不要拍摄漂亮的墙壁或道具；相反，你的目标是给人一个总体印象 布局 , 动线 、心情、以及 空间构图 2-10分钟的游戏视频 运行中的关卡 30 fps 时至少 1280x720 分辨率 省略任何启动画面、介绍画面、预告片音乐等。 “正常”玩，展示“普通”玩家如何体验关卡 记录与 开放广播工作室 (OBS) ，上传到 YouTube 或 Vimeo 剪辑素材可能很好，但并不一定重要 可选：将您的个人音频设计评论叠加为可选音轨，向老师或未来雇主展示流利程度和沟通技巧 50-100字描述 关于该项目 给它起一个简短好记的名字 单人游戏、多人游戏？核心主题、情感、机制？ 范围是什么？这个项目有多少层、有多大？ 项目学分，谁参与了这个工作？资产从哪里来？ 下载链接 对于游戏玩家，您必须包含 Windows 兼容版本 如果它是带有 Steam 创意工坊等的游戏的自定义关卡/模组，请在那里链接 否则，您可以将文件托管在免费服务上，例如 痒痒io , 游戏震动 , 或 模块化数据库 使用.ZIP ...避免使用 .EXE 安装程序或非传统格式（如 .RAR 或 .7Z），这些格式不易访问且需要特殊软件 TODO：好的屏幕截图与坏的屏幕截图 作品集的额外材料 如果您正在准备关卡设计作品集，希望获得关卡设计师的职位，那么您可能需要准备一些额外的文档： 带标签的自上而下地图概览 在编辑器工具的 3D 视图中，向上飞翔并向下看，截取屏幕截图，然后在 2D 工具中打开它并添加文本标签/标记 要在 Windows 上截取屏幕截图：按 Windows Key + Shift + S ，然后拖动一个矩形 在 MacOS 上截取屏幕截图：按 Command + Shift + 4 ，然后拖动一个矩形 对于单人游戏：沿主动线绘制或编号各个点 对于战斗密集的关卡，显示敌人的布局和战略位置 对于谜题，显示解决谜题的线索/步骤的顺序 对于多人游戏：标记玩家生成点、捕获点等。 处理图像 显示布局图、草图截图...“展示您的作品” 但不要上传太多，只需上传一些即可证明您了解该流程 如果你的布局图难以理解/混乱，最好不要显示它 100 字的开发日志/分析 回顾过去，这个项目的主要优点和缺点是什么？ 随着时间的推移，项目发生了怎样的变化？有什么有趣的试玩测试或故事吗？ 其他游戏的任何关卡对你的方法有启发吗？为什么是那些？ 表明你可以思考和沟通，但不要写太多 任何新闻报道或奖项的链接 除了上述内容之外，请确保包含屏幕截图、游戏视频和下载链接。 除非您进入最后一轮招聘，否则未来的雇主很可能不会下载并玩您的关卡 - 但下载链接仍然很重要，因为它表明您知道如何完成和发布某些内容。如果下载页面充满用户反馈和良好的社交媒体数据指标，看起来会更好。虽然雇主自己可能不会下载并试玩你的关卡，但他们肯定关心其他玩家是否愿意玩你的关卡。 项目越受欢迎/商业化，您需要的文档就越少。 AAA 级设计师只需几张截图就可以了，因为每个人都已经知道他们的作品，而大型工作室经常禁止员工发布任何未经官方批准的内容。然而，如果您是一名默默无闻的学生/新手设计师，正在寻求第一份游戏行业工作，那么不幸的是，没有人会对您或您的工作如此熟悉，您将不得不更加努力地让他们相信您的能力。 不要在您的作品集中包含 Minecraft（ 官网 ） 版本、自定义 《堡垒之夜》（ Epic ） 地图或 Roblox 项目。尽管这些游戏中出现了一些最有趣的关卡设计实践，但不幸的是，业界普遍认为这些工具不专业。 如何发布项目 每个游戏和平台都有自己的社区规范和发布项目的惯例。一些 mod 社区可能更喜欢 Steam Workshop 之类的自动安装功能，而对于独立项目，您可能需要自己将文件托管在 itch.io 等免费游戏平台上。 大多数关卡/游戏的基本发布流程通常如下所示： 收集媒体： 截取屏幕截图、录制并上传游戏视频、准备文字说明和制作人员名单 套餐 .ZIP 文件中的可播放项目文件以及 上传 某处 包含该关卡可能需要的任何其他文件，并且所有子文件夹完好无损 包括一个 readme.txt 包含简要说明和解压缩文件位置的说明的文件 在 Windows 上制作 .ZIP： right-click on folder \u003e Send To \u003e Compressed folder 在 MacOS 上制作 .ZIP： right-click on folder \u003e Compress items 发布 发布 创建一个项目页面（在 itch.io、您的个人网站、Steam 创意工坊、论坛等上），其中包含文本描述、制作人员名单、屏幕截图、游戏视频嵌入和下载链接 在社交媒体上宣传项目页面，恳求人们玩并分享它 Twitter（游戏行业/媒体记者青睐的社交平台） Discord（游戏玩家的主要社区平台，尤其是模组社区） Instagram（普通人/非游戏艺术家的流行视觉平台） ArtStation（游戏艺术家的主要视觉平台，环境美术家必不可少） 如果您要出售您的项目，那么公开发布实际上只是项目生命周期的一半。将会有大量的反馈、错误报告、修复和补丁需要解决。玩家将期待维护和更新。如果你管理得好，你也许能够一次又一次地重新启动游戏，并随着时间的推移培养健康的“长尾”收入……但如果你正在制作商业版本，希望你不会从The Level Design Book 中文版中寻求商业建议，所以我们就到此为止。 如何摆脱绝望 即使你完成了你的项目，也很可能没有人会玩它。 99%的关卡有十几名玩家，一百次下载，最多一千次浏览量。 缺乏大规模的公众反应可能会让人感到非常失望、疏远和沮丧。但这种经历很常见。你并不孤单。如果你没有获得巨大的、惊天动地的成功，那么这并不意味着你是失败的——它使你成为一个人。 记住： 为小社区和受众制作地图、模组和游戏是可以的……您可以为一个受众创建；这些被称为礼物 可以从事小型项目，也可以从事非商业项目 尝试某件事然后永远完成它是可以的 你不需要在一家著名的大型游戏工作室工作才能成为一名出色的关卡设计师 关卡设计是一门艺术，需要磨练其内在美 每个创意领域都有一个不变的事实，那就是对创意人员的需求 社区 理解其中的起伏……如果感到痛苦，请与某人交谈 你不仅仅是一个项目！继续前进！ 现在怎么办？ 去地图吧 进一步阅读：如何记录/发布关卡 行业级设计师 史蒂夫·李（Steve Lee）有一个包含关卡设计作品集建议的视频日志 . Valve 开发者维基：如何拍摄艺术截图 是一个简短的指南，主要由 Valve 关卡设计师 Adam Foster 撰写 罗伯特·杨发表了博客 关于一般游戏设计/开发组合设计注意事项，以及示例组合的链接。"
                  },
                  {
                      "href":  "process__scripting.html",
                      "title":  "📜 脚本编写",
                      "description":  "目标、触发器、谜题",
                      "originalUrl":  "https://book.leveldesignbook.com/process/scripting",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS"
                                      ],
                      "searchText":  "📜 脚本编写 目标、触发器、谜题 什么是脚本编写？ 关卡设计师使用 脚本编写 用于对关卡的特定游戏规则和行为进行编程的工具。关卡脚本的一些常见示例包括： 目标 、探索、使命——一系列目标和 遭遇战 有开始和结束 触发器 进入某个区域时执行逻辑，失去生命值或获得积分等。 门与关口 白盒进度，直到玩家以某种方式解决游戏世界中的问题 游戏对象/实体 移动或反应的东西，如按钮、门、电梯、火车、陷阱等。 （可视化脚本示例） 游戏代码与关卡脚本 在过去几代游戏引擎中，游戏引擎代码与游戏关卡中的脚本逻辑之间存在很大的技术差异。 例如，《雷神之锤》（ Steam ）1 的游戏引擎 idTech2 是用 C/《雷神之锤》C 编写的，但关卡脚本编写者依赖于预制的 实体 具有狭窄的预定义行为。一个 功能按钮 实体只能充当按钮，并且 函数门 实体只能作为滑动物体。如果设计师将门建造成一个向上“打开”的平坦平台，那么这扇门基本上就是一部电梯；这些足智多谋的技巧是必要的，因为关卡设计师无法轻松地编写新类型的实体。实体是特定于关卡的可视化脚本逻辑，作为游戏引擎解释的数据而存在。 Benoit“Bal”Stordeur 在 《雷神之锤》1 中生成武器的非常复杂的实体设置（168 个不同的对象！）的编辑器屏幕截图 https://twitter.com/BafuBal/status/1261974130624167937 对于现代游戏引擎来说，脚本已经变得越来越文本化和代码化。 Unreal Engine 4 的 Blueprint 视觉脚本与 C++ 功能相匹配，Unity 的 Playmaker / Bolt 视觉脚本与 C# API 相匹配，《辐射》 4 / 《上古卷轴5：天际》 脚本编写器使用 Papyrus 语言，而其他引擎通常会嵌入 Lua。现在基本上都是代码了。 所以： 关卡脚本 只是限制在游戏关卡范围内的编码行为。脚本通常与地图中的特定对象或位置交互，绑定到特定实体。它们在此地图之外或跨不同地图的功能有限。与整个游戏中所有关卡共享的“较硬”核心游戏代码相比，可以将其视为给定关卡独有的“较软”代码。 黑客 一个脚本 黑客 是一种一次性的脆弱解决方案，它以非预期的方式使用游戏系统，因此无法支持更广泛的行为，也无法在游戏的其他地方轻松重用。 例如，在《辐射 3》的 Broken Steel DLC 中，玩家在执行任务期间修理并乘坐地铁列车。然而，游戏没有任何实际的车辆或火车系统。相反， 《辐射 3》使用巧妙的技巧来模拟火车 。通过脚本，游戏迫使玩家秘密装备一个名为“DLC03MetroCarArmor”的库存物品——一个执行相机脚本的臂带，让玩家感觉自己好像在行驶的火车上。在《辐射 3》的 GECK 游戏编辑器工具中，臂章看起来像一顶巨大的火车形帽子。 （见下图） 这种脚本黑客可能看起来很荒谬，但它确实有效，并且它为开发人员节省了大量时间，使他们免于不必要地设计复杂的功能。所以有时候 hack 是合适的，但只有当你已经做了足够多的事情时，你才能决定像这样的 hack 规划 适合您的项目范围。在这里，贝塞斯达设计师计划了他们的 DLC，他们知道编写一个他们永远不会再使用的火车系统是没有意义的，因此他们黑客攻击了一辆假火车并成功交付了他们的项目。 《辐射》 3“火车帽”DLC03MetroCarArmor 手环，如 GECK 编辑器工具中预览的那样。来自 目标 任务、任务...通常由触发器和门组成 分支旗模型 辐射/天际编号任务阶段（FSM？） 将其可视化为流程图，可能会变得非常复杂 触发器 触发器让我们定义体积和面积，并将行为应用于这些区域 触发器知道某些东西何时进入、停留和退出...触发器是一个事件 基本触发因素是陷阱、死亡、熔岩等或打开一扇门 对于单人游戏来说，触发器应该是隐形的、无缝的、神奇的，有时只是一次性的触发器？ ...亲爱的艾丝特，用于鬼魂和画外音的触发器... 复杂的触发器：动态调整触发器的大小，就像 Gone Home（ Steam ） 父母的衣柜一样？ 对于多人游戏，触发器不应该是隐形的！！...CS 中的炸弹地点、守望先锋（ 官网 ）中的占领点 门与关口 另请参阅：门控， 门 门是阻碍或阻挡玩家在关卡中移动的东西，通常是沿着主动线。 尽管有其名称，但门不仅仅是门。几乎关卡中的任何东西都可以 功能 作为一扇门，因为任何阻碍进步或流动的障碍，无论是少量还是大量，都是一种门。 一个 硬门 是指如果不完成遭遇战或谜题就不可能取得进展。当我们说“门”时，我们通常指的是硬门。 杀死所有怪物/老板才能打开门 按下所有按钮 收集钥匙 只有 NPC 可以在他们想要的时候打开门（例如，脱离战斗） 或者将所有这些链接在一起......杀死一个怪物以获得钥匙，按下按钮发布一个掉落钥匙的怪物，等等。 软门 玩家可以在不完成遭遇战或谜题的情况下绕过大门，但强烈建议他们不要这样做（例如，怪物太多） 更复杂一点，不那么手持，可以更好地支持速度跑步者......但如果玩家不断绕过大门而没有意识到，不确定发生了什么，或者大门可能太软以至于它甚至不做任何事情，可能会导致一连串的混乱 （非常软）视线受阻，发夹转弯（参见类型学） （软）简单的遍历/跳跃拼图，堆箱子 （柔和）阀门式缓开门闸门 （范围从软到破坏游戏）布局混乱，不清楚如何进展（尽管最终可能会感到糟糕的混乱而不是良好的混乱） 人工智能脚本 产卵者 怪物壁橱 导演AI 提示 寻路节点、怪物跳跃、覆盖节点、剪辑体积、束缚 NPC 和 AI 的掩体提示 Splash Damage 的 Gears Tactics 掩体节点提示标记的编辑器视图（来自 https://www.splashdamage.com/news/blocktober-gears-tropics/） \" 高大的红色盒子是站立掩体（也称为“全”掩体，提供最大程度的保护），较小的粉色盒子是低掩体（游戏中的半掩体） ). 每个掩体节点上的黄色目标显示士兵放置在该掩体节点中时可以从哪些角度进行射击。一些低掩体节点上方的黄色弯曲箭头表明士兵可以越过掩体节点进入相邻侧的节点。仔细放置掩体节点并严格遵守标准尺度规范对于创建一个干净、无错误的掩体设置至关重要，并且可以按照玩家的预期工作。如果一块掩体太高，那么你将无法跳过它，如果掩体节点没有正确放置在角落，那么占据该节点的士兵将无法在角落处射击。这两个例子都会给玩家带来挫败感，必须避免！” ——来自 《Blocktober：齿轮战术》 溅射伤害博客文章 许多格斗游戏也会自动生成标记并手动微调（例如神秘海域 4） 编舞 当我们编写 NPC 执行正常 AI 范围之外的特定操作时，尤其是游戏中的过场动画和 叙事 ，那么这种类型的脚本称为 编舞 。在大型团队项目中，角色编排可能由编剧、动画师或专门的电影艺术家负责。 常见的编排脚本动作包括： NPC演员身体控制如看、转身、行走、说话。 这类 舞台调度（stage blocking） 式的编排行为，应该接入与主游戏 AI 相同的身体系统；也就是说，维护两套不同的行走系统会给项目引入额外的技术债。 动画控制。 完全覆盖默认的空闲姿势或当前的全身动画。 例如，如果两个演员在你的游戏中只拥抱一次，你不应该专门工程化一套拥抱系统；相反，只需用拥抱动作临时覆盖他们的动画即可。 道具与附着物。 将对象暂时绑定到角色关节，例如将帽子附加到头上，或将杯子附加到手上。 时序延迟。 等待 X 秒，对于戏剧性的节奏或暂停很有用。 Camera control. 强制第一人称控制器观看某些内容，或使用其他摄像机角度或电影摄影生成额外的第三人称摄像机。 Game state management. For systemic or combat-oriented games, it is best practice to disable the choreographed actors\u0027 combat AI and physics, as well as pause / block / delete nearby enemies and make the choreographed NPCs temporarily invincible.如果您不管理和清理编排的游戏状态，那么您的演员可能会在过场动画中意外倒地或死亡。 用于《半条命 2》（ Steam ）(2004) 的 Faceposer 编排工具的屏幕截图，具有 3D 预览和基于轨道的时间轴界面 对象交互系统 黑曜石 RPG“天外世界”(2019) 的 QA 负责人 Taylor Swope 花了很长时间尝试调试 NPC 对象交互脚本问题 https://twitter.com/_taylorswope/status/1205252714680045568 We released [...] a fix for the dreaded \"the game thinks my companions are dead\" bug, which I believe I spent more time investigating than I have for any other individual bug in my career. The gist of the bug was that, for some players, a companion quest would be marked as Failed in the quest log, with the reasoning that the companion was dead -- despite the fact that the companion was very much alive and well. One reason it was so hard to pin down is that it was impossible to tell when the bug actually happened -- all of the cases we had were essentially \"hey something bad happened in the last ten hours and now my quest is broken\". Investigating it involved figuring out the location of every script and line of code that could possibly make the game think that a companion was dead. The only logical culprit was a bit of scripting that runs when a companion\u0027s health reaches zero: if they\u0027re in the party, it waits for combat to end and revives them;否则它会将它们标记为“真正”死亡。 [但是]游戏中只有当玩家在船上时，同伴才会在场但不在活跃队伍中。问题是，当同伴在船上时，他们是不受伤害的。 Eventually we figured out that \"undamageable\" does not mean \"invulnerable\" -- they can\u0027t take damage from attacks but can still get hurt from other things.其中一件事：坠落很远的距离。 问题是玩家的飞船上没有足够高的地方导致致命的坠落。所以现在我们必须弄清楚同伴们是如何神秘地最终远远高于水平的。 I looked into tons of theories, including \"maybe their h"
                  },
                  {
                      "href":  "process__scripting__doors.html",
                      "title":  "门",
                      "description":  "如何编写和实现滑动/旋转墙板（又名门）",
                      "originalUrl":  "https://book.leveldesignbook.com/process/scripting/doors",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "📜 脚本"
                                      ],
                      "searchText":  "门 如何编写和实现滑动/旋转墙板（又名门） 众所周知，功能门是视频游戏中最复杂的对象之一。在本页中，我们将概述为什么门如此棘手和困难，以及在关卡中编写门行为脚本的各种经过时间考验的策略。 门的问题 旋转门是动态关卡几何体，它会阻挡可见性（有时）和阻挡运动（有时），可能会被打断、锁定或破坏，可能会被无生命的物体或角色阻挡……这种可能状态的广泛组合会导致许多难以优雅处理的边缘情况。 有关门困境的介绍，请参阅 Liz England 的博客文章 《门的问题》 它触及了大型游戏工作室所有部门之间棘手的交叉点。 最简单、最稳定、无错误的视频游戏门是 没有门。 因此，在向关卡添加一扇门之前，问问自己，那里真的需要一扇门吗？ 但是，如果您必须有门，我们将讨论两类门问题：运动和状态。 如何处理门的移动 首先，决定要实施的门运动类型。 推拉门 比旋转门简单得多。它们可以退回到墙壁/地板/天花板中，并且不能轻易堵塞开口。然而，滑动门确实意味着一个强大的或工业化的社会，可以制造和操作滑动门，例如巨大的吊闸、运河锁、基于传感器的玻璃超市门或未来科幻《星际迷航》的门可能不适合您的关卡小说。 旋转门 扫地面积大，容易困住物体，挡住路也能轻易挡住打开或关闭。这使得它们的物理原理比滑动门更复杂。然而，它们在现实世界中比滑动门更加平凡和普遍，并且意味着非未来主义的世界建设。 对于大多数门的物理问题，为了玩家的方便而犯错，即使这是不现实或不公平的。 这是我们处理门移动和碰撞的一般做法背后的基本指导原则： 为了方便起见，旋转门应该是双铰链的，并且可以向两个方向打开，即向外/远离开门的角色。 （通过 最后生还者2 ) 如果 NPC 可以使用门，他们的 AI 应该“捏”过门口并避免阻挡其他人。如果 NPC 具有寻路 AI，则动态生成或手动放置 AI 提示节点以强制 NPC 远离门，除非他们正在使用门。 （通过 半条命2 ) 如果关卡是关于探索的，请让打开的门保持打开状态，以便玩家可以追踪他们去过的地方。但如果关卡涉及高度紧张或战斗，请慢慢地自动关闭玩家身后的门，以简化遭遇战空间。 （通过 最后生还者2 ) 使用物理引擎时，尝试物理模拟门硬件，即在刚体/铰链上施加扭矩或速度，以便它可以“免费”与其他物理对象交互。 （通过 回家了 ) 门必须清除所有阻挡障碍物才能关闭。 瓦克式的门会对阻挡物体造成伤害力，有时会意外杀死玩家。这种机制将门转化为轻微的危险，这适合像《雷神之锤》（ Steam ）这样的厚重街机动作游戏，但它显然不适合其他类型。 如果门的最终状态并不重要，那么让门半开结束其运动，并在与其他物体碰撞时禁用门关闭力（通过 回家了 ). 但是，如果无论如何都必须强行关闭门，则应用距离衰减的力来推开附近的物体，并设置力的上限。 （通过 生化奇兵2 ) “玩家还可以尝试走进一扇打开的门，并利用无限的力量，将其从铰链上撕下来。” 《Gone Home》（ Steam ）中的开发者屏幕截图，来自帖子 约翰内曼·诺德哈根的《柔道代码》 如何处理门状态 关卡通常有多种门，因此核心门脚本必须支持不同的行为。如果您的工具集中没有预先存在的门实体，您可能必须设计自己的实体。 最基本的门有两种状态：打开或关闭。 但动画门也可以移动——打开或关闭——并且有些门可以部分打开（半开）。你可能需要 OpenStart , Opening , OpenFinished 事件，以及 CloseStart , Closing ， 和 CloseFinished 事件。这些不同的事件提供了插入声音挂钩、动画或物理脉冲的有用位置。 为门对象公开的一些常见参数和设置： moveDistance / rotateDistance ，以引擎单位（滑动门）或度数（旋转门）为单位 某些项目或用例可能需要可配置的 axis 运动（例如吊桥不绕其“上”轴旋转） 旋转门需要一个 hinge 位置，配置为物理铰链对象、网格原点，或配置为局部位置偏移 Vector3 moveSpeed / rotateSpeed ，以引擎单位每秒（滑动）或度/秒（旋转）为单位 delayBeforeClose ，以秒为单位。值 -1 可能意味着“保持打开状态，从不自动关闭”。 startsOpen ，真或假。如果为 true，门将在游戏开始时自动打开/默认为打开状态。更复杂的门可能会将其实现为 initialAjarAngle 值代替。在关卡编辑器中，门对象应始终放置在关闭位置。 openOnTouch ，真或假。如果为 true，则玩家可以触摸或输入隐形触发器来打开门；如果为 false，玩家必须手动启动门或使用按钮。 isLocked ，真或假。如果为 true，则默认情况下玩家无法打开门，必须通过找到钥匙或以某种方式禁用锁来解锁门。 此外，您可能希望向关卡设计师展示打开或关闭大门的不同方式。实施基本 Open() , Close() ， 和 Toggle() 功能，以及 ForceOpen() 或 ForceClose() 可能会应用额外的物理黑客或隐形传态的变体，以确保门无论障碍如何都会改变状态。 锁着的门 最简单的锁门状态是 true / false。然而，这个二进制文件并不总是反映我们在关卡设计中如何使用上锁的门。锁着的门可能会变得异常复杂： 如果有些锁着的门总是可以关闭，而其他锁着的门无论如何都无法打开/关闭怎么办？ 这是两种不同类型的锁门。 如果一些上锁的门是假门，无处可去，只能作为布景来填充墙壁空间并暗示叙事循环，该怎么办？ 这是另一种不同类型的锁门。 如果某些门可以开锁，但某些与任务相关的主动线锁需要特定的钥匙怎么办？ （例如天际） 这是另外两种不同类型的锁门。 有关许多游戏中不同开锁机制的可玩概述，请参阅 约翰内曼·诺德哈根的“力学博物馆：撬锁” . 如果全局任务事件锁定了整个游戏中的所有门，但在任务结束后解锁了所有锁定的门，该怎么办？我们如何区分之前锁定且应保持锁定状态的门，以及之前打开但现在应解锁的门？ （以《巫师 3》为例，关卡设计师必须手动重新配置整个游戏中的每个门，请参阅 “设计师如何不小心打开了《巫师 3》中的每一扇门” )"
                  },
                  {
                      "href":  "process__scripting__nav.html",
                      "title":  "(存根) 导航",
                      "description":  "NPC 和 AI 在关卡中移动和路径的不同方式",
                      "originalUrl":  "https://book.leveldesignbook.com/process/scripting/nav",
                      "breadcrumbs":  [
                                          "BOOK 1, PROCESS",
                                          "📜 脚本"
                                      ],
                      "searchText":  "(存根) 导航 NPC 和 AI 在关卡中移动和路径的不同方式 这是一个存根，显然还没有完成 什么是导航？ 转向与寻路 转向 避障 植绒 阵型 寻路 A星的基础知识 节点图 还有AI提示、掩护 导航网格 如何为关卡准备导航 调试工具（显示目的地、添加AI跟随调试） 重铸或网格，与手动标记 基本的战斗人工智能考虑因素"
                  },
                  {
                      "href":  "studies__irl.html",
                      "title":  "现实空间研究",
                      "description":  "现实世界建筑、物理空间的设计分析",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/irl",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES"
                                      ],
                      "searchText":  "现实空间研究 现实世界建筑、物理空间的设计分析 迪士尼乐园 （美国） 重新思考关卡设计师如何看待主题公园。"
                  },
                  {
                      "href":  "studies__irl__disneyland.html",
                      "title":  "迪士尼乐园 (美国加利福尼亚)",
                      "description":  "地球上最强大的媒体集团运营的主题公园的关键关卡设计入门",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/irl/disneyland",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES",
                                          "现实空间研究"
                                      ],
                      "searchText":  "迪士尼乐园 (美国加利福尼亚) 地球上最强大的媒体集团运营的主题公园的关键关卡设计入门 从历史上看，行业级设计师一直将迪士尼乐园和其他主题公园视为设计灵感。然而，这种传统话语很少质疑迪士尼乐园的运作方式，也忽略了对迪士尼乐园的大量建筑批评。 为了教育行业并提升我们对主题公园设计的讨论，本文从我们关于游戏开发商如何看待迪士尼乐园运作的传统争论开始，然后过渡到有关迪士尼乐园的当代现实世界建筑讨论。 国家地理杂志 1963 年迪士尼乐园复古地图；请注意，公园要小得多 迪士尼乐园前期关卡设计分析 2009 年 GDC 演讲 “我从迪士尼乐园学到的关于关卡设计的一切” 斯科特·罗杰斯 (Scott Rogers) 的著作很大程度上促成了我们行业对迪士尼乐园的普遍理解。在他的演讲中，罗杰斯通过大量摄影示例重点介绍了一些核心课程： 节奏 ：每个迪士尼乐园景点在您游览时都会呈现出几个清晰的主题节拍。 寻路与引导 ：迪士尼乐园围绕中央“weenie”组织每个主题区域，这是一个高度可见的大型地标，具有长视线，吸引游客前往。沃尔特·迪士尼称它们为“weenies”，因为他认为这些“香肠”（地标）吸引了“狗”（游客）。 动线 ：为了给人一种自由的错觉并鼓励运动变化，路径通常会出现无关紧要的分支，并且总是引导游客回到主动线。 叙事 ：每个景点都融合了一致的建筑细节、布景和其他环境故事讲述，让游客在排队等候乘车时沉浸其中。 迪士尼乐园的主街主要作为一个例子而闻名 强迫视角 ，用更少的空间创造出高度的错觉。主街沿线的建筑物第一层按 3⁄4 的比例建造，第二层按 5⁄8 的比例建造，第三层按 1⁄2 的比例建造——每层向上缩小 1⁄8 的比例。 最新的 2019 年完整独立峰会演讲 “在中间放一座城堡 - 迪士尼乐园和塞尔达传说的设计教训” 肖恩·内维尔（Shane Neville）强调了相似的观点：小事、环境故事讲述、广阔的探索道路。与罗杰斯类似，内维尔也是迪士尼的忠实粉丝，并将华特·迪士尼的话奉为圭臬。 weenie 分析幻灯片来自“我从迪士尼乐园学到的关卡设计的一切”，作者：Scott Rogers，GDC 2009 (https://mrbossdesign.blogspot.com/2009/03/everything-i-learned-about-game-design.html) 现在看来，他们的设计点和假设并没有错。许多迪士尼乐园游客来到公园的目的是收集大量细节并乘坐尽可能多的游乐设施，以接受“引导”并探索空间。 然而，作为关卡设计师，我们知道我们的意图并不总是能够转化为玩家体验的现实，而且迪士尼乐园背后的设计意图也不应该被表面上的价值所理解。罗杰斯和内维尔提出了很好的观点，但他们对迪士尼乐园的狂热热爱并不能说明全部情况。 如果迪士尼乐园不是最好效仿的地方怎么办？如果事实上它存在问题和缺陷怎么办？即使迪士尼乐园成功了，如果它不适用于视频游戏怎么办？ 如果迪士尼的公园设计团队如此有才华，我们如何才能将其与令人尴尬的失败相协调？ 加州探险 和 欧洲迪士尼 ——如果迪士尼乐园只是一个侥幸怎么办？如果迪士尼甚至无法可靠地推出新的主题公园，那么这些主题公园设计原则真的有用吗？ 《不复存在的土地》一集讲述了“欧洲迪士尼乐园的失败”，以及法国观众如何讨厌这个本质上是阿纳海姆公园的复制品，尽管它是“精心设计的”；欧洲迪士尼详细讨论于7:50开始 “你必须为公共生活付出代价” 对迪士尼乐园最著名的建筑批评集中在其在南加州更大的社会功能上。尽管有这样的营销，迪士尼乐园并不存在于一个完全脱离世俗人类苦难的神奇维度：它位于加利福尼亚州阿纳海姆，奥兰治县北部一个人口稠密的城市化郊区。我们必须了解迪士尼乐园与其周围环境的关系。 在他的文章中 “你必须为公共生活付出代价”（1966） , 后现代建筑师 查尔斯·摩尔 从三个观察开始： 大多数欧洲城市以及许多美国东海岸城市都遵循地中海模式，其中心有一个大型公共广场——我们都同意留出供公共公共使用的开放土地。我们赋予这个空间以公共重要性，一种“纪念性”，迫使我们涌向那个空间并四处走动。 加州城市没有真正的城市中心。洛杉矶和旧金山市中心的人流量相对较少，尤其是在相对死气沉沉的市政厅附近。洛杉矶最接近公共纪念性建筑的是高速公路立交桥。 加州人到处开着汽车，“漂浮”，对城市中心几乎没有依恋，这与好莱坞对自由的承诺融为一体。技巧、幻想和表演是南加州文化的中心。我们可以成为任何我们想要的人。 随后摩尔批评了加州各地的公共建筑，认为它们都没有真正锚定公众。但他也以他自己的后现代方式承认，步行也许被高估了，而开车去任何地方都是一种极毒的药物。他指出 圣巴巴拉县法院 宏伟的拱门和奇怪的高墙——开车穿过电影布景，假建筑成功地实现了其意图。加州的城市建筑在最好的情况下摆脱了欧洲传统，同时感觉比西班牙更像西班牙。 1965 年的圣巴巴拉乡村“法院”，查尔斯·摩尔 (Charles Moore) 拍摄的《你必须为公共生活买单》中的照片 然而，摩尔认为加州人实际上确实想在城市中心散步，迪士尼乐园就是证明。他是第一个认真地写下它的建筑师，就在它开业仅仅 10 年后： “看来迪士尼乐园非常重要和成功，因为它重新创造了对公共环境做出反应的所有机会，而洛杉矶尤其不再拥有这种机会。它允许在公共领域中进行表演，既可以观看又可以参与。在一个不可思议的地方，就在圣安娜高速公路旁，距洛杉矶市政厅一个多小时的路程，在郊区一片神秘的海洋中，迪士尼创造了一个地方，实际上是一个公共场所。这个世界充满了连续发生的事件，充满了大大小小的戏剧，充满了重要和令人兴奋的关卡制度，有机会以火箭般的雪橇（或火箭般的火箭）或马拉有轨电车的速度做出反应。 1910 年左右的美国大街是主要主题，与之相对应的是童话幻想、边境冒险场景、丛林和明天的世界，而所有这些多样性，以及准确无误的敏感性，都是这种类型的关键。毫无尴尬地参与，这显然是我们历史上的此时此刻我们所渴望的。 没有毛边破坏迪士尼乐园的画面；一切都像好莱坞为过去三代人提供的观看乐趣的音乐喜剧村庄一样完美。相貌英俊、衣着华丽的年轻人几乎在口香糖包装纸掉到一尘不染的人行道上之前就把它们扫掉了。一切都正常，但在外面的世界里却不再如此。 在我写这篇文章时，伯克利不久前在其主要街道中央自豪地获得了一组喷泉，这里曾经是城际公路的通行处，自迪士尼乐园以来这里停有汽车。伯克利宣布，这些喷泉很快将被永久关闭，因为到目前为止，为它们开发的主要公共用途是在其中添加清洁剂，而城市无法承担不断清洁管道的费用。生活并不像迪士尼乐园那样。它更加真实：喷泉在嬉戏，瀑布飞溅，小灯泡在夜间照亮树木，一切都很干净。 迪士尼乐园的美国大街（左）和新奥尔良广场（右），1966 年，查尔斯·摩尔拍摄的《你必须为公共生活买单》中的照片 摩尔认为 美国大街 是迪士尼乐园最重要的部分，因为它模仿了美国人想要相信的自己，而童话主题的幻想世界是最薄弱的部分，因为它感觉太像虚构的。政治幻想比奇幻幻想更强大。 摩尔还在后续书中评论了迪士尼乐园的各种游乐设施 观察到的城市：洛杉矶——建筑和景观指南（1984）。 以下是他对《鬼屋》的评价： 鬼屋是一个有严重缺陷的游乐设施，如果只是因为它给鬼魂带来了自鸣得意和傲慢的待遇，仅仅因为它们已经死了。即便如此，它无疑是地球上最巧妙、最复杂、最引人入胜的空间序列之一。将旅程视为从事件外部（观察者和被观察者相距一定距离）到事件内部（观察者、思想和身体已经进入被观察者）的过程是有用的，因此它最终包围了他，甚至在最后试图进入他。 关卡设计作为公共生活的私有化 五十多年后，摩尔的中心分析仍然得到证实。 迪士尼乐园代表了许多加州人不再期望当地政府做出的公民承诺。然后，迪士尼可以向中产阶级收取角色扮演的特权，就好像他们不是生活在一个因公共服务下降和持续干旱威胁而陷入衰退的城市中一样。只有当你生活在肮脏的人行道上、喷泉坏了、油漆剥落的时候，干净的人行道、正常运转的街道喷泉和鲜艳的色彩才会让人感觉非凡。 为了摆脱痛苦，你只需要付一张票。如果你能负担得起的话。 迪士尼乐园迫使我们问，什么是符合道德和社会责任的关卡设计？谁生活在我们的关卡中以及我们的地图使什么类型的“公共生活”成为可能？如果关卡是迪士尼乐园，那么电子游戏中相当于阿纳海姆周边郊区的是什么？ 2021 年迪士尼乐园（中心）与阿纳海姆周边城市的卫星地图 安心的架构 后来的建筑批评家大多在摩尔的阴影下工作，要么放大社会批判来谴责迪士尼乐园怯懦的资本主义，要么强调虚无主义的后现代态度，将迪士尼乐园视为与拉斯维加斯等灯塔并肩的大胆未来。 1997年，加拿大建筑中心举办展览 “安心的建筑：建设迪士尼主题公园” 由卡拉尔·安·马林（Karal Ann Marling）策划，寻求第三种方式——追踪公园的发展历史，甚至可能衡量它对美国城市化的一些影响： 沃尔特主要对洛杉矶以及他那个时代（20 世纪 40 年代和 1950 年代）的其他美国城市不满意。他不满意，因为在他看来，美国城市已经变成了一个完全混乱的环境：汽车到处飞驰，郊区无规划，没有视觉连贯感，没有安全感和安心感。然而，沃尔特·迪士尼也对主题感兴趣。具体来说，他对美国城市过去的样子、西部边疆以及他记忆中的世纪之交小镇的生活感兴趣。我认为，他最终感兴趣的是创造一个让人们感到安全和放心的地方。 我们将这次展览称为“安心的建筑”，因为在迪士尼主题公园设计的每一点上，你都会感到安全，有保障——你感觉好像你知道自己在太空中的位置。 “美国大街”的照片带有概念艺术和模型的装置，来自 CCA 的“The Architecture of Reassurance”（1997）。 https://www.cca.qc.ca/en/articles/issues/9/let-us-assure-you/32768/touring-the-architecture-of-reassurance 哈佛设计杂志作家汤姆·范德比尔特 (Tom Vanderbilt) 在《哈佛设计杂志》中概述了展览的论点 “毕竟这是一个购物中心世界：迪士尼、设计和美国梦” ，再次关注主街： 虽然“大街”只是主题公园众多景点之一，但它最贴近迪士尼的内心——它不是基于迪士尼的产品，而是基于迪士尼的个人历史和记忆。它也是最能体现“令人放心的建筑”的景点：所有这些建筑和环境风格，从和谐的配色方案到没有垃圾（大街上的“报纸”很早就停刊了，因为人们认为废弃的报纸散落在街道上），再到著名的 5/8 建筑规模（迪士尼称其“使街道成为玩具”），这些因素共同作用，提供了一个无障碍的景观，让迪士尼和游客都可以立即感到“宾至如归”。迪士尼大街更像是弗兰克·卡普拉而不是弗兰克·劳埃德·赖特，它是一个民粹主义天堂，旨在让度假者感到舒适，而不是对潜在源头的成就感到敬畏。 [...] [...]“主街在美学上没有任何威胁，”马林写道，“在这方面，与露天购物中心和真实的街道不同，在这些街道上，每家商店都在令人不安的视觉刺激中与邻居争斗。” [...] 迪士尼非常执着于他对主街的记忆，因此他首先尝试在小镇上开设各种零售商，而不是游乐园里典型的小饰品摊贩和快餐店。马林写道：“迪士尼乐园很难维持鞋店和其他专门服装店的租户名单，不是因为人们来到公园购买乐福鞋和内衣，而是因为沃尔特大街记得曾经有过它们。”但显然游客的幻想并不包括在家里购买商品（越来越多的是在购物中心，而不是在大街上），所以最终商店只出售迪士尼商品。 [...] 汤姆·辛普森 (Tom Simpson) 摄于 1960 年左右，美国迪士尼乐园大街的照片；根据 CC-NC-ND 2.0 许可 《安心的建筑》给人留下的持久印象之一是，创造一种地方感实际上只需要很少的东西——一代郊区建筑商显然没有意识到这一点。马林指出，迪士尼大街舒适的建筑掩盖了 50 年代的商业街外壳，而像当代酒店这样的建筑（类似于路边连锁店的预制酒店）似乎很先进，因为单轨列车穿过其大堂。对色彩、光线、错视画和一点想象力的"
                  },
                  {
                      "href":  "studies__irl__stub-las-vegas-nevada-usa.html",
                      "title":  "(存根) 拉斯维加斯 (美国内华达)",
                      "description":  "游戏设计所建造的城市的关键关卡设计入门",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/irl/stub-las-vegas-nevada-usa",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES",
                                          "现实空间研究"
                                      ],
                      "searchText":  "(存根) 拉斯维加斯 (美国内华达) 游戏设计所建造的城市的关键关卡设计入门 这是一个存根，提醒自己稍后填写 TODO：总结向拉斯维加斯学习"
                  },
                  {
                      "href":  "studies__mp.html",
                      "title":  "多人关卡研究",
                      "description":  "各种多人游戏和玩家对玩家 (PvP) 地图的设计分析和评论",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/mp",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES"
                                      ],
                      "searchText":  "多人关卡研究 各种多人游戏和玩家对玩家 (PvP) 地图的设计分析和评论 放松一下 （光环 1） 竞技场射击游戏的布局和房间设计"
                  },
                  {
                      "href":  "studies__mp__chill-out.html",
                      "title":  "Chill Out (《光环》 1)",
                      "description":  "小型多人竞技竞技场",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/mp/chill-out",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES",
                                          "多人关卡研究"
                                      ],
                      "searchText":  "Chill Out (《光环》 1) 小型多人竞技竞技场 为什么选择光环 1 多人游戏？ Bungie 的“光环：战斗进化”（2001 年）是第一款 Microsoft Xbox 游戏机的关键发布游戏，并且可以说是 Xbox 获得市场吸引力和受众的主要原因。 它也是第一款在游戏手柄上“运行”的 FPS，其单人游戏格式（大型户外关卡、车辆、“智能”AI）和多人游戏设计（完全合作模式、4 人分屏）都非常受欢迎且具有影响力。 《黄金眼 007》(1997) 的精神继承者。 这是 Andrew Yoder 博客文章的编辑版本 “光环的多人游戏地图和公园” 。所有 Chill Out 视频和屏幕截图均由 Andrew Yoder 制作，经许可使用。 系统入门 如果您不熟悉 《光环》（ Steam ） 的标准混战（“杀手”）玩法，请了解以下基础知识： 使用地图上搜罗的各种枪支、物品和能量道具四处奔跑并攻击其他玩家。要获胜，击杀 25 人（有时是 50 人）。 当你死亡时，你会在几秒钟后在随机选择的位置重生。然而，高水平的光环玩家都明白 如何玩光环的重生选择算法 . 与其他FPS游戏相比，《光环》的主要特点来自于它的 漂浮运动 和它的 再生护盾 机制。 漂浮运动： 玩家全速时速度缓慢，加速时速度缓慢。跳跃本身几乎与玩家角色一样高，并且跳跃的持续时间比在地球引力下的持续时间更长。这种缓慢的动作变得可预测，这意味着很容易射击，这意味着在战斗中做出错误的动作会产生后果。 再生护盾： 玩家在受到生命条伤害之前先受到护盾伤害。 受损的护盾将在一秒后开始再生，最多需要一秒才能完成。 如果玩家在再生时间内受到伤害，护盾计时器就会重置。 如果护盾被完全摧毁，玩家很容易被爆头，并且必须等待几秒钟护盾才能开始再生。 有些武器对护盾造成的伤害比对生命值的伤害更大。其他武器造成的伤害足以有效绕过护盾。在《光环 1》中，默认手枪的威力是出了名的强：两次爆头打破了对手的护盾，第三次爆头则立即杀死。 典型的 4 人分屏本地多人混战（“Slayer”）地图“Hang \u0027Em High”，原始 Xbox 版本 请记住：光环是最早为游戏手柄设计的主机 FPS 游戏之一，因此缓慢的移动速度、缺乏空中控制、宽容的护盾和粘性瞄准磁力对于让玩家轻松进入体验至关重要。它比当时的竞争对手《雷神之锤 3：竞技场》（ Steam ）和《Unreal Tournament》要慢得多。这种机制的组合使标准光环多人游戏具有持续的精确性和从容的移动。更严格的环境放大了这些机制，并引入了定义竞争性 《光环》 的地图控制和定位方面。 放松一下 Chill Out 是一张中等大小的室内地图，每个房间都感觉像一个洞穴，没有外部景观或可见的天空。环境纹理属于紫色星盟外星人主题，但建筑具有先行者建筑的更粗糙的角度。很难确定这张地图在光环宇宙中的位置。 最低的房间里还有地面雾，可以帮助玩家在整个地图上垂直定位。结合柔和的灰色、蓝色和紫色的冷色调，这种雾气给人一种冷酷的印象，与地图名称中的双关语相呼应。 Chill Out 是最初 《光环》 1 零售版中附带的十几种不同的多人游戏地图之一。它既不是地图轮换中最令人讨厌的关卡，也不是最受欢迎的关卡，但它仍然提供了一种有用的方法来了解玩家如何使用视线和维护领土来在多人游戏竞技场中建立地图控制。 带有房间标注的“放松”地图布局。绿线表示传送路径。 结构 从结构上讲，“Chill Out”分为三个部分和六个房间：Rocket、Mid、Pink、Gold、Shotgun 和 Spiral。 火箭 偏离中心的是一个四边形的房间，有两层，两个高架平台位于火箭发射器产卵的柱子上，还有一个从底层通向顶部的长坡道。从这个火箭室，顶门通向一个长长的、尖角的大厅，通向粉红色的房间。这个大厅还有一个单向传送到霰弹枪室的通道。一扇较低的门通向黄金房间，一扇小弧形门通向霰弹枪室。还有两个大拱门，其上方有一个空间，通过一座断桥将火箭室与下层房间连接起来。 火箭室。前面的门通向霰弹枪室。金色的房间在右边，粉红色的大厅在上面，拱门在左边。 中/桥 桥室的下层有两个宽阔的大厅，连接着霰弹枪室和黄金室。桥门一侧连接粉红色的房间，另一侧螺旋向下通向霰弹枪室。房间对面有两根大柱子，柱子有一个头高的间隙可以射穿，还有一条单向传送到粉红色的房间。火箭室和桥室一起构成了地图的中间部分。 中。右边的桥通向螺旋，左边的桥通向粉红色的房间。下层大厅右侧通向霰弹枪房，左侧通向金房。 粉色 粉红色的房间是主动迷彩加电和狙击步枪生成的地方。粉红色房间的一个出口是横跨中间的断桥的一部分。另一个出口是走上坡道，进入粉红色的大厅，到达火箭室的顶部，有一扇窗户可以俯瞰金色的房间。粉色大厅的窗户太小，很难跳过去，而且射击角度不大，但投掷手榴弹很有效。粉红色的房间也足够小，容易受到手榴弹的影响。 从粉色大厅看粉色房间。 黄金 黄金房间主要作用是作为火箭房间中部到底部的一个长厅之间的连接，但它也有一个单向传送到螺旋断桥的地方。这种传送是有风险的，因为玩家退出时面朝粉红色的房间，而他们的背部暴露在霰弹枪房间螺旋处的任何人面前。 从长廊看“金”房。门通向火箭室。 霰弹枪 最后一部分是霰弹枪室和螺旋坡道。霰弹枪是超护盾加电产生的地方。无论谁抓住它，都会获得两层额外的护盾保护，并在激活时获得第二层刀枪不入的保护。除了上盾之外，霰弹枪室也是一个薄弱位置。霰弹枪本身只在近距离战斗中有用，而手枪起始武器在地图的所有空间中都更加一致。 从火箭室看霰弹枪室。 螺旋 从螺旋中，玩家可能会看到断桥对面的粉红色，但粉红色的对手可能拥有狙击步枪。螺旋也容易受到手榴弹的攻击。从霰弹枪到火箭室底部还有一个小弯曲，但它的三个侧面都有盲点，包括火箭发射器产生的上方。霰弹枪室唯一的另一个出口是进入中间的另一个长厅，从拱门顶部很容易受到攻击。从粉色大厅到霰弹房中间还有一个传送出口，可以导致意想不到的近战。 跳跃时从螺旋上看到的景色。 竞技元环境 在竞技2v2 Team Slayer中，这种设计的效果是两队都试图控制火箭房和粉红房。当玩家在这些房间中时，游戏会阻止敌人在附近重生，这增加了他们在中下或霰弹枪房间重生的可能性。从这个设置中，控制时间内的团队会随着超护盾能量的重生而进入霰弹枪室。对于被困在霰弹枪室的队伍来说，超护盾是推动敌方队伍并重新获得地图定位的最佳方式。 粉红色房间的景色。 如果两个团队的技术相同，则很难维持此设置或任何其他设置。特别是在 2v2 中，当一名玩家死亡时，另一名玩家需要移动，否则就会面临 2v1 的风险。由于这些权力转移，两支球队都必须在地图上的强势位置之间不断轮换。其中一些位置更多的是关于信息，而不是玩家可以从中造成的伤害。例如，在粉红色房间到桥的门口，玩家可以看到霰弹枪室的两个出口，并可以清楚地看到火箭室，但如果不走出桥，就无法同时看到所有内容。其中两个视野太窄，无法多次击中正在奔跑的敌人，但对于发现敌人来说，这是一个很有价值的位置。这样，信息控制就与地图控制联动起来。 在竞技游戏中，我们还可以将玩家采取的每个行动视为资源交换。当玩家受到攻击时，他们可以交换护盾和生命值来获得更好的位置，或者玩家可以交换一个好的位置来获得能量提升或武器。强势位置是指拥有多种选择且汇率良好的头寸。弱势位置和“陷阱”是指每一个选择都会带来风险的仓位。 门、大厅、传送 所有的门和走廊都又长又窄。 有些门的长度和宽度一样，模糊了大厅和门之间的界限。在这些最狭窄的空间中，玩家无法欺骗敌人的目标或躲避手榴弹。 有些天花板太低，玩家跳下去会撞到头。因此，玩家可以通过向这些走廊和门扔手榴弹来延迟敌人的推进或强制撤退。这些结构也比战术射击游戏中的门口更难做出承诺。 盾牌机制及其对战斗中持续精确度的要求意味着玩家必须致力于进入竞技场，而不是从门的另一侧无效地戳戳。 从黄金到火箭的大门造成了很大的盲点。 长长的大厅从护盾重生点穿过中间，到达黄金房间 地图的单向传送也起到了一种门口的作用，但它们比实际的门更难做出承诺。在休闲游戏中，由于过于混乱而无法预测地图另一侧的游戏状态，传送就像掷骰子：敌人可能在出口处扎营，或者玩家可能让敌人措手不及。作为一个新玩家或不常玩的玩家，甚至很难记住哪个传送去哪里，这可能是玩法中惊喜甚至幽默的来源。 传送也是逃避战斗的一种方式，因为不可能通过它们射击或投掷手榴弹。谁先进入瞬移，就可以退后一步，等待对手追击，然后进行近战攻击。或者，玩家可以在穿过传送入口时将手榴弹从传送入口弹开，阻止敌人继续追击。 摩擦力 当前游戏设计的原则之一是限制玩家遇到的“摩擦”或“粗糙边缘”。摩擦的一种形式是测试无聊的技能。例如，从粉红色房间过桥到螺旋形房间需要小心跳跃，如果时机错误，则意味着几乎不会错过并在底部中间掉入空地。有一个类似的跳跃到火箭平台，还有另一个到拱门的顶部。这些都是令人沮丧的技能检查，因为没有部分故障状态或恢复空间。这些失败的跳跃所带来的缓慢、可预测的坠落的惩罚使它们变得更糟。 中下方的地面上也有断桥的碎片。尽管这些为抽象地图增添了视觉趣味，但它们却给游戏空间增加了字面上的摩擦。经验不足或心烦意乱的玩家试图穿过底部中路时，如果不向下看或盲目跳跃，就不会意识到自己被困在什么地方，这两者都会花费时间并可能导致玩家死亡。 我们还可以将狭窄的走廊和低矮的天花板视为摩擦源。这些空间让人感觉不舒服。但修复这些区域，就像《光环 3》在《Chill Out》的“Cold Storage”重制版中所做的那样，从地图的中心移除了一些东西。 社会背景 对于沙发多人游戏来说，《Chill Out》并不是一个连贯的游戏场，而更像是一个冲突和惊喜的漏斗。 想象一下，那是 2001 年，我和三个朋友坐在沙发上玩《光环》。但几场比赛之后，技能差距就很明显了，我们开始临时制定新的目标和规则：近战只在地图向导上进行，反击得分 2 分，摔倒得分 3 分？或者也许是响尾蛇地图上的主动迷彩和狙击步枪？ 如果一个变体变得乏味，我们会在比赛中对其进行调整并开始射击而不是使用近战，或者我们开始驾驶车辆穿过隐形狙击手的领域。目前，该团队对所有这些变体的目标不是谁赢了，或者谁是最好的。 《光环》 2 中多人游戏前大厅菜单的屏幕截图，其中包含可配置的游戏模式选项 这些变体是为了调整规则，增加混乱和不可预测性，这样即使是较弱的玩家也能获得成功。如果变体反而加剧了技能差距，那么玩家可能会放弃比赛或违反规则；本地多人游戏中的这种“恶搞”行为是玩家表达自己不开心的一种方式。 整个游戏模式类似于游乐场上的孩子们如何将标签改编成“冻结标签”，或“熔岩怪物”（只有“它”的玩家可以接触地面），或“金属怪物”（“它”的玩家只能在接触金属的结构周围移动）。这种自由形式的游戏并不关乎输赢，如果游戏锁定在一个已解决的状态，其中一个玩家被困在“它”中，那么该变体就失败了，需要修改。 《士官长合集》光环 1 重制版中“巫师”地图布局的加载屏幕 现在，如果你在 2001 年让我推荐《光环》中最好的地图，我可能会说“巫师”。它有四个轴对称部分、两组链接的传送、独立的第一层和第二层，以及两种类型的四个加电道具。传送和对称性造成了一种迷失方向，这给休闲游戏带来了混乱，并限制了战术游戏。巫师也足够小，迷失方向并不重要；如果玩家选择随机方向并开始行走，他们就会找到对手进行战斗。该地图也适合我们的许多游戏模式变体。 Wizard 是纯霰弹枪游戏、纯近战游戏或荒谬的无限手榴弹游戏的首选地图。它也是一张伟大的山丘之王地图，因为玩家只能通过跳跃才能到达中央柱子结构。 Chill Out 是我们本地多人游戏轮换中的另一张关键地图，但它的设计有更多细微差别，并且在我的记忆中停留得更久。我们如何谈论多人关卡设计，“Chill Out”是好是坏？对于想要安静散步的人来说，这是一个狗公园，还是对于没有孩子的人来说，这是一个游乐场？ 我们可以列出玩家玩地图的所有方式。我们可以将地图分为几个组成部分，描述它们的相互关系，并考虑每个部分如何影响不同的玩家。或者我们"
                  },
                  {
                      "href":  "studies__mp__de_dust2.html",
                      "title":  "(存根) de_dust2 (《反恐精英》)",
                      "description":  "最后更新 4年前",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/mp/de_dust2",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES",
                                          "多人关卡研究"
                                      ],
                      "searchText":  "(存根) de_dust2 (《反恐精英》) 第 3 册，研究 多人关卡研究 (存根) de_dust2 (《反恐精英》) 上一页 Chill Out (《光环》 1) 下一步 现实空间研究 最后更新 4年前"
                  },
                  {
                      "href":  "studies__overview.html",
                      "title":  "🔍 如何学习一个关卡",
                      "description":  "仔细阅读和研究有影响力/有趣的地图和关卡",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/overview",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES"
                                      ],
                      "searchText":  "🔍 如何学习一个关卡 仔细阅读和研究有影响力/有趣的地图和关卡 在一个 案例研究 ，作者对可玩的关卡或位置进行分析。 一个好的案例研究可以确定设计的优点和缺点，考虑典型的玩家行为，并将其与其他关卡和游戏进行比较。这些批判性的设计论文展示了如何应用来自 过程 本书的部分。 有关我们推荐的方法的更多信息，请参阅 调研 . 这部分尚未开发，因为现在我们正在专注于完成 第 1 册，过程 . 《黑暗之魂》（ Steam ）中不死堡第一个区域的遭遇战设计分析，请参阅完整研究： 不死镇（《黑暗之魂》1） 单人关卡研究 分析各种单人地图，通常突出显示 节奏 , 叙事 ， 和 遭遇战设计 . 单人关卡研究 多人关卡研究 多人游戏地图和空间分析，通常突出显示 布局 , 动线 ， 和 地图平衡 . 多人关卡研究 现实世界 从关卡设计的角度分析现实世界（“IRL”）的位置和结构。 现实空间研究"
                  },
                  {
                      "href":  "studies__sp.html",
                      "title":  "单人关卡研究",
                      "description":  "单人游戏和玩家对敌 (PvE) 关卡的设计分析和评论",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/sp",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES"
                                      ],
                      "searchText":  "单人关卡研究 单人游戏和玩家对敌 (PvE) 关卡的设计分析和评论 刺客 （小偷1） 庞大的隐秘关卡，节奏动态 亡灵城堡 （黑暗之魂1） 训练玩家进行战斗和探索"
                  },
                  {
                      "href":  "studies__sp__assassins.html",
                      "title":  "Assassins (《神偷》 1)",
                      "description":  "开放世界 潜行 单人 中世纪城市 讲故事",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/sp/assassins",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES",
                                          "单人关卡研究"
                                      ],
                      "searchText":  "Assassins (《神偷》 1) 开放世界 潜行 单人 中世纪城市 讲故事 为什么是小偷？ Looking Glass Studios 出品的《神偷：黑暗计划》（又名《神偷黄金》、《神偷 1》（ Steam ）、《TDP》或简称为《神偷》）是一款第一人称潜行游戏，讲述在一座坚韧的奇幻蒸汽朋克城市中悄悄穿过阴影躲避守卫并窃取宝藏的游戏。 这款 1998 年的里程碑式游戏营造了一种缓慢而有条理的 RPG 感觉，与《毁灭战士》（ Steam ）(1993) 和《雷神之锤》（ Steam ）(1996) 的快速街机暴力形成鲜明对比。与《毁灭战士》或《雷神之锤》不同，如果你跑过前门并尝试与《神偷》中的敌人战斗，那么你很快就会死。相反，你必须扮演一名街头聪明的反英雄小偷，用分心的方式欺骗​​守卫，或者更好的是，耐心观察守卫的动作并巧妙地从巡逻路线之间的缝隙中溜过去。最重要的是，《神偷》是一款第一人称游戏，玩家需要观察但不能瞄准，躲藏但不能逃跑，当你的所有计划都严重出错时，只能草率地即兴发挥。 多年后，《神偷》推出了三部续集，并启发了后代的“沉浸式模拟游戏”——强调对象交互、庞大的关卡设计、环境故事讲述和非暴力游戏风格的游戏。我们研究《神偷》是因为它创造了一种令人惊叹的世界感和能动性，这在今天仍然很少有人能比拟。 《神偷：黑暗计划》的关键艺术作品展示了拿着火箭的阴暗玩家角色加勒特 刺客 从《神偷》的第一个任务开始（ 《巴福德勋爵的庄园》 ），每个关卡都从安全的公共区域开始，然后是您必须渗透和掠夺的受限制的私人区域。公共空间通常是一个开放的公共空间，您可以在城市街道上漫步，几乎没有危险或受到惩罚。相比之下，私人住宅通常戒备森严，前门戒备森严。 大多数小偷任务的第一步是绘制私人区域的边界并探测任何漏洞或漏洞。 “装上接头”是小偷幻想的基础，因此对小偷的体验目标至关重要。除非外面有安全的公共场所，而里面有危险的私人场所，否则不会有偷偷摸摸的感觉。 当他们开始第四个任务“刺客”（由迈克·瑞恩（Mike Ryan）在格雷格·洛皮科洛（Greg LoPiccolo）的协助下）时，玩家已经习惯了这种公共外部与私人内部的节奏模式。这就是设计师翻转剧本并满足玩家期望的时候。刺客既体现又颠覆了游戏对公共与私人空间的使用，质疑谁真正拥有一座城市。 《刺客：黑暗计划》（1998 年）中，中世纪城市街道上参差不齐，窗户发光，背光窗户闪烁。 该特派团由四名将军组成 节奏 节拍： 简介：站在商店里，差点被刺客 NPC 杀死 跟随：秘密跟随刺客 NPC 穿过城市，回到他们的雇主身边 豪宅：潜入雇主的豪宅并偷走他的东西 （可选）逃生：如果警报响起，你必须原路穿过城市 布局分为城市街道和府邸两部分。左上角的豪宅几乎占了地图的一半，最初它甚至更大，但在开发后期它必须缩小范围以方便记忆 优化 运行游戏的目标系统要求。 刺客的最终布局；拉米雷斯大厦（左上）的内部布局未显示 任务结构 1. 店铺简介： 你从一家商店开始，这在《神偷》中是不寻常的。之前的所有任务都是从外面开始的，通常就在主入口外面。这个房间也很不寻常，因为《神偷》在每次任务之前都会有一个商店机制，这被严格视为菜单屏幕中的单独模式，而且它永远不是您可以访问的实际商店位置。 当你向前迈出一步时，你会激活一个扳机，从窗户射出一支箭来谋杀店主。然后你无意中听到外面有两个刺客，他们以为他们谋杀了你而走开。 你的任务目标现在完全改变了。你现在必须跟随刺客回到他们的秘密基地而不被发现，而不是闯入当地的寺庙。这种类型的诱饵和切换非常不寻常，并且在整个游戏中再也没有重复过。 店主法库斯在一支箭突然射入看不见的窗户并杀死他之前 因此，刺客在第一分钟就颠覆了《神偷》中的许多设计规范。商店是假商店，任务简报是假简报，目标是假目标。这些惊喜预示着任务即将结束时更大的惊喜。 但此时，玩家几乎没有时间思考（也没有时间抢劫商店），他们就必须立即离开去追随刺客。 2. 追踪：追踪刺客 游戏从未解释如何追踪刺客回到他们的藏身处。缺乏这方面的教程 未公布的惊喜游戏模式 对于当今的当代玩家来说，这或许是令人沮丧的。玩家必须通过反复试验来猜测规则和策略，但你很快就会知道有 失败的三种方式 : 有时刺客会停下来并转身看看是否有人跟踪他们。 如果他们看到你 然后他们就会开始追你，你的任务就会失败。 如果你在金属板上行走或跑步距离它们太近，就会发出很大的声音。 如果他们听到你的声音 如果你太过怀疑，他们就会开始寻找你，而你基本上会失败。 如果你落后太多 ，那么你就会失去他们的踪迹并很快迷失在迷宫般的街道中。如果你落后太远，那么你最终将引发艰难的任务失败。 最重要的是， 当你有因距离而失败的危险时，你不会得到任何反馈。 因此，玩家学会了错误地靠近而不是退后——确切的限制永远不会显示。 在《神偷：黑暗计划》的“刺客”开头跟踪一名刺客 NPC 这个任务是你对这座城市的第一个广阔的感觉，它是一个由狭窄的中世纪街道和小巷组成的巨大迷宫，没有网格图案或标志。在这里，公共领域是未知的、巨大的、势不可挡的，很容易迷失方向。这是《神偷》中唯一一次让这座城市真正感觉像一座大城市。 请注意，它仅 感觉 就像一座城市。与任何现实世界的城市相比，布局实际上并不是很复杂。少量的循环就足以让任何玩家感到困惑。 刺客从商店到拉米雷斯宅邸的路线是随机的，有不同的分支和停留点，但基本上只有三种可能的路径。当他们离开商店并穿过河边的金属桥时，他们可以带走： 短路：他们向西走，直接到达宅邸。 你基本上跳过了一半的关卡 中间路径：他们向北走到一座雕像，然后向西走向宅邸。 在困难和专家难度下，刺客向右分叉并绕行（紫色虚线） 东路：他们向东走，然后蜿蜒回到雕像。 布局可能的刺客路径，从商店开始；右上角附近的紫色虚线路径仅在困难/专家模式下可用 隐身遭遇战设计杰作 在追逐结束时，刺客总是穿过特定的拱门，爬上坡道，然后拐过拐角。 这部分是潜行遭遇战设计的杰作，将玩家所有的潜行技巧浓缩成一分钟信息不完整的紧张即兴创作。 首先，你跟随他们穿过拱门。拱门的 圆形塔楼提供广阔的视野 所以你可以很容易地注意到拱门下方的一片黑暗。关卡设计师显然希望你去那里，因为这是一个被危险的明亮区域包围的孤独的安全岛。 在《神偷》中，明亮的光区域是危险的；玩家必须快速从一个阴影到另一个阴影 然而，拱门下的那片黑暗具有误导性。这并不是很安全。你的光宝石指示器会发出黄色光，这意味着你仍然有些可见，足以引起人工智能的怀疑。 你有三个选择，但没有一个感觉很好： 选项A：如果你呆在坡道底部的拱门下，那么刺客可能会转身看到你，并产生怀疑。失败。 选项B：如果你退回到拱门之前，那么你的视线就会被破坏，你将无法看到刺客在坡道顶部之后去了哪里。失败。 选项C：如果你继续沿着坡道走，明亮的路灯会暴露你的身份，即使没有，你也不知道顶部的地板材料是否会让你的脚步声太吵。失败。 你不能原地踏步，不能逃跑，更不能前进。关卡设计师在逗你。这是一个陷阱。 大多数初次玩游戏的人都会因优柔寡断而陷入瘫痪，并选择选项A——站着不动祈祷。更具冒险精神的人会选择选项C，因为他们知道狭窄的90度角意味着刺客也看不到你，而且刺客永远不会后退。 但是，你如何从那里追踪刺客呢？他们可能就站在那里，看着你。你不能冒险扭转局面。所以相反，你必须倾听。 当他们转过那个拐角时，你听到靴子踩在金属上的叮当声，你会冻结并倾听你听到了多少金属脚步声。大量的金属台阶意味着很长的金属走道。这就是《神偷》脚步机制的美妙之处：它将声音转化为空间。 设计师甚至通过将三种不同的地板材料放在一起来强调金属桩，这在《神偷》中是很少见的。他们希望你注意到石头、金属和木头脚步声之间的快速对比。 3. 拉米雷斯大厦 一旦你找到刺客的藏身处，一座由某个名叫拉米雷斯的人拥有的城堡，你的任务就是执行任务的第二阶段：抢劫他 他所拥有的一切。 这是出乎意料的。你觉得任务现在应该结束了，但实际上感觉像是两个任务合二为一。 （但是你期望什么？否则这件事怎么可能结束呢？） 拉米雷斯豪宅比街道容易攻克起来容易得多。顶层只有少数守卫巡逻，这意味着你可以很快控制整个区域。与我之前分析的真正深思熟虑的城市街道设计相比，这个室内平面图简单易懂，主要走廊狭窄且布置有些对称，许多地板是由相对柔和的石头制成的。 在比较第一个豪宅任务（巴福德勋爵的）和你玩的第二个豪宅任务时，会出现一些差异： 巴福德的地方比拉米雷斯的地方更大、更广阔。 巴福德有一个王座室和独立的翼楼，到处都有很多艺术品。拉米雷斯的别墅规划简单、紧凑，带有中央庭院；墙壁纹理清晰；他还安装了隐藏的墙缝来监视卧室里的客人。 （令人毛骨悚然。） 巴福德的地下室很旧。拉米雷斯最近用非法动物围栏和办公室/计数室翻新了他的地下室。 巴福德的稀世珍宝是一把“皇家权杖”，外面还有拿着锣的守卫。拉米雷斯有一把“银火拨火棍”，以及某种通过房子布线的电子报警系统。警报的差异很明显，这两种宝藏都是非常个人化的、象征着权力的阴茎物品，但你发现火棍的“卧室西洋镜”背景更加阴险。 （你可以在壁炉后面的狭小空间中找到它，这使得它无法用来生火。） 最后，可读性巩固了比较。其中， 巴福德为延迟向拉米雷斯付款而道歉 ，这意味着他在图腾柱上的地位比拉米雷斯低，尽管他的位置更大、更高档。就这样，镜子 使用阅读文本使阅读架构变得复杂 ——哇哦。 将巴福德勋爵的华丽横幅与拉米雷斯的简单设计进行比较；巴福德太努力了？来自 《神偷》 的纹理 关卡设计的差异在于特征的形式：“B”或“R”横幅使这些空间变得私密和个性化。超大的尺寸和过度的装饰意味着巴福德只痴迷于权力的形象；与此同时，相对斯巴达的拉米雷斯更喜欢权力的力量。当你潜入这些城堡时，你实际上是在潜入他们的头脑并了解他们的秘密和不安全感。将其视为环境故事讲述的原始精神病人风格，将家视为其主人的隐喻。 4. 逃脱 刺客的结局太精彩了。这可能是整个任务中最好的部分。不幸的是，这也是 Looking Glass 真正失败的地方。 仅当满足以下条件时，您才能播放结局： 您正在玩“困难”或“专家”难度 你触发了拉米雷斯大厦的警报 对于许多玩家来说，永远不会触发警报是很常见的。困难或专家玩家会发现刺客比以前的任务更容易一些。而在之前的《Down In The Bonehoard》任务中，《神偷》 糟糕的攀爬代码迫使玩家快速加载/快速保存大量内容。结合任务早期部分的零警告失败，玩家将非常愿意扮演完美主义者。 如果你从不触发警报，游戏就永远不会触发任务的最后部分：拉米雷斯的守卫占领了街道，你必须偷偷溜过他们才能回到你的邻居。 在刺客可选的最后阶段，玩家必须溜出拉米雷斯大厦并回到自己的家 每个小偷关卡的“退出”部分通常是微不足道的。你通过一个回溯 已经被你摸透的关卡 ，经过那么多守卫昏迷不醒的尸体。即使他们仍在巡逻，您也已经知道他们的模式和藏身之处。 但在这里，游戏产生了压倒性的优势，大约有二十名新守卫——比宅邸中的人数还要多！ ——而且他们都处于永久警戒状态，在灯火通明的街道上以零可预测性随机漫游。这是赌注和世界状况的意外变化。当你从另一条路回来时，所有这些角落的功能突然变得非常不同。城市的街道既熟悉又陌生。 拉米雷斯已将这座城市私有化：公众现在很危险。该城市以中立空间的形式开始其使命。然后它是一个受害者，被拉米雷斯的私人空间一分为二，这是一座横跨十几个城市街区的大庄园。现在这座城市是你的敌人。 视频 您可以在此处观看本文的解说导览/视频版本： https://www.youtube.com/watch?v=K7e1i95VtiY"
                  },
                  {
                      "href":  "studies__sp__cradle.html",
                      "title":  "(存根) The Cradle (《神偷》 3)",
                      "description":  "最后更新 4年前",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/sp/cradle",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES",
                                          "单人关卡研究"
                                      ],
                      "searchText":  "(存根) The Cradle (《神偷》 3) 第 3 册，研究 单人关卡研究 (存根) The Cradle (《神偷》 3) 上一页 Assassins (《神偷》 1) 下一步 (存根) Sapienza (《杀手》) 最后更新 4年前"
                  },
                  {
                      "href":  "studies__sp__sapienza.html",
                      "title":  "(存根) Sapienza (《杀手》)",
                      "description":  "最后更新 4年前",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/sp/sapienza",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES",
                                          "单人关卡研究"
                                      ],
                      "searchText":  "(存根) Sapienza (《杀手》) 第 3 册，研究 单人关卡研究 (存根) Sapienza (《杀手》) 上一页 (存根) The Cradle (《神偷》 3) 下一步 (存根) Silent Cartographer (《光环》 1) 最后更新 4年前"
                  },
                  {
                      "href":  "studies__sp__silent-cartographer.html",
                      "title":  "(存根) Silent Cartographer (《光环》 1)",
                      "description":  "最后更新 4年前",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/sp/silent-cartographer",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES",
                                          "单人关卡研究"
                                      ],
                      "searchText":  "(存根) Silent Cartographer (《光环》 1) 第 3 册，研究 单人关卡研究 (存根) Silent Cartographer (《光环》 1) 上一页 (存根) Sapienza (《杀手》) 下一步 多人关卡研究 最后更新 4年前"
                  },
                  {
                      "href":  "studies__sp__undead-burg.html",
                      "title":  "不死镇（《黑暗之魂》1）",
                      "description":  "关于教学探索模式的线性单人城堡关卡",
                      "originalUrl":  "https://book.leveldesignbook.com/studies/sp/undead-burg",
                      "breadcrumbs":  [
                                          "BOOK 3, STUDIES",
                                          "单人关卡研究"
                                      ],
                      "searchText":  "不死镇（《黑暗之魂》1） 关于教学探索模式的线性单人城堡关卡 本文尚未完成/正在积极开发中。 为什么是《黑暗之魂》？ 《黑暗之魂》（ Steam ）是一款流行的第三人称奇幻动作角色扮演游戏，由 From Software 于 2011 年首次发布。它是“类魂”游戏类型的主导模板，启发了两款直接续作，并以其硬核设计方法和机制广泛影响了此后的所有动作游戏。 虽然大多数玩家专注于其惩罚性的难度，但他们常常忘记了游戏的另一半——《黑暗之魂》也是一款角色扮演游戏，知识、探索和磨练可以弥补战斗技能低下或反应迟钝的问题。知道在哪里可以找到有用的物品、隐藏的检查站/NPC 或简单的耕种路线，可以让 Boss 战斗变得更加容易。在维基上研究游戏是一种有效的游戏风格，甚至可能是当今玩《黑暗之魂》最常见的方式。 从关卡设计的角度来看，这是我们要关注的核心方面： 《黑暗之魂》如何管理和培养玩家知识？ 亡灵城堡背景 在教程（亡灵庇护所）和中心（传火神社）之后，NPC 会告诉玩家去教堂“向上”敲响钟声。爬上渡槽即可到达亡灵堡的屋顶，这是一座密集的中世纪城堡废墟，里面充满了僵尸士兵。 Undead Burg 有两个部分：Upper Undead Burg 是《黑暗之魂》的第一个“真正”关卡，为游戏的其余部分设定了期望和核心模式，而不再有直接的教程消息。大多数玩家会在几个小时后进入下层亡灵城堡，所以它基本上是一个单独的关卡，不会是本文的重点。 上层亡灵城堡结构 Upper Undead Burg 是一系列 3 个区域，通向 Boss 战（金牛座恶魔）。每个区域都有一个主要 主动线 以及循环回到主动线的短可选侧路径。 屋顶伏击 雾门笑话 易碎商人 篝火和塔楼 （请注意，这些区域名称不是官方标签或社区标准标注。） 屋顶伏击 你从楼梯顶部开始（ 路径1 如下图所示）在地面与两个近战敌人进行简单的战斗。 短暂的楼梯上升有助于突出主动线 穿过木桥（ 路径2 ）到远处的雾门。 第三个近战敌人也可以走过桥来帮忙 拉 注意，以防大而明亮的发光雾门还不够。虽然有一个备用出口，但它被一些易碎的桶隐藏了。 Undead Burg 屋顶第一拍示意图 这座小桥有很多作用： 这座桥是一个咽喉要道 ，强迫你去战斗。如果你试图跑过前两个敌人，第三个敌人可能会切断你的路。然后你被困在桥上，夹在一群暴徒中间。 “不要试图逃避你的问题，”桥说，“否则你的问题只会变得更糟。正面面对它们，一次一个！在到达桥之前不要跨过这座桥！” 这座桥有助于隐藏伏击， 轻轻地将你的方法从左侧黑暗的门口转移开，第四个敌人正在埋伏。 （见下面的屏幕截图，右）...这是许多伏击中的第一个。永远不要相信桥梁。 （左）第一次战斗短楼梯和雾门截图，（右）过桥截图，左边看不到门口 击败所有敌人后，你盯着雾门停了下来。 你还记得亡灵庇护所教程关卡中的前一个雾门，大约 15 分钟前——它通向庇护恶魔 Boss，可能会杀死你几次。你感觉还没准备好这么快再次参加一场大老板之战。 于是你就逃避并通过探索来“拖延”。 从雾门往下看，可以注意到下面有一个发光的战利品拾取物引导线索。一些易碎的桶会露出隐藏的掉落物（ 路径3 如下图所示）直至战利品。从那里还可以在底层看到另一个发光的战利品。 亡灵城堡（可选）第二节的示意图，下层有很多伏击 只有一种方法可以返回：一路下降，穿过一座房子，然后爬上梯子到城堡墙的顶部，回到你开始的地方（ 路径4 ). 但一旦你开始，两个僵尸就会从壁架上爬上来伏击你。 从伏击中幸存下来后，细心的玩家可能会看到下面有四个悬挂的僵尸——一场更大的伏击正在等待。 （TODO：路径 4 的屏幕截图） 在这里，可以通过尽早攻击这些悬挂的敌人来挫败伏击。关卡设计师本可以轻松地将这些悬挂的伏击者隐藏在另一侧，但相反，它们却暴露在外，暗示如果你足够聪明，伏击是“公平的”。 当你从城墙上跳下来时，你又回到了路径1。这些 单向下降/纵向空间强制单向动线，无回溯； 每条路径都是独立且不同的，并且 下降到楼梯作为一个地标。 就像关卡设计师说的，“那是一次有趣的小旅行，但现在说真的，只要穿过他妈的雾门就可以了。” （路径5） Undead Burg第一部分的所有主要路径和节拍图；省略了死胡同辅助路径 实际上，只有路径 1 -\u003e 2 才是主动线。为什么这个区域的大部分是“可选的”？ 鼓励探索。 《黑暗之魂》的大部分内容都是“可选的”——玩家必须学会探索侧面区域。很明显，这里有很多值得探索的地方，但在后面的关卡中就不太明显了。 支持失败/重复运行。 如果你在到达下一个篝火检查点之前死亡，你将不得不再次运行这个区域，但至少你可以绕过你已经探索过的可选区域。 通过相遇寻找路。 在第一场战斗中，第三个敌人从后面开始，这有助于将玩家拉过桥到达下一个区域（雾门）。 与许多格斗游戏一样， 敌人充当引导线索。 所有其他的遭遇战都是伏击训练，逐渐升级 教学/测试/扭曲 节奏模式： 雾门外埋伏—— 1 个敌人， 半可预测的敌人站在可疑的门口 底部壁架埋伏 - 2个敌人 ，不可预测，隐藏的敌人 梯子前的大埋伏—— 4个敌人 ，非常可预测的“隐藏”敌人，可以被挫败 行动中的迭代 在分析关卡数据时，旧的细节关卡 (LOD) 模型显示出两个差异： 一开始这里曾经有一座房子。 也许这里以前没有发生过战斗，或者可能没有雾门，所以将玩家瞄准该建筑物对于寻路来说更重要。 屋顶也是从上面的阳台下降的安全方法（通过路径 6）。 高桥没有被破坏。 也许建筑物之间还有另一条路，或者桥上有敌人？不管是什么，情况都更加复杂。 旧版Undead Burg的截图，小房子和桥梁完好无损（红色框出） 重访屋顶：高桥跳 回访时，您可能会注意到两座建筑物之间有一座断桥（路径 6）。这是游戏中最宽容的跳跃，下方有一个短暂的安全坠落。 但这也是一个秘密。与许多第三人称游戏不同， 《黑暗之魂》没有跳跃按钮；跳跃是一种从未有过指导的机制 这涉及到轻中型设备负载下的运行闪避翻滚。许多玩家在惊慌失措地进行闪避翻滚时发现意外跳跃。有些人根本就没有发现它。 因此，奖励——一把轻弩——似乎只对经验丰富的玩家有用。 （TODO：路径6的图像/跳转） 雾门笑话 所以现在除了进入雾门之外别无他法。此时，初次玩家会觉得准备好了吗？可能不会。这就是重点。 开个玩笑 雾门感觉很恐怖。 你看不到另一边有什么，你可能会被困在另一边而无法逃脱。庇护恶魔 Boss 战的雾门发生在 15-30 分钟前。 这个关卡让玩家做好了随时可能遭遇战伏击的准备 。确实有来自另一个门口的伏击！如果他们已经遭受了好几次伏击，那么另一边等待着他们的又是什么？也许是更糟糕的伏击。 玩家已经杀死了 10-20 个敌人才能达到这一点，所以他们拥有 500-1000 个灵魂，并且他们可能已经使用了一半的治疗药水。 他们会觉得自己会失去很多，因为未来的大战所用的资源越来越少。 妙语 你鼓足勇气，进入了雾门……而且没有敌人。这只是一个空房间，有一些楼梯。 这是一个笑话吗？雾门毫无意义吗？老板在哪儿？ 哈哈，也许这个游戏并没有那么难！ 当你自信地登上楼梯走向阳光时，一条巨龙突然从不知何处俯冲而下，如果你冲得太快，可能会一击杀死你。 （TODO：空雾门房间+龙攻击的截图） 这是一个精彩而残酷的关卡设计笑话。 整个节奏增强了初次玩家的焦虑和期望，似乎发布了反高潮……然后引发了不可预测的不公平的瞬间死亡，强大的老板可以一击杀死你，看似偶然。你甚至没有尊严地看到老板的名字和健康栏，相反，这只是一个预告片过场动画，可以完全抹杀你。与之前愚蠢的4敌伏击失败不同，这完全是你无法控制的。 就好像关卡设计师在玩弄你一样。 “我可以瞬间摧毁你，”他们说，“这就是你的重要性。” （如果这感觉很色情也没关系，因为确实如此。） 易碎商人 （TODO：遇到截图） 下一个区域也是关于探索的，只不过这次很容易错过支线，因为战斗会将你拉到下一个区域，并且没有雾门让你停下来探索。 它还与 Breakables 相关，具有 3 种不同的 Breakables 节拍。 进入雾门，爬上一些楼梯，差点被龙杀死后，你将面临迄今为止最具挑战性的战斗： 两个近战敌人 从易碎的路障后面冲出去。如果你还没有意识到你可以打破看起来很糟糕的木头垃圾，那么希望这两个敌人能教你。 第三个远程敌人 从后面的塔发射箭。身高很重要；它可以将弓箭手与其他敌人区分开来，提供良好的射击路线，并将其束缚到该位置。 （更困难的遭遇战会让弓箭手从不同的点进行机动和射击。） 第四个近战敌人 在后面，在楼梯处，所以他们需要一段时间才能走过去加入战斗。 这是整个游戏中常见的遭遇战设置：你必须在被狙击的同时与附近的敌人周旋，如果你花的时间太长，就会有更多的敌人加入。 （待办事项：屏幕截图） 长而平坦的走道有一个重要的战斗目的：你可以后退，将近战暴徒引下楼梯，远离弓箭手的射程。 （一种不太慷慨的做法是单向下降，没有任何后退空间。） 但相当开放的竞技场地板也让你玩得更积极。更有经验的玩家可以跳舞来攻击怪物，同时根据弓箭手（慢）射速的节奏进行格挡/躲避。 最终，玩家会冲上楼梯去抓住那个讨厌的弓箭手（路径 8），沿着通往前方篝火的主动线。 在篝火旁休息（所有敌人都会重生）并原路返回后，这次遭遇战就容易多了。你可以立即杀死弓箭手，然后在楼梯上单独与一个近战敌人作战，有时不会激怒任何面对路障的敌人。 从弓箭手塔上你可以看到另一个屋顶上有两个矛兵。向下的楼梯被一些易碎的板条箱笨拙地隐藏起来 打破一些板条箱，然后下楼进入（路径9） 在这里，商人出售各种基本武器和一些消耗品，以使即将到来的可选中老板和/或主老板变得更容易。玩家还可以改变他们的游戏风格、补给或购买钥匙来解锁通往老板的捷径。 很少有游戏会厚颜无耻地引入一个安全的中心城镇区域（Firelink Shrine），然后在地牢的中途隐藏一个更有用的 NPC，但《黑暗之魂》却一再这样做。虽然隐藏这样一个重要的早期 NPC 可能看起来很奇怪、晦涩和充满敌意，但实际上，当从附近的篝火中重生时，它提供了更方便的访问方式。 这是一个重要的关卡设计课程：您必须针对您正在制作的实际游戏进行设计。由于《黑暗之魂》的机制和美学，这种 NPC 放置比强迫玩家一路原路返回到中心城镇区域更有意义。 路径10 被躲在里面一些易碎物品后面的近战敌人伏击 与一些排成一排的弱近战敌人战斗 就像之前的路径 4 循环一样：爬上梯子，从屋顶跳下来，直接回到起始楼梯间 （这种模式后来在金牛座恶魔 Boss 战中第三次重复，同时也让人想起庇护恶魔跳入教程阳台） 塔楼和小巷 TODO：区域 3 的撰写 要审查... 上层亡灵城堡 为玩家介绍重要的关卡设计模式/策略/技能： 屋顶 带领玩家经历一系列逐渐升级的伏击。每条支线都是单向，并反馈至雾门。当玩家最终面对可怕的雾门时，感觉就像一个笑话——没有敌人或头目战斗，但仍然存在意外的危险。 商人 区域测试玩家是否真正在探索，将游戏的第一个商人（！）隐藏在一些易碎物品下方的侧面区域中。希望玩家记得如何进入屋顶的较低区域。 篝火和塔楼 是一系列更复杂的战斗，远程攻击者从塔上向玩家施压。玩家必须以最佳顺序管理小怪并应对威胁。这也是从篝火到boss的主要路线，如果玩家探索（找到商人并购买钥匙），就会有一条可解锁的捷径 更多链接 Noclip 上的亡灵城堡"
                  }
              ],
    "nav":  [
                {
                    "href":  "index.html",
                    "depth":  0,
                    "label":  "The Level Design Book 中文版",
                    "section":  ""
                },
                {
                    "href":  "introduction.html",
                    "depth":  1,
                    "label":  "✨ 什么是关卡设计",
                    "section":  ""
                },
                {
                    "href":  "process__overview.html",
                    "depth":  2,
                    "label":  "🗺️ 如何制作一个关卡",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__preproduction.html",
                    "depth":  2,
                    "label":  "🧠 前期设计",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__preproduction__pacing.html",
                    "depth":  3,
                    "label":  "节奏",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__preproduction__research.html",
                    "depth":  3,
                    "label":  "调研",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__preproduction__worldbuilding.html",
                    "depth":  3,
                    "label":  "世界构建",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__preproduction__scope.html",
                    "depth":  3,
                    "label":  "范围控制",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__combat.html",
                    "depth":  2,
                    "label":  "🔫 战斗",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__combat__enemy.html",
                    "depth":  3,
                    "label":  "敌人设计",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__combat__encounter.html",
                    "depth":  3,
                    "label":  "遭遇战",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__combat__cover.html",
                    "depth":  3,
                    "label":  "掩体",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__combat__balance.html",
                    "depth":  3,
                    "label":  "地图平衡",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__layout.html",
                    "depth":  2,
                    "label":  "🛠️ 布局",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__layout__flow.html",
                    "depth":  3,
                    "label":  "动线",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__layout__flow__circulation.html",
                    "depth":  4,
                    "label":  "空间流线",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__layout__flow__verticality.html",
                    "depth":  4,
                    "label":  "纵向/垂直空间",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__layout__criticalpath.html",
                    "depth":  3,
                    "label":  "主动线",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__layout__parti.html",
                    "depth":  3,
                    "label":  "设计概念草图",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__layout__typology.html",
                    "depth":  3,
                    "label":  "类型学",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__layout__typology__gates.html",
                    "depth":  4,
                    "label":  "门与关口",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout.html",
                    "depth":  2,
                    "label":  "🏠 白盒",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__massing.html",
                    "depth":  3,
                    "label":  "体块",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__massing__landscape.html",
                    "depth":  4,
                    "label":  "景观地形",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__massing__composition.html",
                    "depth":  4,
                    "label":  "构图",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__massing__prospect-refuge.html",
                    "depth":  4,
                    "label":  "眺望-庇护",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__metrics.html",
                    "depth":  3,
                    "label":  "标准尺度规范",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__metrics__modular.html",
                    "depth":  4,
                    "label":  "模块化套件设计",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__metrics__doom.html",
                    "depth":  4,
                    "label":  "《毁灭战士》 尺度",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__metrics__quake.html",
                    "depth":  4,
                    "label":  "《雷神之锤》 尺度",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__wayfinding.html",
                    "depth":  3,
                    "label":  "寻路与引导",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__playtesting.html",
                    "depth":  3,
                    "label":  "试玩测试",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__blockout__playtesting__persona.html",
                    "depth":  4,
                    "label":  "玩家画像",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__scripting.html",
                    "depth":  2,
                    "label":  "📜 脚本",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__scripting__nav.html",
                    "depth":  3,
                    "label":  "(存根) 导航",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__scripting__doors.html",
                    "depth":  3,
                    "label":  "门",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__lighting.html",
                    "depth":  2,
                    "label":  "☀️ 灯光",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__lighting__three-point.html",
                    "depth":  3,
                    "label":  "三点布光",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__lighting__d6-lighting.html",
                    "depth":  3,
                    "label":  "D6 灯光法",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__lighting__darkness.html",
                    "depth":  3,
                    "label":  "黑暗场景灯光",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__env-art.html",
                    "depth":  2,
                    "label":  "🏡 环境美术",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__env-art__psychology.html",
                    "depth":  3,
                    "label":  "形状与色彩心理学",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__env-art__texturing.html",
                    "depth":  3,
                    "label":  "材质",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__env-art__storytelling.html",
                    "depth":  3,
                    "label":  "叙事",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__env-art__optimization.html",
                    "depth":  3,
                    "label":  "优化",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "process__release.html",
                    "depth":  2,
                    "label":  "🌈 发布",
                    "section":  "BOOK 1, PROCESS"
                },
                {
                    "href":  "culture__overview.html",
                    "depth":  2,
                    "label":  "🦜 作为文化的关卡设计",
                    "section":  "BOOK 2, CULTURE"
                },
                {
                    "href":  "culture__history-level-designer.html",
                    "depth":  2,
                    "label":  "关卡设计师简史",
                    "section":  "BOOK 2, CULTURE"
                },
                {
                    "href":  "culture__zero-player.html",
                    "depth":  2,
                    "label":  "零玩家关卡设计",
                    "section":  "BOOK 2, CULTURE"
                },
                {
                    "href":  "culture__unfinished-pages.html",
                    "depth":  2,
                    "label":  "未完成页面",
                    "section":  "BOOK 2, CULTURE"
                },
                {
                    "href":  "culture__unfinished-pages__history-of-architecture.html",
                    "depth":  3,
                    "label":  "建筑史",
                    "section":  "BOOK 2, CULTURE"
                },
                {
                    "href":  "culture__unfinished-pages__structural-engineering-primer.html",
                    "depth":  3,
                    "label":  "结构工程入门",
                    "section":  "BOOK 2, CULTURE"
                },
                {
                    "href":  "culture__unfinished-pages__history-of-environment-art.html",
                    "depth":  3,
                    "label":  "环境美术史",
                    "section":  "BOOK 2, CULTURE"
                },
                {
                    "href":  "culture__unfinished-pages__history-of-furniture.html",
                    "depth":  3,
                    "label":  "家具史",
                    "section":  "BOOK 2, CULTURE"
                },
                {
                    "href":  "culture__unfinished-pages__history-encounter-design.html",
                    "depth":  3,
                    "label":  "遭遇战设计史",
                    "section":  "BOOK 2, CULTURE"
                },
                {
                    "href":  "studies__overview.html",
                    "depth":  2,
                    "label":  "🔍 如何研究一个关卡",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__sp.html",
                    "depth":  2,
                    "label":  "单人关卡研究",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__sp__undead-burg.html",
                    "depth":  3,
                    "label":  "不死镇（《黑暗之魂》1）",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__sp__assassins.html",
                    "depth":  3,
                    "label":  "Assassins (《神偷》 1)",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__sp__cradle.html",
                    "depth":  3,
                    "label":  "(存根) The Cradle (《神偷》 3)",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__sp__sapienza.html",
                    "depth":  3,
                    "label":  "(存根) Sapienza (《杀手》)",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__sp__silent-cartographer.html",
                    "depth":  3,
                    "label":  "(存根) Silent Cartographer (《光环》 1)",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__mp.html",
                    "depth":  2,
                    "label":  "多人关卡研究",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__mp__chill-out.html",
                    "depth":  3,
                    "label":  "Chill Out (《光环》 1)",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__mp__de_dust2.html",
                    "depth":  3,
                    "label":  "(存根) de_dust2 (《反恐精英》)",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__irl.html",
                    "depth":  2,
                    "label":  "现实空间研究",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__irl__disneyland.html",
                    "depth":  3,
                    "label":  "迪士尼乐园 (美国加利福尼亚)",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "studies__irl__stub-las-vegas-nevada-usa.html",
                    "depth":  3,
                    "label":  "(存根) 拉斯维加斯 (美国内华达)",
                    "section":  "BOOK 3, STUDIES"
                },
                {
                    "href":  "learning__notes.html",
                    "depth":  2,
                    "label":  "🎒 给教学者的笔记",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects.html",
                    "depth":  2,
                    "label":  "项目计划",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects__classic-combat.html",
                    "depth":  3,
                    "label":  "经典战斗",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects__unfinished-wip-pages.html",
                    "depth":  3,
                    "label":  "未完成 WIP 页面",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects__unfinished-wip-pages__modern-combat.html",
                    "depth":  4,
                    "label":  "现代战斗",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects__unfinished-wip-pages__modern-stealth.html",
                    "depth":  4,
                    "label":  "现代潜行",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects__unfinished-wip-pages__exercise-direct-lighting.html",
                    "depth":  4,
                    "label":  "练习：直射光",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects__unfinished-wip-pages__exercise-whiteboard-2d.html",
                    "depth":  4,
                    "label":  "练习：2D 白板图",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects__unfinished-wip-pages__level-design-portfolio.html",
                    "depth":  4,
                    "label":  "关卡设计作品集",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects__unfinished-wip-pages__adaptation.html",
                    "depth":  4,
                    "label":  "设计测试：改编",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects__unfinished-wip-pages__exercise-floorplan.html",
                    "depth":  4,
                    "label":  "练习：布局",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "learning__projects__unfinished-wip-pages__verticality.html",
                    "depth":  4,
                    "label":  "练习：纵向/垂直空间",
                    "section":  "BOOK 4, LEARNING"
                },
                {
                    "href":  "appendix__tools.html",
                    "depth":  2,
                    "label":  "工具",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__tools__trenchbroom.html",
                    "depth":  3,
                    "label":  "TrenchBroom",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__resources.html",
                    "depth":  2,
                    "label":  "资产与资源",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__resources__talks.html",
                    "depth":  3,
                    "label":  "推荐演讲",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__resources__books.html",
                    "depth":  3,
                    "label":  "推荐书目",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__resources__quake.html",
                    "depth":  3,
                    "label":  "《雷神之锤》资源",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__resources__quake__how-to-package.html",
                    "depth":  4,
                    "label":  "如何打包 《雷神之锤》 地图/Mod",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__resources__formats.html",
                    "depth":  3,
                    "label":  "文件格式",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__resources__formats__fgd.html",
                    "depth":  4,
                    "label":  "FGD 文件格式",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__resources__formats__map.html",
                    "depth":  4,
                    "label":  "MAP 文件格式",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__resources__formats__mdl.html",
                    "depth":  4,
                    "label":  "MDL 文件格式",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__communities.html",
                    "depth":  2,
                    "label":  "社区",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__about.html",
                    "depth":  2,
                    "label":  "关于本书与作者",
                    "section":  "APPENDIX"
                },
                {
                    "href":  "appendix__license.html",
                    "depth":  2,
                    "label":  "许可与版权",
                    "section":  "APPENDIX"
                }
            ]
};